package com.ruzibekov.quran.transcription.data

class SurahRepository {

    private val surahs = listOf(
        Surah(
            id = 1,
            arabicName = "Al-Fatiha",
            latinName = "Ал-Фотиҳа",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Алҳамду лиллааҳи роббил ъааламин
                Арроҳмаанир роҳийм
                Маалики йавмид-диин
                Иййаака наъбуду ва иййаака настаъийн
                Иҳдина ссирооталь мустақиим
                Сирооталлозиина анъамта ъалайҳим ғайрил-мағзуууби ъалайҳим ва лад-длоооллиин
            """.trimIndent(),
        ),
        Surah(
            id = 36,
            arabicName = "Ya-Sin",
            latinName = "Йаасин",
            transliteration = """
                Йаа Сиийн
                Валқуръаанил ҳакиим
                Иннака ламинал-мурсалиин
                Ъалаа сироотим мустақиим
                Танзиилал-ъазиизир роҳийм
                Литунзира қауман маа унзира аабааухум фаҳум ғоофилуун
                Лақад ҳаққал-қавлу ъалаа аксариҳим фаҳум лаа йуъминуун
                Иннаа жаъалнаа фии аъноқиҳим ағлаалан фаҳия ила-л-азқоони фаҳум муқмахуун
                Ва жаъална мин байна айдийҳим саддан ва мин холфиҳим саддан фа ағшайнаҳум фаҳум лаа юбсируун
                Ва саваа'ун ъалайҳим а-анзартахум ам лам тунзирҳум лаа йуъминуун
                Иннамаа тунзиру маниттабаъа-ззикро ва хашилар-роҳмаана билғайб фа башширҳу бимагфиротин ва ажрин карийм
                Иннаа нахну нухйил мавтаа ва нактубу маа қоддаму ва аасаараҳум ва кулла шайъин аҳсоинайҳу фии имамин мубиин
                Вазриб лаҳум масалан асҳабал-қарийяти из жааҳа-л-мурсалуун
                Из арсална илайһим иснайни факаззабуҳума фа ъаззазнаа бисаалис фақоолуу иннаа илайкум мурсалуун
                Қоолуу маа антум иллаа башарун мислунаа ва маа анзаляр-роҳмаану мин шайъин ин антум иллаа такзибуун
                Қоолуу роббунаа йаъламу иннаа илайкум ламурсалуун
                Ва маа ъалайнаа иллал-балаагул мубиин
                Қоолуу иннаа татоййарна бикум лаин лам тантаҳу ланаржуманнакум ва лаямассакум миннаа ъазаабун алиим
                Қоолуу тоойрокум маъаакум а-ин зуккиртум бал антум қоумум мусрифуун
                Ва жааа мин ақсол-мадийнати ражулуун ясъа қоола яа қавм иттабиъул-мурсалиин
                Иттабиъуу ман лаа йас'алуккум ажран ва ҳум мухтадуун
                Ва маалийа лаа аъбудул-лазии фатарний ва илайҳи туржаъуун
                Аааттахизу мин дууниҳи аалиҳатан ин йуридниир-роҳмаану биддуррин лаа туғни ъанний шафаъатухум шайъан ва лаа юнқизуун
                Иннии изан лафии долалим мубиин
                Иннии ааманту бироббикум фассамиъуун
                Қийла удхулил-жанна қоола яа лайта қавмии йаъламуун
                Бимаа ғофара лийя роббий ва жаъаланий минал-мукрамиин
                Ва маа анзальнаа ъалаа қаумии мин баъдиҳи мин жундим-мин ассамааи ва маа куннаа мунзилиин
                Ин каанат иллаа сайҳатан вааҳидатан фа изаа ҳум хаамидуун
                Яа ҳасраатан ъала-л-ъибаад маа йаатииҳим мин росулин иллаа каануу биҳи йастаҳзиъуун
                Алам яроу кам аҳлакнаа қаблахум минал-қурууни аннаҳум илайһим лаа яржиъуун
                Ва ин куллун лламаа жамииун ладайна мухдаруун
                Ва аайатун лаҳумул ардул-майтату аҳяйнааҳа ва ахрожна минҳаа ҳаббан фа минҳу йаакулуун
                Ва жаъална фииҳаа жаннаатим мин нахлин ва аънаабин ва фаҷжарна фииҳа минал-ъуюун
                Лияакулуу мин самарихи ва маа амалатҳу айдийҳим афалаа йашкуруун
                Субҳанал-лазии халақал-азваажа куллахаа миммаа тунбитул-ард ва мин анфусиҳим ва миммаа лаа йаъламуун
                Ва аайатун лаҳумул-лайлу наслаху минҳу-н-наҳаар фа изаа ҳум музлимун
                Вашшамсу таджрий лимустақаррин лаҳаа заа ликтақдирул-ъазиизил ъалиим
                Валқамара қаддарнааҳу манаазила ҳаттаа ъаада кал-ъуржунил қадийм
                Лашшамсу янбағии лаҳаа ан тудрика-л-қамара ва лял-лайлу саабиқан-наҳаар ва куллун фии фалакин ясбахуун
                Ва аайатун лаҳум аннаа ҳамаллаа зуррийятаҳум фил-фулкил машҳуун
                Ва халақна лаҳум мин мислиҳи маа яркабуун
                Ва ин нашаъ нұғриқҳум фалаа сарииха лаҳум ва лаа ҳум юнқизуун
                Иллаа раҳматам миннаа ва матааъан илаа ҳиин
                Ва изаа қийла лаҳум уттақуу маа байна айдийкум ва маа холфакум лаъаллакум турҳамуун
                Ва маа таатииҳим мин аайатим-мин аайаати роббиҳим иллаа каануу ъанҳо муъризуун
                Ва изаа қийла лаҳум анфиқуу миммаа разақакумуллооҳу қоолал-лазиина кафаруу лиллазиина ааману анутъиму ман лав йашаауллооҳу атъамаҳу ин антум иллаа фии долалим мубиин
                Ва яқуулуун матаа һаазал-ваъду ин кунтум соодиқиин
                Маа йанзуруун иллаа сайҳатан вааҳидатан таъхузуҳум ва ҳум йахсимуун
                Фалаа йастатииъууна тавсийатан ва лаа илаа аҳлиҳим яржиъуун
                Ва нуфиха фис-суур фа изаа ҳум минал-аждаси илаа роббиҳим йансилуун
                Қоолуу яа вайланаа ман бааъасанаа мин марқадинааҳаазаа маа ваъадар-роҳмаану ва садақал-мурсалуун
                Ин каанат иллаа сайҳатан вааҳидатан фа изаа ҳум жамииун ладайна мухдаруун
                Фалйавма лаа тузламу нафсун шайъаа ва лаа туджаузууна иллаа маа кунтум таъмалуун
                Инна асҳаабал-жаннати-лйавма фии шуллин фаакихуун
                Ҳум ва азваажуҳум фии зилаалин ъалал-арааики мутакиуун
                Лаҳум фииҳаа фаакиҳатун ва лаҳум маа йаддаъуун
                Салаамун қоолан мир-роббир роҳийм
                Вамтаазул-йавма аййуҳал-мужримун
                Алам аъҳад илайкум яа баний Аадам аллаа таъбудуш-шайтоона иннаҳу лакум ъадууввум мубиин
                Ва аниъбудунии һаазаа сироотум мустақиим
                Валақад адалла минкум жибиллан касийран афалам такуунуу таъқилуун
                Ҳаазиҳи Жаҳаннамул-латии кунтум тууъадуун
                Иславҳаа-лйавма бимаа кунтум такфуруун
                Алйавма нахтиму ъалаа афвааҳиҳим ва тукаллимунаа айдийҳим ва ташҳаду арджулоҳум бимаа каану яксибуун
                Ва лав нашаа ла томасна ъалаа аъюнҳиҳим фастабақус-сироота фа аннаа юбсируун
                Ва лав нашаа ла масахнаа ҳум ъалаа маканатҳиҳим фа маа статоъуу мадиййан ва лаа яржиъуун
                Ва маннуъаммирҳу нунаккисҳу фил-халқ афалаа йаъқилуун
                Ва маа алламнаҳуш-шиъра ва маа янбағий лаҳу ин ҳува иллаа зикрув-Қуръанун мубиин
                Лиюнзира ман каана ҳаййан ва йаҳиққал-қавлу ъалаа-л-каафирин
                Авалам ярав аннаа халақна лаҳум миммаа амилат айдийнаа анаааман фаҳум лаҳаа мааликун
                Ва заллалнааҳаа лаҳум фа минҳаа ракубуҳум ва минҳаа йаъкулуун
                Ва лаҳум фииҳаа манаафиу ва машаариб афалаа йашкуруун
                Ваттахазуу мин дуунуллооҳи аалиҳатан лаъаллахум йунсаруун
                Лаа йастатииъууна насроҳум ва ҳум лаҳум жундум муҳдаруун
                Фа лаа йаҳзунка қавлуҳум иннаа наъламу маа юсиррун ва маа йаълінуун
                Авалам ярал-инсаану аннаа халақнаҳу мин нутфатин фа изаа ҳува хасиймум мубиин
                Ва дароба ланаа масалан ва насийа холқаҳу қоола ман йуҳйил-ъизоома ва ҳия рамим
                Қул йуҳйиҳал-лазии аншааҳаа авваля марраҳ ва ҳува бикулли холқин ъалиим
                Аллазии жаъала лакум мин аш-шаеҷарил-ахзари нааран фа изаа антум минҳу тууқидуун
                Авалайса-л-лазии халақас-самааваати вал-арзо биқаадирин ъалаа ан йахлуқамислахум балаа ва ҳува-л-халлаағул ъалиим
                Иннамаа амруҳу изаа араада шайъан ай яқуула лаҳу кун фаякуун
                Фасубҳанал-лазии бийадиҳи малакууту кулли шайъин ва илайҳи туржаъуун
            """.trimIndent(),
        ),
        Surah(
            id = 93,
            arabicName = "Ad-Duha",
            latinName = "Ад-Дуҳа",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Вад-дуҳаа
                Вал-лайли изаа сажаа
                Маа вададдака роббука ва маа қалаа
                Валал-ааахирату хайррун-ллака минал-уулаа
                Валасавфа юътийка роббука фатардаа
                Алам йажидка йатииман фаааваа
                Ва вожадака зооллан фаҳадаа
                Ва вожадака ъааилан фаағнаа
                Фаамма ал-йатиима фалаа тақҳар
                Ваамма ас-саа'ила фалаа танҳар
                Ваамма бинъимати роббика фаҳаддис
            """.trimIndent(),
        ),

        Surah(
            id = 94,
            arabicName = "Ash-Sharh",
            latinName = "Аш-Шарх",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Алам нашрах лака содрок
                Ва возаънаа ъанка визрок
                Аллазий анқада захрок
                Ва рафаънаа лака зикрок
                Фа-инна маъал-ъусри юсрон
                Инна маъал-ъусри юсрон
                Фа изаа фарағта фансаб
                Ва илаа роббика фарғаб
            """.trimIndent(),
        ),

        Surah(
            id = 95,
            arabicName = "At-Tin",
            latinName = "Ат-Тийн",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Ват-тиини ваз-зайтууни
                Ва туурии сиинийин
                Ва һаазаал-баладил-амийн
                Лақад халақнаал-инсаана фии ахсани тақуһим
                Сумма радднааҳу асфаласаафилиин
                Иллаа аллазиина аааману ва ъамилус-соолихаати фалахум ажрун ғайру мамнуун
                Фамаа юказзибука баъду бид-диин
                Алайса-ллооҳу би ахкамил-ҳаакимиин
            """.trimIndent(),
        ),

        Surah(
            id = 96,
            arabicName = "Al-Alaq",
            latinName = "Ал-Алақ",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Иқра' бисми роббикаллазии халақ
                Халақал-инсаана мин ъалак
                Иқра' ва роббука-л-акрам
                Аллазий ъаллама бил-қалам
                Ъалламал-инсаана маа лам йаълам
                Каллаа иннал-инсаана ляятғаа
                Арраааҳу стаъғнаа
                Инна илаа роббика-р-ружъа
                Араайтал-лазии йанҳаа
                Абдан изаа саллаа
                Араайта ин каана ъалал-худаа
                Ау амара бит-тақваа
                Араайта ин каззаба ва таваллаа
                Алам йаълам бианналлоҳа яроо
                Каллаа лаин лам йантаҳи ланасфаъан бин-наасияҳ
                Наасиятин каазибатин хоотий'а
                Фалйад'у наадийаҳ
                Санад'уз-забаанияҳ
                Каллаа лаа тутиъҳу васжуд вақтариб
            """.trimIndent(),
        ),

        Surah(
            id = 97,
            arabicName = "Al-Qadr",
            latinName = "Ал-Қадр",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Иннаа анзальнааҳу фии лайлати-л-қадр
                Ва маа адрока маа лайлатул-қадр
                Лайлатул-қадри хайрун мин алфиш-шахр
                Таназзалул-малааику вар-руҳу фииҳаа би изни роббиҳим мин кулли амр
                Салаамун ҳияа хаттаа матлааъил-фажр
            """.trimIndent(),
        ),

        Surah(
            id = 98,
            arabicName = "Al-Bayyina",
            latinName = "Ал-Баййина",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Лам йакун иллазиина кафару мин аҳлил-китааби вал-мушрикина мунфаккиина ҳаттаа таътияхумул-баййинаҳ
                Расуулун миналлоҳи йатлуу сухуфам мутахҳараҳ
                Фииҳаа кутубун қаййимаҳ
                Ва маа тафаррақаллазиина ъутуу-л-китааба иллаа мин баъди маа жаааҳумул-баййинаҳ
                Ва маа умируу иллаа лиъбудуллоҳа мухлисиинал-лаҳу-ддиин ҳунафаа ва юқиймус-солаата ва ю'түз-заката ва зааликта дину-л-қаййимаҳ
                Инналлазиина кафару мин аҳлил-китааби вал-мушрикина фии наари Жаҳаннама хоолидиина фииҳаа улааика ҳум шарарул-барийяҳ
                Инналлазиина аааману ва ъамилус-соолихаати улааика ҳум хайрул-барийяҳ
                Жазааухум ъинда роббиҳим жаннаату ъаднин таджрий мин таҳтиҳал-анҳоару хоолидиина фииҳаа абадаа разийаллоҳу ъанҳум ва разуу ъанҳу зааликал-ъисваан ли ман хошия роббах
            """.trimIndent(),
        ),

        Surah(
            id = 99,
            arabicName = "Az-Zalzalah",
            latinName = "Аз-Залзала",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Изаа зулзилатил-арду зилзаалаҳаа
                Ва ахрожатил-арду аҳкъаалаҳаа
                Ва қоолал-инсаану маа лаҳаа
                Йавма изин тухаддису ахбаараҳаа
                Би анна роббака авҳаалаҳаа
                Йавма изин йасдурун-наасу аштаатан лийуро ааъмалахум
                Фа ман яъмал мисқоола зарратин хайран йараҳ
                Ва ман яъмал мисқоола зарратин шарран йараҳ
            """.trimIndent(),
        ),

        Surah(
            id = 100,
            arabicName = "Al-Adiyat",
            latinName = "Ал-Ъодийат",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Вал-ъодийаати забҳаа
                Фал-мурияати қадҳаа
                Фал-муғиратис-субҳаа
                Фа асарна бихии нақъаа
                Фа васатна бихии жамъаа
                Иннал-инсаана ли роббихи лакафуур
                Ва иннаҳу ъалаа заалика лашаҳийд
                Ва иннаҳу ли хуббил-хайри лашадиид
                Афалаа йаъламу изаа буъсирра маа фил-қубур
                Ва ҳуссила маа фис-судуур
                Инна роббахум биҳим йавма изин лахабиир
            """.trimIndent(),
        ),

        Surah(
            id = 101,
            arabicName = "Al-Qariah",
            latinName = "Ал-Қориъа",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Ал-қоориъа
                Мал-қоориъа
                Ва маа адрока мал-қоориъа
                Йавма якууун-ннаасу кал-фарашил-мабсуус
                Ва такуунул-джибаалу кал-ъиҳнил-манфуш
                Фа аммаа ман сакаулат маваазиинуҳ
                Фа ҳува фии ъишатир-роодийа
                Ва аммаа ман хаффат маваазиинуҳ
                Фа уммуҳу һаавия
                Ва маа адрока маа һаавия
                Наарун хаавия
            """.trimIndent(),
        ),

        Surah(
            id = 102,
            arabicName = "At-Takathur",
            latinName = "Ат-Такосур",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Алҳаакумут-Такосур
                Ҳаттаа зуртумул-мақаабир
                Каллаа савфа таъламун
                Сумма каллаа савфа таъламун
                Каллаа лау таъламун ъилмал-йақиин
                Латоровуннал-Жаҳиим
                Сумма латоровуннаҳа ъайнал-йақиин
                Сумма латус'алунна йавма изин ъанин-наъийм
            """.trimIndent(),
        ),

        Surah(
            id = 103,
            arabicName = "Al-Asr",
            latinName = "Ал-Ъаср",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Вал-ъаср
                Иннал-инсаана лафии хуср
                Иллаллазиина аааману ва ъамилус-соолихаати ва таваасав бил-ҳаққи ва таваасав бис-сабр
            """.trimIndent(),
        ),

        Surah(
            id = 104,
            arabicName = "Al-Humazah",
            latinName = "Ал-Ҳумаза",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Вайлул-ли кулли ҳумазатил-лумазаҳ
                Аллазий жамаъа маалан ва аддадаҳ
                Яҳсабу анна маалаҳу ахладаҳ
                Каллаа лйумбазанна фил-ҳутама
                Ва маа адрока мал-ҳутама
                Нааруллоҳил-муқада
                Аллатии татталиъу ъалал-афъидаҳ
                Иннаҳаа ъалайҳим муғсода
                Фии ъамадим мумаддада
            """.trimIndent(),
        ),

        Surah(
            id = 105,
            arabicName = "Al-Fil",
            latinName = "Ал-Фиил",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Алам тара кайфа фаала роббука би асҳаабил-фиил
                Алам йаджаъл кайдахум фии тадлиил
                Ва арсала ъалайҳим тойрона абаабийл
                Тармииҳим би ҳааджаротим мин сижджиил
                Фа жаъалаҳум каасфин маакуул
            """.trimIndent(),
        ),

        Surah(
            id = 106,
            arabicName = "Quraysh",
            latinName = "Қурайш",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Лиилафи Қурайш
                Илаафихим рихлаташ-шитааи вас-сайф
                Фалйаъбудуу роббаҳааза-л-байт
                Аллазии атъаамаҳум мин жууъин ва ааманаҳум мин хавф
            """.trimIndent(),
        ),

        Surah(
            id = 107,
            arabicName = "Al-Ma'un",
            latinName = "Ал-Маъуун",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Араайтал-лазии йуказзибу бид-диин
                Фазааликал-лазии йадуъул-ятиим
                Ва лаа йаҳудду ъалаа тооъмил-мискиин
                Фа вайлул-лил-мусоллиин
                Аллазиина ҳум ъан солаатиҳим сааҳуун
                Аллазиина ҳум юроуун
                Ва ямнаъуунал-мааъуун
            """.trimIndent(),
        ),

        Surah(
            id = 108,
            arabicName = "Al-Kawthar",
            latinName = "Ал-Кавсар",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Иннаа аътайнаака-л кавсар
                Фасалли ли роббика ванҳар
                Инна шаанииъака ҳувал-абтар
            """.trimIndent(),
        ),

        Surah(
            id = 109,
            arabicName = "Al-Kafirun",
            latinName = "Ал-Кофирун",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Қул яа айюҳал коофируун
                Лаа аъбуду маа таъбудуун
                Ва лаа антум ъаабидууна маа аъбуд
                Ва лаа ана ъаабидун маа ъабадтум
                Ва лаа антум ъаабидууна маа аъбуд
                Лакум диинукум ва лия диин
            """.trimIndent(),
        ),

        Surah(
            id = 110,
            arabicName = "An-Nasr",
            latinName = "Ан-Наср",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Изаа жааа насрууллооҳи вал-фатҳ
                Ва раайтан-нааса йадхулууна фии диинуллооҳи афваажаа
                Фасаббих бихамди роббика вастагфирҳу иннаҳу каана тавваабаа
            """.trimIndent(),
        ),

        Surah(
            id = 111,
            arabicName = "Al-Masad",
            latinName = "Ал-Масад",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Таббат ядаа Абий Лаҳабин ва табб
                Маа ағна анҳу маалуҳу ва маа касаб
                Саяслаа наран заата лаҳаб
                Ва имраъатуҳу ҳаммаалатал-ҳатаб
                Фии жиидиҳаа ҳаблун мин-масад
            """.trimIndent(),
        ),

        Surah(
            id = 112,
            arabicName = "Al-Ikhlas",
            latinName = "Ал-Ихлос",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Қул ҳуваллооҳу аҳад
                Аллооҳус-самад
                Лам ялид ва лам юулад
                Ва лам якун-лаҳу куфуван аҳад
            """.trimIndent(),
        ),

        Surah(
            id = 113,
            arabicName = "Al-Falaq",
            latinName = "Ал-Фалақ",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Қул аъуузу би раббил-фалақ
                Мин шарри маа холақ
                Ва мин шарри ғоосиқин изаа вақаб
                Ва мин шаррин-наффосати фил-ъуқад
                Ва мин шарри ҳаасидин изаа ҳасад
            """.trimIndent(),
        ),

        Surah(
            id = 114,
            arabicName = "An-Nas",
            latinName = "Ан-Нас",
            transliteration = """
                Бисмиллааҳир роҳмаанир роҳийм
                Қул аъуузу би раббин-наас
                Маликин-наас
                Илааҳин-наас
                Мин шаррил васваасил хоннаас
                Аллаазиий ювасвису фиий судуурин-наас
                Минал жиннати ван-наас
            """.trimIndent(),
        ),
    )

    fun getSurahs(): List<Surah> = surahs
    fun getSurahById(id: Int): Surah? = surahs.firstOrNull { it.id == id }
}
