package com.ruzibekov.quran.transcription.data

import javax.inject.Inject

class SurahRepository @Inject constructor() {

    private val surahs = listOf(
        Surah(
            id = 1,
            arabicName = "الفاتحة",
            latinName = "Al-Fatihah",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Алҳамду лиллааҳи роббил ъааламин
                                Арроҳмаанир роҳийм
                                Маалики йавмид-диин
                                Иййаака наъбуду ва иййаака настаъийн
                                Иҳдина ссирооталь мустақиим
                                Сирооталлозиина анъамта ъалайҳим ғайрил-мағзуууби ъалайҳим ва лад-длоооллиин
            """.trimIndent(),
        ),
        Surah(
            id = 2,
            arabicName = "البقرة",
            latinName = "Al-Baqarah",
            transliteration = """
                Алифламмийм
                Салика алкитабу ла райба фийҳи ҳудан лилмуттақийна
                Аллазийна йуминуна биалғайби вайуқиймуна ассалата вамимма разақнаҳум йунфиқуна
                Вааллазийна йуминуна бима онзила илайка вама онзила мин қаблика вабиалахирати ҳум йуқинуна
                Олайка ааала ҳудан мин роббиҳим ваолайка ҳуму алмуфлиҳуна
                Инна аллазийна кафару сауаон ааалайҳим аансартаҳум ам лам тунсирҳум ла йуминуна
                Хатама аллааҳу ааала қулубиҳим ваааала самааиҳим ваааала абсариҳим ғишауатун валаҳум ааасабун ааасиймун
                Вамина аннаси ман йақулу аманна биаллааҳи вабиалйауми алахири вама ҳум бимуминийна
                Йухадиаауна аллааҳа вааллазийна аману вама йахдааауна илла анфусаҳум вама йашаауруна
                Фий қулубиҳим марадун фазадаҳуму аллааҳу марадан валаҳум ааасабун алиймун бима кану йаксибуна
                Вайса қийла лаҳум ла туфсиду фий аларди қалу иннама наҳну муслиҳуна
                Ала иннаҳум ҳуму алмуфсидуна валакин ла йашаауруна
                Вайса қийла лаҳум амину кама амана аннасу қалу анумину кама амана ассуфаҳао ала иннаҳум ҳуму ассуфаҳао валакин ла йаааламуна
                Вайса лақу аллазийна аману қалу аманна вайса халау ила шайатийниҳим қалу инна маааакум иннама наҳну мустаҳзиуна
                Аллааҳу йастаҳзио биҳим вайамуддуҳум фий туғйаниҳим йааамаҳуна
                Олайка аллазийна иштарауу аддалалата биалҳуда фама робиҳат тижаратуҳум вама кану муҳтадийна
                Масалуҳум камасали аллазий истауқада наран фаламма адаат ма ҳаулаҳу саҳаба аллааҳу бинуриҳим ватаракаҳум фий сулуматин ла йубсируна
                Суммун букмун ааумйун фаҳум ла йаржиаауна
                Ау касаййибин мина ассамай фийҳи сулуматун варааадун вабарқун йажааалуна асабиаааҳум фий асаниҳим мина ассауааайқи ҳасара алмаути вааллааҳу муҳийтун биалкафирийна
                Йакаду албарқу йахтафу абсароҳум куллама адаа лаҳум машау фийҳи вайса аслама ааалайҳим қаму валау шаа аллааҳу ласаҳаба бисамааиҳим ваабсариҳим инна аллааҳа ааала кулли шайин қадийрун
                Йа аййуҳа аннасу оаабуду роббакуму аллазий халақакум вааллазийна мин қабликум лааааллакум таттақуна
                Аллазий жаааала лакуму аларда фирашан ваалссамаа бинаан ваанзала мина ассамай маан фаахража биҳи мина ассамарати ризқан лакум фала тажааалу лиллаҳи андадан ваантум таааламуна
                Вайн кунтум фий райбин мимма наззална ааала ааабдина фату бисуратин мин мислиҳи ваодаау шуҳадаакум мин дуни аллааҳи ин кунтум садиқийна
                Файн лам тафааалу валан тафааалу файттақу аннара аллатий вақудуҳа аннасу ваалҳижарату оааиддат лилкафирийна
                Вабашшири аллазийна аману ваааамилу ассалиҳати анна лаҳум жаннатин тажрий мин таҳтиҳа аланҳару куллама рузиқу минҳа мин самаратин ризқан қалу ҳаса аллазий рузиқна мин қаблу ваоту биҳи муташабиҳан валаҳум фийҳа азважун мутаҳҳаратун ваҳум фийҳа халидуна
                Инна аллааҳа ла йастаҳйий ан йадриба масалан ма баааудатан фама фауқаҳа фаамма аллазийна аману файаааламуна аннаҳу алҳаққу мин роббиҳим ваамма аллазийна кафару файақулуна маса арада аллааҳу биҳаса масалан йудиллу биҳи касийран вайаҳдий биҳи касийран вама йудиллу биҳи илла алфасиқийна
                Аллазийна йанқудуна аааҳда аллааҳи мин бааади мийсақиҳи вайақтааауна ма амара аллааҳу биҳи ан йусала вайуфсидуна фий аларди олайка ҳуму алхасируна
                Кайфа такфуруна биаллааҳи вакунтум амватан фааҳкум сумма йумийтукум сумма йуҳйийкум сумма илайҳи туржааауна
                Ҳува аллазий халақа лакум ма фий аларди жамийааан сумма истауа ила ассамай фасауваҳунна сабааа самауатин ваҳува бикулли шайин ааалиймун
                Вайс қала роббука лилмалайкати инний жааайлун фий аларди халийфатан қалу атажааалу фийҳа ман йуфсиду фийҳа вайасфику аддимаа ванаҳну нусаббиҳу биҳамдика вануқаддису лака қала инний аааламу ма ла таааламуна
                Вааааллама адама аласмаа куллаҳа сумма ааарадаҳум ааала алмалайкати фақала анбиуний биасмай ҳаолай ин кунтум садиқийна
                Қалу субҳанака ла ааилма лана илла ма ааалламтана иннака анта алааалийму алҳакийму
                Қала йа адаму анбиҳум биасмайҳим фаламма анбааҳум биасмайҳим қала алам ақул лакум инний аааламу ғайба ассамауати вааларди вааааламу ма тубдуна вама кунтум тактумуна
                Вайс қулна лилмалайкати осжуду лиадама фасажаду илла иблийса аба вайстакбара вакана мина алкафирийна
                Вақулна йа адаму оскун анта вазаужука алжанната вакула минҳа рағадан ҳайсу шитума вала тақроба ҳасиҳи ашшажарата фатакуна мина ассалимийна
                Фаазаллааҳума ашшайтану ааанҳа фаахражаҳума мимма кана фийҳи вақулна иҳбиту бааадукум либааадин ааадуввун валакум фий аларди мустақаррун ваматаааун ила ҳийнин
                Фаталаққа адаму мин роббиҳи калиматин фатаба ааалайҳи иннаҳу ҳува аттаувабу арроҳийму
                Қулна иҳбиту минҳа жамийааан файмма йатийаннакум минний ҳудан фаман табиааа ҳудайа фала хауфун ааалайҳим вала ҳум йаҳзануна
                Вааллазийна кафару вакассабу биайатина олайка ашабу аннари ҳум фийҳа халидуна
                Йа баний исраийла оскуру ниааматийа аллатий анааамту ааалайкум ваавфу биаааҳдий уфи биаааҳдикум вайййайа файрҳабуни
                Ваамину бима анзалту мусаддиқан лима маааакум вала такуну аувала кафирин биҳи вала таштару биайатий саманан қалийлан вайййайа файттақуни
                Вала талбису алҳаққа биалбатили ватактуму алҳаққа ваантум таааламуна
                Ваақийму ассалата ваату аззаката вайркааау маааа арракиааийна
                Атамуруна аннаса биалбирри ватансауна анфусакум ваантум татлуна алкитаба афала тааақилуна
                Вайстаааийну биалссабри ваалссалати вайннаҳа лакабийратун илла ааала алхашиааийна
                Аллазийна йасуннуна аннаҳум мулақу роббиҳим вааннаҳум илайҳи ражиаауна
                Йа баний исраийла оскуру ниааматийа аллатий анааамту ааалайкум ваанний фаддалтукум ааала алаааламийна
                Вайттақу йауман ла тажзий нафсун ааан нафсин шайан вала йуқбалу минҳа шафаааатун вала йухасу минҳа ааадлун вала ҳум йунсаруна
                Вайс нажжайнакум мин али фирааауна йасумунакум суа алааасаби йусаббиҳуна абнаакум вайастаҳйуна нисаакум вафий саликум балаон мин роббикум ааасиймун
                Вайс фарақна бикуму албаҳра фаанжайнакум ваағрақна ала фирааауна ваантум тансуруна
                Вайс ваааадна муса арбаааийна лайлатан сумма иттахастуму алааижла мин бааадиҳи ваантум салимуна
                Сумма ааафауна ааанкум мин бааади салика лааааллакум ташкуруна
                Вайс атайна муса алкитаба ваалфурқана лааааллакум таҳтадуна
                Вайс қала муса лиқаумиҳи йа қауми иннакум саламтум анфусакум бийттихасикуму алааижла фатубу ила барийкум фаоқтулу анфусакум саликум хайрун лакум ааинда барийкум фатаба ааалайкум иннаҳу ҳува аттаувабу арроҳийму
                Вайс қултум йа муса лан нумина лака ҳатта нара аллааҳа жаҳратан фаахасаткуму ассааайқату ваантум тансуруна
                Сумма бааааснакум мин бааади маутикум лааааллакум ташкуруна
                Васаллална ааалайкуму алғамама ваанзална ааалайкуму алманна ваалссалва кулу мин таййибати ма разақнакум вама саламуна валакин кану анфусаҳум йаслимуна
                Вайс қулна одхулу ҳасиҳи алқарйата факулу минҳа ҳайсу шитум рағадан ваодхулу албаба сужжадан вақулу ҳиттатун нағфир лакум хатайакум васаназийду алмуҳсинийна
                Фабаддала аллазийна саламу қаулан ғайра аллазий қийла лаҳум фаанзална ааала аллазийна саламу рижзан мина ассамай бима кану йафсуқуна
                Вайси истасқа муса лиқаумиҳи фақулна идриб биааасака алҳажара файнфажарат минҳу исната ааашрата ааайнан қад ааалима куллу онасин машробаҳум кулу вайшробу мин ризқи аллааҳи вала тааасау фий аларди муфсидийна
                Вайс қултум йа муса лан насбира ааала таааамин ваҳидин фаодаау лана роббака йухриж лана мимма тунбиту аларду мин бақлиҳа вақиссайҳа вафумиҳа ваааадасиҳа вабасалиҳа қала атастабдилуна аллазий ҳува адна биаллазий ҳува хайрун иҳбиту мисран файнна лакум ма саалтум вадурибат ааалайҳиму ассиллату ваалмасканату вабау биғадабин мина аллааҳи салика бианнаҳум кану йакфуруна биайати аллааҳи вайақтулуна аннабиййийна биғайри алҳаққи салика бима ааасау вакану йааатадуна
                Инна аллазийна аману вааллазийна ҳаду ваалннасара ваалссабиийна ман амана биаллааҳи ваалйауми алахири ваааамила салиҳан фалаҳум ажруҳум ааинда роббиҳим вала хауфун ааалайҳим вала ҳум йаҳзануна
                Вайс ахасна мийсақакум варафааана фауқакуму аттура хусу ма атайнакум биқувватин ваоскуру ма фийҳи лааааллакум таттақуна
                Сумма тауаллайтум мин бааади салика фалаула фадлу аллааҳи ааалайкум вароҳматуҳу лакунтум мина алхасирийна
                Валақад ааалимтуму аллазийна иаатадау минкум фий ассабти фақулна лаҳум куну қирадатан хасиийна
                Фажаааалнаҳа накалан лима байна йадайҳа вама халфаҳа вамауааисатан лилмуттақийна
                Вайс қала муса лиқаумиҳи инна аллааҳа йамурукум ан тасбаҳу бақаратан қалу ататтахисуна ҳузуван қала аааусу биаллааҳи ан акуна мина алжаҳилийна
                Қалу одаау лана роббака йубаййин лана ма ҳийа қала иннаҳу йақулу иннаҳа бақаратун ла фаридун вала бикрун ааауанун байна салика файфааалу ма тумаруна
                Қалу одаау лана роббака йубаййин лана ма лаунуҳа қала иннаҳу йақулу иннаҳа бақаратун сафрао фақиааун лаунуҳа тасурру аннасирийна
                Қалу одаау лана роббака йубаййин лана ма ҳийа инна албақара ташабаҳа ааалайна вайнна ин шаа аллааҳу ламуҳтадуна
                Қала иннаҳу йақулу иннаҳа бақаратун ла салулун тусийру аларда вала тасқий алҳарса мусалламатун ла шийата фийҳа қалу алана жита биалҳаққи фасабаҳуҳа вама каду йафааалуна
                Вайс қаталтум нафсан файддаратум фийҳа вааллааҳу мухрижун ма кунтум тактумуна
                Фақулна идрибуҳу бибааадиҳа касалика йуҳйий аллааҳу алмаута вайурийкум айатиҳи лааааллакум тааақилуна
                Сумма қасат қулубукум мин бааади салика фаҳийа каалҳижарати ау ашадду қасватан вайнна мина алҳижарати лама йатафажжару минҳу аланҳару вайнна минҳа лама йашшаққақу файахружу минҳу алмао вайнна минҳа лама йаҳбиту мин хашйати аллааҳи вама аллааҳу биғафилин ааамма тааамалуна
                Афататмааауна ан йумину лакум вақад кана фарийқун минҳум йасмааауна калама аллааҳи сумма йуҳаррифунаҳу мин бааади ма ааақалуҳу ваҳум йаааламуна
                Вайса лақу аллазийна аману қалу аманна вайса хала бааадуҳум ила бааадин қалу атуҳаддисунаҳум бима фатаҳа аллааҳу ааалайкум лийуҳажжукум биҳи ааинда роббикум афала тааақилуна
                Ауала йаааламуна анна аллааҳа йаааламу ма йусирруна вама йуаалинуна
                Ваминҳум оммиййуна ла йаааламуна алкитаба илла аманиййа вайн ҳум илла йасуннуна
                Фауайлун лиллазийна йактубуна алкитаба биайдийҳим сумма йақулуна ҳаса мин ааинди аллааҳи лийаштару биҳи саманан қалийлан фауайлун лаҳум мимма катабат айдийҳим вауайлун лаҳум мимма йаксибуна
                Вақалу лан тамассана аннару илла аййаман мааадудатан қул аттахастум ааинда аллааҳи аааҳдан фалан йухлифа аллааҳу аааҳдаҳу ам тақулуна ааала аллааҳи ма ла таааламуна
                Бала ман касаба саййиатан вааҳатат биҳи хатийатуҳу фаолайка ашабу аннари ҳум фийҳа халидуна
                Вааллазийна аману ваааамилу ассалиҳати олайка ашабу алжаннати ҳум фийҳа халидуна
                Вайс ахасна мийсақа баний исраийла ла тааабудуна илла аллааҳа вабиалвалидайни иҳсанан васий алқурба ваалйатама ваалмасакийни вақулу лилннаси ҳуснан ваақийму ассалата ваату аззаката сумма тауаллайтум илла қалийлан минкум ваантум муааридуна
                Вайс ахасна мийсақакум ла тасфикуна димаакум вала тухрижуна анфусакум мин дийарикум сумма ақрартум ваантум ташҳадуна
                Сумма антум ҳаолай тақтулуна анфусакум ватухрижуна фарийқан минкум мин дийариҳим тасаҳаруна ааалайҳим биалисми ваалааудвани вайн йатукум осара туфадуҳум ваҳува муҳаррамун ааалайкум ихражуҳум афатуминуна бибааади алкитаби ватакфуруна бибааадин фама жазао ман йафааалу салика минкум илла хизйун фий алҳайати аддунйа вайаума алқийамати йураддуна ила ашадди алааасаби вама аллааҳу биғафилин ааамма тааамалуна
                Олайка аллазийна иштарауу алҳайата аддунйа биалахирати фала йухаффафу ааанҳуму алааасабу вала ҳум йунсаруна
                Валақад атайна муса алкитаба вақаффайна мин бааадиҳи биалррусули ваатайна ааийса ибна марйама албаййинати вааййаднаҳу бируҳи алқудуси афакуллама жаакум расулун бима ла таҳва анфусукуму истакбартум фафарийқан кассабтум вафарийқан тақтулуна
                Вақалу қулубуна ғулфун бал лаааанаҳуму аллааҳу бикуфриҳим фақалийлан ма йуминуна
                Валамма жааҳум китабун мин ааинди аллааҳи мусаддиқун лима мааааҳум вакану мин қаблу йастафтиҳуна ааала аллазийна кафару фаламма жааҳум ма ааарафу кафару биҳи фалааанату аллааҳи ааала алкафирийна
                Бисама иштарау биҳи анфусаҳум ан йакфуру бима анзала аллааҳу бағйан ан йуназзила аллааҳу мин фадлиҳи ааала ман йашао мин ааибадиҳи фабау биғадабин ааала ғадабин валилкафирийна ааасабун муҳийнун
                Вайса қийла лаҳум амину бима анзала аллааҳу қалу нумину бима онзила ааалайна вайакфуруна бима варааҳу ваҳува алҳаққу мусаддиқан лима мааааҳум қул фалима тақтулуна анбийаа аллааҳи мин қаблу ин кунтум муминийна
                Валақад жаакум муса биалбаййинати сумма иттахастуму алааижла мин бааадиҳи ваантум салимуна
                Вайс ахасна мийсақакум варафааана фауқакуму аттура хусу ма атайнакум биқувватин вайсмааау қалу самиаана ваааасайна ваошрибу фий қулубиҳиму алааижла бикуфриҳим қул бисама йамурукум биҳи ийманукум ин кунтум муминийна
                Қул ин канат лакуму аддару алахирату ааинда аллааҳи халисатан мин дуни аннаси фатаманнауу алмаута ин кунтум садиқийна
                Валан йатаманнауҳу абадан бима қаддамат айдийҳим вааллааҳу ааалиймун биалссалимийна
                Валатажиданнаҳум аҳраса аннаси ааала ҳайатин вамина аллазийна ашраку йауадду аҳадуҳум лау йуаааммару алфа санатин вама ҳува бимузаҳзиҳиҳи мина алааасаби ан йуаааммара вааллааҳу басийрун бима йааамалуна
                Қул ман кана ааадувван лижибрийла файннаҳу наззалаҳу ааала қалбика бийсни аллааҳи мусаддиқан лима байна йадайҳи ваҳудан вабушра лилмуминийна
                Ман кана ааадувван лиллаҳи вамалайкатиҳи варусулиҳи важибрийла вамийкала файнна аллааҳа ааадуввун лилкафирийна
                Валақад анзална илайка айатин баййинатин вама йакфуру биҳа илла алфасиқуна
                Ауакуллама аааҳаду аааҳдан набасаҳу фарийқун минҳум бал аксаруҳум ла йуминуна
                Валамма жааҳум расулун мин ааинди аллааҳи мусаддиқун лима мааааҳум набаса фарийқун мина аллазийна уту алкитаба китаба аллааҳи вараа суҳуриҳим кааннаҳум ла йаааламуна
                Вайттабааау ма татлу ашшайатийну ааала мулки сулаймана вама кафара сулайману валакинна ашшайатийна кафару йуаааллимуна аннаса ассиҳра вама онзила ааала алмалакайни бибабила ҳарута вамарута вама йуаааллимани мин аҳадин ҳатта йақула иннама наҳну фитнатун фала такфур файатаааалламуна минҳума ма йуфарриқуна биҳи байна алмари вазаужиҳи вама ҳум бидаррийна биҳи мин аҳадин илла бийсни аллааҳи вайатаааалламуна ма йадурруҳум вала йанфааауҳум валақад ааалиму ламани иштароҳу ма лаҳу фий алахирати мин халақин валабиса ма шарау биҳи анфусаҳум лау кану йаааламуна
                Валау аннаҳум аману вайттақау ламасубатун мин ааинди аллааҳи хайрун лау кану йаааламуна
                Йа аййуҳа аллазийна аману ла тақулу рааайна вақулу онсурна вайсмааау валилкафирийна ааасабун алиймун
                Ма йауадду аллазийна кафару мин аҳли алкитаби вала алмушрикийна ан йуназзала ааалайкум мин хайрин мин роббикум вааллааҳу йахтассу бироҳматиҳи ман йашао вааллааҳу су алфадли алааасийми
                Ма нансах мин айатин ау нунсиҳа нати бихайрин минҳа ау мислиҳа алам тааалам анна аллааҳа ааала кулли шайин қадийрун
                Алам тааалам анна аллааҳа лаҳу мулку ассамауати вааларди вама лакум мин дуни аллааҳи мин валиййин вала насийрин
                Ам турийдуна ан тасалу расулакум кама суила муса мин қаблу ваман йатабаддали алкуфра биалиймани фақад далла сауаа ассабийли
                Вадда касийрун мин аҳли алкитаби лау йаруддунакум мин бааади ийманикум куффаран ҳасадан мин ааинди анфусиҳим мин бааади ма табаййана лаҳуму алҳаққу фаоаафу вайсфаҳу ҳатта йатийа аллааҳу биамриҳи инна аллааҳа ааала кулли шайин қадийрун
                Ваақийму ассалата ваату аззаката вама туқаддиму лианфусикум мин хайрин тажидуҳу ааинда аллааҳи инна аллааҳа бима тааамалуна басийрун
                Вақалу лан йадхула алжанната илла ман кана ҳудан ау насара тилка аманиййуҳум қул ҳату бурҳанакум ин кунтум садиқийна
                Бала ман аслама важҳаҳу лиллаҳи ваҳува муҳсинун фалаҳу ажруҳу ааинда роббиҳи вала хауфун ааалайҳим вала ҳум йаҳзануна
                Вақалати алйаҳуду лайсати аннасара ааала шайин вақалати аннасара лайсати алйаҳуду ааала шайин ваҳум йатлуна алкитаба касалика қала аллазийна ла йаааламуна мисла қаулиҳим фааллааҳу йаҳкуму байнаҳум йаума алқийамати фийма кану фийҳи йахталифуна
                Ваман асламу мимман манаааа масажида аллааҳи ан йускара фийҳа исмуҳу васаааа фий харобиҳа олайка ма кана лаҳум ан йадхулуҳа илла хайфийна лаҳум фий аддунйа хизйун валаҳум фий алахирати ааасабун ааасиймун
                Валиллаҳи алмашриқу ваалмағрибу фаайнама туваллу фасамма важҳу аллааҳи инна аллааҳа васиааун ааалиймун
                Вақалу итахаса аллааҳу валадан субҳанаҳу бал лаҳу ма фий ассамауати вааларди куллун лаҳу қанитуна
                Бадийаау ассамауати вааларди вайса қада амран файннама йақулу лаҳу кун файакуну
                Вақала аллазийна ла йаааламуна лаула йукаллимуна аллааҳу ау татийна айатун касалика қала аллазийна мин қаблиҳим мисла қаулиҳим ташабаҳат қулубуҳум қад баййанна алайати лиқаумин йуқинуна
                Инна арсалнака биалҳаққи башийран ванасийран вала тусалу ааан ашаби алжаҳийми
                Валан тарда ааанка алйаҳуду вала аннасара ҳатта таттабиааа миллатаҳум қул инна ҳуда аллааҳи ҳува алҳуда валайни иттабааата аҳвааҳум бааада аллазий жаака мина алааилми ма лака мина аллааҳи мин валиййин вала насийрин
                Аллазийна атайнаҳуму алкитаба йатлунаҳу ҳаққа тилауатиҳи олайка йуминуна биҳи ваман йакфур биҳи фаолайка ҳуму алхасируна
                Йа баний исраийла оскуру ниааматийа аллатий анааамту ааалайкум ваанний фаддалтукум ааала алаааламийна
                Вайттақу йауман ла тажзий нафсун ааан нафсин шайан вала йуқбалу минҳа ааадлун вала танфааауҳа шафаааатун вала ҳум йунсаруна
                Вайси ибтала иброҳийма роббуҳу бикалиматин фаатаммаҳунна қала инний жааайлука лилннаси имаман қала вамин сурриййатий қала ла йаналу аааҳдий ассалимийна
                Вайс жаааална албайта масабатан лилннаси ваамнан вайттахису мин мақами иброҳийма мусаллан вааааҳидна ила иброҳийма вайсмаааийла ан таҳҳира байтийа лилттайфийна ваалааакифийна ваалрруккааай ассужуди
                Вайс қала иброҳийму робби ижааал ҳаса баладан аминан ваорзуқ аҳлаҳу мина ассамарати ман амана минҳум биаллааҳи ваалйауми алахири қала ваман кафара фаоматтиаауҳу қалийлан сумма адтарруҳу ила ааасаби аннари вабиса алмасийру
                Вайс йарфааау иброҳийму алқауааайда мина албайти вайсмаааийлу роббана тақаббал минна иннака анта ассамийаау алааалийму
                Роббана вайжааална муслимайни лака вамин сурриййатина омматан муслиматан лака ваарина манасикана ватуб ааалайна иннака анта аттаувабу арроҳийму
                Роббана вайбааас фийҳим расулан минҳум йатлу ааалайҳим айатика вайуаааллимуҳуму алкитаба ваалҳикмата вайузаккийҳим иннака анта алааазийзу алҳакийму
                Ваман йарғабу ааан миллати иброҳийма илла ман сафиҳа нафсаҳу валақади истафайнаҳу фий аддунйа вайннаҳу фий алахирати ламина ассалиҳийна
                Ис қала лаҳу роббуҳу аслим қала асламту лиробби алаааламийна
                Вауасса биҳа иброҳийму банийҳи вайааақубу йа баниййа инна аллааҳа истафа лакуму аддийна фала тамутунна илла ваантум муслимуна
                Ам кунтум шуҳадаа ис ҳадара йааақуба алмауту ис қала либанийҳи ма тааабудуна мин бааадий қалу нааабуду илаҳака вайлаҳа абайка иброҳийма вайсмаааийла вайшақа илаҳан ваҳидан ванаҳну лаҳу муслимуна
                Тилка омматун қад халат лаҳа ма касабат валакум ма касабтум вала тусалуна ааамма кано йааамалуна
                Вақалу куну ҳудан ау насара таҳтаду қул бал миллата иброҳийма ҳанийфан вама кана мина алмушрикийна
                Қулу аманна биаллааҳи вама онзила илайна вама онзила ила иброҳийма вайсмаааийла вайшақа вайааақуба вааласбати вама утийа муса ваааийса вама утийа аннабиййуна мин роббиҳим ла нуфарриқу байна аҳадин минҳум ванаҳну лаҳу муслимуна
                Файн аману бимисли ма амантум биҳи фақади иҳтадау вайн тауаллау файннама ҳум фий шиқақин фасайакфийкаҳуму аллааҳу ваҳува ассамийаау алааалийму
                Сибғата аллааҳи ваман аҳсану мина аллааҳи сибғатан ванаҳну лаҳу ааабидуна
                Қул атуҳажжунана фий аллааҳи ваҳува роббуна вароббукум валана ааамалуна валакум ааамалукум ванаҳну лаҳу мухлисуна
                Ам тақулуна инна иброҳийма вайсмаааийла вайшақа вайааақуба вааласбата кану ҳудан ау насара қул аантум аааламу ами аллааҳу ваман асламу мимман катама шаҳадатан ааиндаҳу мина аллааҳи вама аллааҳу биғафилин ааамма тааамалуна
                Тилка омматун қад халат лаҳа ма касабат валакум ма касабтум вала тусалуна ааамма кану йааамалуна
                Сайақулу ассуфаҳао мина аннаси ма валлааҳум ааан қиблатиҳиму аллатий кану ааалайҳа қул лиллаҳи алмашриқу ваалмағрибу йаҳдий ман йашао ила сиратин мустақиймин
                Вакасалика жаааалнакум омматан васатан литакуну шуҳадаа ааала аннаси вайакуна аррасулу ааалайкум шаҳийдан вама жаааална алқиблата аллатий кунта ааалайҳа илла линааалама ман йаттабиаау аррасула мимман йанқалибу ааала ааақибайҳи вайн канат лакабийратан илла ааала аллазийна ҳада аллааҳу вама кана аллааҳу лийудийааа ийманакум инна аллааҳа биалннаси ларауфун роҳиймун
                Қад нара тақаллуба важҳика фий ассамай фалануваллийаннака қиблатан тардаҳа фауалли важҳака шатра алмасжиди алҳарами ваҳайсу ма кунтум фауаллу вужуҳакум шатроҳу вайнна аллазийна уту алкитаба лайаааламуна аннаҳу алҳаққу мин роббиҳим вама аллааҳу биғафилин ааамма йааамалуна
                Валайн атайта аллазийна уту алкитаба бикулли айатин ма табиаау қиблатака вама анта битабиааин қиблатаҳум вама бааадуҳум битабиааин қиблата бааадин валайни иттабааата аҳвааҳум мин бааади ма жаака мина алааилми иннака исан ламина ассалимийна
                Аллазийна атайнаҳуму алкитаба йааарифунаҳу кама йааарифуна абнааҳум вайнна фарийқан минҳум лайактумуна алҳаққа ваҳум йаааламуна
                Алҳаққу мин роббика фала такунанна мина алмумтарийна
                Валикуллин вижҳатун ҳува муваллийҳа файстабиқу алхайрати айна ма такуну йати бикуму аллааҳу жамийааан инна аллааҳа ааала кулли шайин қадийрун
                Вамин ҳайсу харажта фауалли важҳака шатра алмасжиди алҳарами вайннаҳу лалҳаққу мин роббика вама аллааҳу биғафилин ааамма тааамалуна
                Вамин ҳайсу харажта фауалли важҳака шатра алмасжиди алҳарами ваҳайсу ма кунтум фауаллу вужуҳакум шатроҳу лиалла йакуна лилннаси ааалайкум ҳужжатун илла аллазийна саламу минҳум фала тахшауҳум вайхшауний валиотимма ниааматий ааалайкум валааааллакум таҳтадуна
                Кама арсална фийкум расулан минкум йатлу ааалайкум айатина вайузаккийкум вайуаааллимукуму алкитаба ваалҳикмата вайуаааллимукум ма лам такуну таааламуна
                Фаоскуруний аскуркум ваошкуру лий вала такфуруни
                Йа аййуҳа аллазийна аману истаааийну биалссабри ваалссалати инна аллааҳа маааа ассабирийна
                Вала тақулу лиман йуқталу фий сабийли аллааҳи амватун бал аҳйаон валакин ла ташаауруна
                Валанаблуваннакум бишайин мина алхауфи ваалжуааи ванақсин мина аламвали вааланфуси ваалссамарати вабашшири ассабирийна
                Аллазийна иса асабасум мусийбатун қалу инна лиллаҳи вайнна илайҳи ражиаауна
                Олайка ааалайҳим салауатун мин роббиҳим вароҳматун ваолайка ҳуму алмуҳтадуна
                Инна ассафа ваалмарвата мин шааааири аллааҳи фаман ҳажжа албайта ауи иаатамара фала жунаҳа ааалайҳи ан йаттаувафа биҳима ваман татауваааа хайран файнна аллааҳа шакирун ааалиймун
                Инна аллазийна йактумуна ма анзална мина албаййинати ваалҳуда мин бааади ма баййаннаҳу лилннаси фий алкитаби олайка йалааануҳуму аллааҳу вайалааануҳуму аллааайнуна
                Илла аллазийна табу вааслаҳу вабаййану фаолайка атубу ааалайҳим ваана аттаувабу арроҳийму
                Инна аллазийна кафару вамату ваҳум куффарун олайка ааалайҳим лааанату аллааҳи ваалмалайкати ваалннаси ажмаааийна
                Халидийна фийҳа ла йухаффафу ааанҳуму алааасабу вала ҳум йунсаруна
                Вайлаҳукум илаҳун ваҳидун ла илаҳа илла ҳува арроҳману арроҳийму
                Инна фий халқи ассамауати вааларди вайхтилафи аллайли ваалннаҳари ваалфулки аллатий тажрий фий албаҳри бима йанфааау аннаса вама анзала аллааҳу мина ассамай мин майн фааҳйа биҳи аларда бааада маутиҳа вабасса фийҳа мин кулли даббатин ватасрийфи аррийаҳи ваалссаҳаби алмусаххари байна ассамай вааларди лаайатин лиқаумин йааақилуна
                Вамина аннаси ман йаттахису мин дуни аллааҳи андадан йуҳиббунаҳум каҳубби аллааҳи вааллазийна аману ашадду ҳуббан лиллаҳи валау йара аллазийна саламу ис йарауна алааасаба анна алқуввата лиллаҳи жамийааан ваанна аллааҳа шадийду алааасаби
                Ис табарраа аллазийна иттубиаау мина аллазийна иттабааау варааву алааасаба ватақаттаааат биҳиму аласбабу
                Вақала аллазийна иттабааау лау анна лана карратан фанатабарраа минҳум кама табаррау минна касалика йурийҳиму аллааҳу ааамалаҳум ҳасаратин ааалайҳим вама ҳум бихарижийна мина аннари
                Йа аййуҳа аннасу кулу мимма фий аларди ҳалалан таййибан вала таттабиаау хутувати ашшайтани иннаҳу лакум ааадуввун мубийнун
                Иннама йамурукум биалссуи ваалфаҳшай ваан тақулу ааала аллааҳи ма ла таааламуна
                Вайса қийла лаҳуму иттабиаау ма анзала аллааҳу қалу бал наттабиаау ма алфайна ааалайҳи абаана ауалау кана абаоҳум ла йааақилуна шайан вала йаҳтадуна
                Вамасалу аллазийна кафару камасали аллазий йанааиқу бима ла йасмааау илла дуаааан ванидаан суммун букмун ааумйун фаҳум ла йааақилуна
                Йа аййуҳа аллазийна аману кулу мин таййибати ма разақнакум ваошкуру лиллаҳи ин кунтум иййаҳу тааабудуна
                Иннама ҳаррама ааалайкуму алмайтата ваалддама валаҳма алхинзийри вама оҳилла биҳи лиғайри аллааҳи фамани идтурра ғайра бағин вала ааадин фала исма ааалайҳи инна аллааҳа ғафурун роҳиймун
                Инна аллазийна йактумуна ма анзала аллааҳу мина алкитаби вайаштаруна биҳи саманан қалийлан олайка ма йакулуна фий бутуниҳим илла аннара вала йукаллимуҳуму аллааҳу йаума алқийамати вала йузаккийҳим валаҳум ааасабун алиймун
                Олайка аллазийна иштарауу аддалалата биалҳуда ваалааасаба биалмағфирати фама асбароҳум ааала аннари
                Салика бианна аллааҳа наззала алкитаба биалҳаққи вайнна аллазийна ихталафу фий алкитаби лафий шиқақин баааийдин
                Лайса албирра ан туваллу вужуҳакум қибала алмашриқи ваалмағриби валакинна албирра ман амана биаллааҳи ваалйауми алахири ваалмалайкати ваалкитаби ваалннабиййийна ваата алмала ааала ҳуббиҳи сауий алқурба ваалйатама ваалмасакийна вайбна ассабийли ваалссайлийна вафий арриқаби ваақама ассалата ваата аззаката ваалмуфуна биаааҳдиҳим иса аааҳаду ваалссабирийна фий албасай ваалддаррай ваҳийна албаси олайка аллазийна садақу ваолайка ҳуму алмуттақуна
                Йа аййуҳа аллазийна аману кутиба ааалайкуму алқисасу фий алқатла алҳурру биалҳурри ваалааабду биалааабди ваалонса биалонса фаман аауфийа лаҳу мин ахийҳи шайон файттибаааун биалмаааруфи ваадаон илайҳи бийҳсанин салика тахфийфун мин роббикум вароҳматун фамани иаатада бааада салика фалаҳу ааасабун алиймун
                Валакум фий алқисаси ҳайатун йа олий алалбаби лааааллакум таттақуна
                Кутиба ааалайкум иса ҳадара аҳадакуму алмауту ин тарака хайран алвасиййату лилвалидайни ваалақробийна биалмаааруфи ҳаққан ааала алмуттақийна
                Фаман баддалаҳу бааадама самиаааҳу файннама исмуҳу ааала аллазийна йубаддилунаҳу инна аллааҳа самийааун ааалиймун
                Фаман хафа мин мусин жанафан ау исман фааслаҳа байнаҳум фала исма ааалайҳи инна аллааҳа ғафурун роҳиймун
                Йа аййуҳа аллазийна аману кутиба ааалайкуму ассийаму кама кутиба ааала аллазийна мин қабликум лааааллакум таттақуна
                Аййаман мааадудатин фаман кана минкум марийдан ау ааала сафарин фааайддатун мин аййамин охара ваааала аллазийна йутийқунаҳу фидйатун тааааму мискийнин фаман татауваааа хайран фаҳува хайрун лаҳу ваан тасуму хайрун лакум ин кунтум таааламуна
                Шаҳру рамадана аллазий онзила фийҳи алқурану ҳудан лилннаси вабаййинатин мина алҳуда ваалфурқани фаман шаҳида минкуму ашшаҳра фалйасумҳу ваман кана марийдан ау ааала сафарин фааайддатун мин аййамин охара йурийду аллааҳу бикуму алйусра вала йурийду бикуму алааусра валитукмилу алааиддата валитукаббиру аллааҳа ааала ма ҳадакум валааааллакум ташкуруна
                Вайса саалака ааибадий ааанний файнний қарийбун ожийбу дааауата аддааай иса даааани фалйастажийбу лий валйумину бий лааааллааҳум йаршудуна
                Оҳилла лакум лайлата ассийами аррафасу ила нисайкум ҳунна либасун лакум ваантум либасун лаҳунна ааалима аллааҳу аннакум кунтум тахтануна анфусакум фатаба ааалайкум ваааафа ааанкум фаалана башируҳунна вайбтағу ма катаба аллааҳу лакум вакулу вайшробу ҳатта йатабаййана лакуму алхайту алабйаду мина алхайти аласвади мина алфажри сумма атимму ассийама ила аллайли вала тубашируҳунна ваантум ааакифуна фий алмасажиди тилка ҳудуду аллааҳи фала тақробуҳа касалика йубаййину аллааҳу айатиҳи лилннаси лааааллааҳум йаттақуна
                Вала такулу амвалакум байнакум биалбатили ватудлу биҳа ила алҳукками литакулу фарийқан мин амвали аннаси биалисми ваантум таааламуна
                Йасалунака ааани алаҳиллати қул ҳийа мауақийту лилннаси ваалҳажжи валайса албирру биан тату албуйута мин суҳуриҳа валакинна албирра мани иттақа вату албуйута мин абвабиҳа вайттақу аллааҳа лааааллакум туфлиҳуна
                Вақатилу фий сабийли аллааҳи аллазийна йуқатилунакум вала тааатаду инна аллааҳа ла йуҳиббу алмуаатадийна
                Ваоқтулуҳум ҳайсу сақифтумуҳум ваахрижуҳум мин ҳайсу ахражукум ваалфитнату ашадду мина алқатли вала туқатилуҳум ааинда алмасжиди алҳарами ҳатта йуқатилукум фийҳи файн қаталукум фаоқтулуҳум касалика жазао алкафирийна
                Файни интаҳау файнна аллааҳа ғафурун роҳиймун
                Вақатилуҳум ҳатта ла такуна фитнатун вайакуна аддийну лиллаҳи файни интаҳау фала ааудвана илла ааала ассалимийна
                Ашшаҳру алҳараму биалшшаҳри алҳарами ваалҳурумату қисасун фамани иаатада ааалайкум файаатаду ааалайҳи бимисли ма иаатада ааалайкум вайттақу аллааҳа вайааламу анна аллааҳа маааа алмуттақийна
                Ваанфиқу фий сабийли аллааҳи вала тулқу биайдийкум ила аттаҳлукати вааҳсину инна аллааҳа йуҳиббу алмуҳсинийна
                Ваатимму алҳажжа ваалааумрата лиллаҳи файн оҳсиртум фама истайсара мина алҳадйи вала таҳлиқу руусакум ҳатта йаблуға алҳадйу маҳиллаҳу фаман кана минкум марийдан ау биҳи асан мин расиҳи фафидйатун мин сийамин ау садақатин ау нусукин файса аминтум фаман таматтаааа биалааумрати ила алҳажжи фама истайсара мина алҳадйи фаман лам йажид фасийаму саласати аййамин фий алҳажжи васабааатин иса ражааатум тилка ааашаратун камилатун салика лиман лам йакун аҳлуҳу ҳадирий алмасжиди алҳарами вайттақу аллааҳа вайааламу анна аллааҳа шадийду алааиқаби
                Алҳажжу ашҳурун мааалуматун фаман фарада фийҳинна алҳажжа фала рафаса вала фусуқа вала жидала фий алҳажжи вама тафааалу мин хайрин йаааламҳу аллааҳу ватазауваду файнна хайра аззади аттақва вайттақуни йа олий алалбаби
                Лайса ааалайкум жунаҳун ан табтағу фадлан мин роббикум файса афадтум мин ааарафатин фаоскуру аллааҳа ааинда алмашааари алҳарами ваоскуруҳу кама ҳадакум вайн кунтум мин қаблиҳи ламина аддаллийна
                Сумма афийду мин ҳайсу афада аннасу вайстағфиру аллааҳа инна аллааҳа ғафурун роҳиймун
                Файса қадайтум манасикакум фаоскуру аллааҳа касикрикум абаакум ау ашадда сикран фамина аннаси ман йақулу роббана атина фий аддунйа вама лаҳу фий алахирати мин халақин
                Ваминҳум ман йақулу роббана атина фий аддунйа ҳасанатан вафий алахирати ҳасанатан вақина ааасаба аннари
                Олайка лаҳум насийбун мимма касабу вааллааҳу сарийаау алҳисаби
                Ваоскуру аллааҳа фий аййамин мааадудатин фаман таааажжала фий йаумайни фала исма ааалайҳи ваман тааххара фала исма ааалайҳи лимани иттақа вайттақу аллааҳа вайааламу аннакум илайҳи туҳшаруна
                Вамина аннаси ман йуаажибука қаулуҳу фий алҳайати аддунйа вайушҳиду аллааҳа ааала ма фий қалбиҳи ваҳува аладду алхисами
                Вайса тауалла саааа фий аларди лийуфсида фийҳа вайуҳлика алҳарса ваалннасла вааллааҳу ла йуҳиббу алфасада
                Вайса қийла лаҳу иттақи аллааҳа ахасасу алааиззату биалисми фаҳасбуҳу жаҳаннаму валабиса алмиҳаду
                Вамина аннаси ман йашрий нафсаҳу ибтиғаа мардати аллааҳи вааллааҳу рауфун биалааибади
                Йа аййуҳа аллазийна аману одхулу фий ассилми каффатан вала таттабиаау хутувати ашшайтани иннаҳу лакум ааадуввун мубийнун
                Файн залалтум мин бааади ма жааткуму албаййинату файааламу анна аллааҳа ааазийзун ҳакиймун
                Ҳал йансуруна илла ан йатийаҳуму аллааҳу фий сулалин мина алғамами ваалмалайкату вақудийа аламру вайла аллааҳи туржааау аломуру
                Сал баний исраийла кам атайнаҳум мин айатин баййинатин ваман йубаддил ниаамата аллааҳи мин бааади ма жаасу файнна аллааҳа шадийду алааиқаби
                Зуййина лиллазийна кафару алҳайату аддунйа вайасхаруна мина аллазийна аману вааллазийна иттақау фауқаҳум йаума алқийамати вааллааҳу йарзуқу ман йашао биғайри ҳисабин
                Кана аннасу омматан ваҳидатан фабааааса аллааҳу аннабиййийна мубашширийна вамунсирийна ваанзала мааааҳуму алкитаба биалҳаққи лийаҳкума байна аннаси фийма ихталафу фийҳи вама ихталафа фийҳи илла аллазийна утуҳу мин бааади ма жаасуму албаййинату бағйан байнаҳум фаҳада аллааҳу аллазийна аману лима ихталафу фийҳи мина алҳаққи бийсниҳи вааллааҳу йаҳдий ман йашао ила сиратин мустақиймин
                Ам ҳасибтум ан тадхулу алжанната валамма йатикум масалу аллазийна халау мин қабликум массасуму албасао ваалддаррао вазулзилу ҳатта йақула аррасулу вааллазийна аману мааааҳу мата насру аллааҳи ала инна насра аллааҳи қарийбун
                Йасалунака маса йунфиқуна қул ма анфақтум мин хайрин фалилвалидайни ваалақробийна ваалйатама ваалмасакийни вайбни ассабийли вама тафааалу мин хайрин файнна аллааҳа биҳи ааалиймун
                Кутиба ааалайкуму алқиталу ваҳува курҳун лакум вааааса ан такроҳу шайан ваҳува хайрун лакум вааааса ан туҳиббу шайан ваҳува шаррун лакум вааллааҳу йаааламу ваантум ла таааламуна
                Йасалунака ааани ашшаҳри алҳарами қиталин фийҳи қул қиталун фийҳи кабийрун васаддун ааан сабийли аллааҳи вакуфрун биҳи ваалмасжиди алҳарами вайхражу аҳлиҳи минҳу акбару ааинда аллааҳи ваалфитнату акбару мина алқатли вала йазалуна йуқатилунакум ҳатта йаруддукум ааан дийникум ини истатааау ваман йартадид минкум ааан дийниҳи файамут ваҳува кафирун фаолайка ҳабитат ааамалуҳум фий аддунйа ваалахирати ваолайка ашабу аннари ҳум фийҳа халидуна
                Инна аллазийна аману вааллазийна ҳажару важаҳаду фий сабийли аллааҳи олайка йаржуна роҳмата аллааҳи вааллааҳу ғафурун роҳиймун
                Йасалунака ааани алхамри ваалмайсири қул фийҳима исмун кабийрун ваманафиаау лилннаси вайсмуҳума акбару мин нафааиҳима вайасалунака маса йунфиқуна қули алааафва касалика йубаййину аллааҳу лакуму алайати лааааллакум татафаккаруна
                Фий аддунйа ваалахирати вайасалунака ааани алйатама қул ислаҳун лаҳум хайрун вайн тухалитуҳум файхванукум вааллааҳу йаааламу алмуфсида мина алмуслиҳи валау шаа аллааҳу лаааанатакум инна аллааҳа ааазийзун ҳакиймун
                Вала танкиҳу алмушрикати ҳатта йуминна валааматун муминатун хайрун мин мушрикатин валау ааажабаткум вала тункиҳу алмушрикийна ҳатта йумину валаааабдун муминун хайрун мин мушрикин валау ааажабакум олайка йадаауна ила аннари вааллааҳу йадаау ила алжаннати ваалмағфирати бийсниҳи вайубаййину айатиҳи лилннаси лааааллааҳум йатасаккаруна
                Вайасалунака ааани алмаҳийди қул ҳува асан файаатазилу аннисаа фий алмаҳийди вала тақробуҳунна ҳатта йасурна файса татаҳҳарна фатуҳунна мин ҳайсу амаракуму аллааҳу инна аллааҳа йуҳиббу аттаувабийна вайуҳиббу алмутатаҳҳирийна
                Нисаокум ҳарсун лакум фату ҳарсакум анна шитум вақаддиму лианфусикум вайттақу аллааҳа вайааламу аннакум мулақуҳу вабашшири алмуминийна
                Вала тажааалу аллааҳа ааурдатан лиайманикум ан табарру вататтақу ватуслиҳу байна аннаси вааллааҳу самийааун ааалиймун
                Ла йуахисукуму аллааҳу биаллағви фий айманикум валакин йуахисукум бима касабат қулубукум вааллааҳу ғафурун ҳалиймун
                Лиллазийна йулуна мин нисайҳим тароббусу арбаааати ашҳурин файн фау файнна аллааҳа ғафурун роҳиймун
                Вайн ааазаму атталақа файнна аллааҳа самийааун ааалиймун
                Ваалмуталлақату йатароббасна бианфусиҳинна саласата қуруин вала йаҳиллу лаҳунна ан йактумна ма халақа аллааҳу фий арҳамиҳинна ин кунна йуминна биаллааҳи ваалйауми алахири вабуааулатуҳунна аҳаққу бираддиҳинна фий салика ин араду ислаҳан валаҳунна мислу аллазий ааалайҳинна биалмаааруфи валилррижали ааалайҳинна даражатун вааллааҳу ааазийзун ҳакиймун
                Атталақу марратани файмсакун бимаааруфин ау тасрийҳун бийҳсанин вала йаҳиллу лакум ан тахусу мимма атайтумуҳунна шайан илла ан йахафа алла йуқийма ҳудуда аллааҳи файн хифтум алла йуқийма ҳудуда аллааҳи фала жунаҳа ааалайҳима фийма ифтадат биҳи тилка ҳудуду аллааҳи фала тааатадуҳа ваман йатаааадда ҳудуда аллааҳи фаолайка ҳуму ассалимуна
                Файн таллақаҳа фала таҳиллу лаҳу мин баааду ҳатта танкиҳа заужан ғайроҳу файн таллақаҳа фала жунаҳа ааалайҳима ан йатаражаааа ин санна ан йуқийма ҳудуда аллааҳи ватилка ҳудуду аллааҳи йубаййинуҳа лиқаумин йаааламуна
                Вайса таллақтуму аннисаа фабалағна ажалаҳунна фаамсикуҳунна бимаааруфин ау сарриҳуҳунна бимаааруфин вала тумсикуҳунна дираран литааатаду ваман йафааал салика фақад салама нафсаҳу вала таттахису айати аллааҳи ҳузуван ваоскуру ниаамата аллааҳи ааалайкум вама анзала ааалайкум мина алкитаби ваалҳикмати йааайсукум биҳи вайттақу аллааҳа вайааламу анна аллааҳа бикулли шайин ааалиймун
                Вайса таллақтуму аннисаа фабалағна ажалаҳунна фала тааадулуҳунна ан йанкиҳна азважаҳунна иса тарадау байнаҳум биалмаааруфи салика йуааасу биҳи ман кана минкум йумину биаллааҳи ваалйауми алахири саликум азка лакум ваасару вааллааҳу йаааламу ваантум ла таааламуна
                Ваалвалидату йурдиаана ауладаҳунна ҳаулайни камилайни лиман арада ан йутимма аррадаааата ваааала алмаулуди лаҳу ризқуҳунна вакисватуҳунна биалмаааруфи ла тукаллафу нафсун илла вусаааҳа ла тударра валидатун биваладиҳа вала маулудун лаҳу биваладиҳи ваааала алвариси мислу салика файн арада фисалан ааан тарадин минҳума ваташауурин фала жунаҳа ааалайҳима вайн арадтум ан тастардиаау ауладакум фала жунаҳа ааалайкум иса салламтум ма атайтум биалмаааруфи вайттақу аллааҳа вайааламу анна аллааҳа бима тааамалуна басийрун
                Вааллазийна йутауаффауна минкум вайасаруна азважан йатароббасна бианфусиҳинна арбаааата ашҳурин ваааашран файса балағна ажалаҳунна фала жунаҳа ааалайкум фийма фаааална фий анфусиҳинна биалмаааруфи вааллааҳу бима тааамалуна хабийрун
                Вала жунаҳа ааалайкум фийма аааррадтум биҳи мин хитбати аннисай ау акнантум фий анфусикум ааалима аллааҳу аннакум сатаскурунаҳунна валакин ла тувааайдуҳунна сирран илла ан тақулу қаулан маааруфан вала тааазиму аауқдата анникаҳи ҳатта йаблуға алкитабу ажалаҳу вайааламу анна аллааҳа йаааламу ма фий анфусикум файҳсаруҳу вайааламу анна аллааҳа ғафурун ҳалиймун
                Ла жунаҳа ааалайкум ин таллақтуму аннисаа ма лам тамассуҳунна ау тафриду лаҳунна фарийдатан ваматтиаауҳунна ааала алмусиааи қадаруҳу ваааала алмуқтири қадаруҳу матаааан биалмаааруфи ҳаққан ааала алмуҳсинийна
                Вайн таллақтумуҳунна мин қабли ан тамассуҳунна вақад фарадтум лаҳунна фарийдатан фанисфу ма фарадтум илла ан йааафуна ау йааафува аллазий бийадиҳи аауқдату анникаҳи ваан тааафу ақробу лилттақва вала тансауу алфадла байнакум инна аллааҳа бима тааамалуна басийрун
                Ҳафису ааала ассалауати ваалссалати алвуста вақуму лиллаҳи қанитийна
                Файн хифтум фарижалан ау рукбанан файса аминтум фаоскуру аллааҳа кама ааалламакум ма лам такуну таааламуна
                Вааллазийна йутауаффауна минкум вайасаруна азважан васиййатан лиазважиҳим матаааан ила алҳаули ғайра ихражин файн харажна фала жунаҳа ааалайкум фий ма фаааална фий анфусиҳинна мин маааруфин вааллааҳу ааазийзун ҳакиймун
                Валилмуталлақати матаааун биалмаааруфи ҳаққан ааала алмуттақийна
                Касалика йубаййину аллааҳу лакум айатиҳи лааааллакум тааақилуна
                Алам тара ила аллазийна харажу мин дийариҳим ваҳум олуфун ҳасара алмаути фақала лаҳуму аллааҳу муту сумма аҳйаҳум инна аллааҳа ласу фадлин ааала аннаси валакинна аксара аннаси ла йашкуруна
                Вақатилу фий сабийли аллааҳи вайааламу анна аллааҳа самийааун ааалиймун
                Ман са аллазий йуқриду аллааҳа қардан ҳасанан файудааайфаҳу лаҳу адааафан касийратан вааллааҳу йақбиду вайабсуту вайлайҳи туржааауна
                Алам тара ила алмалай мин баний исраийла мин бааади муса ис қалу линабиййин лаҳуму ибааас лана маликан нуқатил фий сабийли аллааҳи қала ҳал ааасайтум ин кутиба ааалайкуму алқиталу алла туқатилу қалу вама лана алла нуқатила фий сабийли аллааҳи вақад охрижна мин дийарина ваабнайна фаламма кутиба ааалайҳиму алқиталу тауаллау илла қалийлан минҳум вааллааҳу ааалиймун биалссалимийна
                Вақала лаҳум набиййуҳум инна аллааҳа қад бааааса лакум талута маликан қалу анна йакуну лаҳу алмулку ааалайна ванаҳну аҳаққу биалмулки минҳу валам йута саааатан мина алмали қала инна аллааҳа истафаҳу ааалайкум вазадаҳу бастатан фий алааилми ваалжисми вааллааҳу йутий мулкаҳу ман йашао вааллааҳу васиааун ааалиймун
                Вақала лаҳум набиййуҳум инна айата мулкиҳи ан йатийакуму аттабуту фийҳи сакийнатун мин роббикум вабақиййатун мимма тарака алу муса ваалу ҳаруна таҳмилуҳу алмалайкату инна фий салика лаайатан лакум ин кунтум муминийна
                Фаламма фасала талуту биалжунуди қала инна аллааҳа мубталийкум бинаҳарин фаман шариба минҳу фалайса минний ваман лам йатааамҳу файннаҳу минний илла мани иғтарафа ғурфатан бийадиҳи фашарибу минҳу илла қалийлан минҳум фаламма жауазаҳу ҳува вааллазийна аману мааааҳу қалу ла тақата лана алйаума бижалута важунудиҳи қала аллазийна йасуннуна аннаҳум мулақу аллааҳи кам мин фиатин қалийлатин ғалабат фиатан касийратан бийсни аллааҳи вааллааҳу маааа ассабирийна
                Валамма баразу лижалута важунудиҳи қалу роббана африғ ааалайна сабран васаббит ақдамана ваонсурна ааала алқауми алкафирийна
                Фаҳазамуҳум бийсни аллааҳи вақатала даууду жалута ваатаҳу аллааҳу алмулка ваалҳикмата ваааалламаҳу мимма йашао валаула дафаау аллааҳи аннаса бааадаҳум бибааадин лафасадати аларду валакинна аллааҳа су фадлин ааала алаааламийна
                Тилка айату аллааҳи натлуҳа ааалайка биалҳаққи вайннака ламина алмурсалийна
                Тилка аррусулу фаддална бааадаҳум ааала бааадин минҳум ман каллама аллааҳу варафаааа бааадаҳум даражатин ваатайна ааийса ибна марйама албаййинати вааййаднаҳу бируҳи алқудуси валау шаа аллааҳу ма иқтатала аллазийна мин бааадиҳим мин бааади ма жаасуму албаййинату валакини ихталафу фаминҳум ман амана ваминҳум ман кафара валау шаа аллааҳу ма иқтаталу валакинна аллааҳа йафааалу ма йурийду
                Йа аййуҳа аллазийна аману анфиқу мимма разақнакум мин қабли ан йатийа йаумун ла байааун фийҳи вала хуллатун вала шафаааатун ваалкафируна ҳуму ассалимуна
                Аллааҳу ла илаҳа илла ҳува алҳаййу алқаййуму ла тахусуҳу синатун вала наумун лаҳу ма фий ассамауати вама фий аларди ман са аллазий йашфааау ааиндаҳу илла бийсниҳи йаааламу ма байна айдийҳим вама халфаҳум вала йуҳийтуна бишайин мин ааилмиҳи илла бима шаа васиааа курсиййуҳу ассамауати вааларда вала йаудуҳу ҳифсуҳума ваҳува алааалиййу алааасийму
                Ла икроҳа фий аддийни қад табаййана аррушду мина алғаййи фаман йакфур биалттағути вайумин биаллааҳи фақади истамсака биалааурвати алвусқа ла инфисама лаҳа вааллааҳу самийааун ааалиймун
                Аллааҳу валиййу аллазийна аману йухрижуҳум мина ассулумати ила аннури вааллазийна кафару аулийаоҳуму аттағуту йухрижунаҳум мина аннури ила ассулумати олайка ашабу аннари ҳум фийҳа халидуна
                Алам тара ила аллазий ҳажжа иброҳийма фий роббиҳи ан атаҳу аллааҳу алмулка ис қала иброҳийму роббийа аллазий йуҳйий вайумийту қала ана оҳйий ваомийту қала иброҳийму файнна аллааҳа йатий биалшшамси мина алмашриқи фати биҳа мина алмағриби фабуҳита аллазий кафара вааллааҳу ла йаҳдий алқаума ассалимийна
                Ау кааллазий марра ааала қарйатин ваҳийа хауийатун ааала ааурушиҳа қала анна йуҳйий ҳасиҳи аллааҳу бааада маутиҳа фааматаҳу аллааҳу миата ааамин сумма баааасаҳу қала кам лабиста қала лабисту йауман ау бааада йаумин қала бал лабиста миата ааамин фаонсур ила таааамика вашаробика лам йатасаннаҳ ваонсур ила ҳимарика валинажааалака айатан лилннаси ваонсур ила алааисами кайфа нуншизуҳа сумма наксуҳа лаҳман фаламма табаййана лаҳу қала аааламу анна аллааҳа ааала кулли шайин қадийрун
                Вайс қала иброҳийму робби ариний кайфа туҳйий алмаута қала ауалам тумин қала бала валакин лийатмайнна қалбий қала фахус арбаааатан мина аттайри фасурҳунна илайка сумма ижааал ааала кулли жабалин минҳунна жузан сумма одаауҳунна йатийнака сааайан вайаалам анна аллааҳа ааазийзун ҳакиймун
                Масалу аллазийна йунфиқуна амвалаҳум фий сабийли аллааҳи камасали ҳаббатин анбатат сабааа санабила фий кулли сунбулатин миату ҳаббатин вааллааҳу йудааайфу лиман йашао вааллааҳу васиааун ааалиймун
                Аллазийна йунфиқуна амвалаҳум фий сабийли аллааҳи сумма ла йутбиаауна ма анфақу маннан вала асан лаҳум ажруҳум ааинда роббиҳим вала хауфун ааалайҳим вала ҳум йаҳзануна
                Қаулун маааруфун вамағфиратун хайрун мин садақатин йатбааауҳа асан вааллааҳу ғаниййун ҳалиймун
                Йа аййуҳа аллазийна аману ла тубтилу садақатикум биалманни вааласа кааллазий йунфиқу малаҳу риаа аннаси вала йумину биаллааҳи ваалйауми алахири фамасалуҳу камасали сафванин ааалайҳи туробун фаасабаҳу вабилун фатаракаҳу салдан ла йақдируна ааала шайин мимма касабу вааллааҳу ла йаҳдий алқаума алкафирийна
                Вамасалу аллазийна йунфиқуна амвалаҳуму ибтиғаа мардати аллааҳи ватасбийтан мин анфусиҳим камасали жаннатин биробватин асабаҳа вабилун фаатат окулаҳа диаафайни файн лам йусибҳа вабилун фаталлун вааллааҳу бима тааамалуна басийрун
                Айауадду аҳадукум ан такуна лаҳу жаннатун мин нахийлин ваааанабин тажрий мин таҳтиҳа аланҳару лаҳу фийҳа мин кулли ассамарати ваасабаҳу алкибару валаҳу сурриййатун дуааафао фаасабаҳа иаасарун фийҳи нарун файҳтарақат касалика йубаййину аллааҳу лакуму алайати лааааллакум татафаккаруна
                Йа аййуҳа аллазийна аману анфиқу мин таййибати ма касабтум вамимма ахражна лакум мина аларди вала тайаммаму алхабийса минҳу тунфиқуна валастум биахисийҳи илла ан туғмиду фийҳи вайааламу анна аллааҳа ғаниййун ҳамийдун
                Ашшайтану йааайдукуму алфақра вайамурукум биалфаҳшай вааллааҳу йааайдукум мағфиратан минҳу вафадлан вааллааҳу васиааун ааалиймун
                Йутий алҳикмата ман йашао ваман йута алҳикмата фақад утийа хайран касийран вама йассаккару илла олу алалбаби
                Вама анфақтум мин нафақатин ау насартум мин насрин файнна аллааҳа йаааламуҳу вама лилссалимийна мин ансарин
                Ин тубду ассадақати фаниааимма ҳийа вайн тухфуҳа ватутуҳа алфуқараа фаҳува хайрун лакум вайукаффиру ааанкум мин саййиатикум вааллааҳу бима тааамалуна хабийрун
                Лайса ааалайка ҳудаҳум валакинна аллааҳа йаҳдий ман йашао вама тунфиқу мин хайрин фалианфусикум вама тунфиқуна илла ибтиғаа важҳи аллааҳи вама тунфиқу мин хайрин йуваффа илайкум ваантум ла тусламуна
                Лилфуқарай аллазийна оҳсиру фий сабийли аллааҳи ла йастатийаауна дарбан фий аларди йаҳсабуҳуму алжаҳилу ағнийаа мина аттааааффуфи тааарифуҳум бисиймаҳум ла йасалуна аннаса илҳафан вама тунфиқу мин хайрин файнна аллааҳа биҳи ааалиймун
                Аллазийна йунфиқуна амвалаҳум биаллайли ваалннаҳари сирран вааааланийатан фалаҳум ажруҳум ааинда роббиҳим вала хауфун ааалайҳим вала ҳум йаҳзануна
                Аллазийна йакулуна арриба ла йақумуна илла кама йақуму аллазий йатахаббатуҳу ашшайтану мина алмасси салика бианнаҳум қалу иннама албайаау мислу арриба вааҳалла аллааҳу албайааа ваҳаррама арриба фаман жааҳу мауааисатун мин роббиҳи файнтаҳа фалаҳу ма салафа ваамруҳу ила аллааҳи ваман ааада фаолайка ашабу аннари ҳум фийҳа халидуна
                Йамҳақу аллааҳу арриба вайурбий ассадақати вааллааҳу ла йуҳиббу кулла каффарин асиймин
                Инна аллазийна аману ваааамилу ассалиҳати ваақаму ассалата ваатауу аззаката лаҳум ажруҳум ааинда роббиҳим вала хауфун ааалайҳим вала ҳум йаҳзануна
                Йа аййуҳа аллазийна аману иттақу аллааҳа васару ма бақийа мина арриба ин кунтум муминийна
                Файн лам тафааалу фасану биҳарбин мина аллааҳи варасулиҳи вайн тубтум фалакум руусу амваликум ла таслимуна вала тусламуна
                Вайн кана су ааусратин фанасиратун ила майсаратин ваан тасаддақу хайрун лакум ин кунтум таааламуна
                Вайттақу йауман туржааауна фийҳи ила аллааҳи сумма туваффа куллу нафсин ма касабат ваҳум ла йусламуна
                Йа аййуҳа аллазийна аману иса тадайантум бидайнин ила ажалин мусамман фаоктубуҳу валйактуб байнакум катибун биалааадли вала йаба катибун ан йактуба кама ааалламаҳу аллааҳу фалйактуб валйумлили аллазий ааалайҳи алҳаққу валйаттақи аллааҳа роббаҳу вала йабхас минҳу шайан файн кана аллазий ааалайҳи алҳаққу сафийҳан ау даааийфан ау ла йастатийаау ан йумилла ҳува фалйумлил валиййуҳу биалааадли вайсташҳиду шаҳийдайни мин рижаликум файн лам йакуна ражулайни фаражулун ваймраатани мимман тардауна мина ашшуҳадай ан тадилла иҳдаҳума фатусаккира иҳдаҳума алохра вала йаба ашшуҳадао иса ма дуаау вала тасаму ан тактубуҳу сағийран ау кабийран ила ажалиҳи саликум ақсату ааинда аллааҳи ваақваму лилшшаҳадати ваадна алла тартабу илла ан такуна тижаратан ҳадиратан тудийрунаҳа байнакум фалайса ааалайкум жунаҳун алла тактубуҳа ваашҳиду иса табайааатум вала йударра катибун вала шаҳийдун вайн тафааалу файннаҳу фусуқун бикум вайттақу аллааҳа вайуаааллимукуму аллааҳу вааллааҳу бикулли шайин ааалиймун
                Вайн кунтум ааала сафарин валам тажиду катибан фариҳанун мақбудатун файн амина бааадукум бааадан фалйуадди аллазий итумина аманатаҳу валйаттақи аллааҳа роббаҳу вала тактуму ашшаҳадата ваман йактумҳа файннаҳу асимун қалбуҳу вааллааҳу бима тааамалуна ааалиймун
                Лиллаҳи ма фий ассамауати вама фий аларди вайн тубду ма фий анфусикум ау тухфуҳу йуҳасибкум биҳи аллааҳу файағфиру лиман йашао вайуааассибу ман йашао вааллааҳу ааала кулли шайин қадийрун
                Амана аррасулу бима онзила илайҳи мин роббиҳи ваалмуминуна куллун амана биаллааҳи вамалайкатиҳи вакутубиҳи варусулиҳи ла нуфарриқу байна аҳадин мин русулиҳи вақалу самиаана ваатааана ғуфранака роббана вайлайка алмасийру
                Ла йукаллифу аллааҳу нафсан илла вусаааҳа лаҳа ма касабат ваааалайҳа ма иктасабат роббана ла туахисна ин насийна ау ахтана роббана вала таҳмил ааалайна исран кама ҳамалтаҳу ааала аллазийна мин қаблина роббана вала туҳаммилна ма ла тақата лана биҳи ваоаафу ааанна вайғфир лана вайрҳамна анта маулана фаонсурна ааала алқауми алкафирийна
            """.trimIndent(),
        ),
        Surah(
            id = 3,
            arabicName = "آل عمران",
            latinName = "Ali 'Imran",
            transliteration = """
                Алифламмийм
                Аллааҳу ла илаҳа илла ҳува алҳаййу алқаййуму
                Наззала ааалайка алкитаба биалҳаққи мусаддиқан лима байна йадайҳи ваанзала аттаурата ваалинжийла
                Мин қаблу ҳудан лилннаси ваанзала алфурқана инна аллазийна кафару биайати аллааҳи лаҳум ааасабун шадийдун вааллааҳу ааазийзун су интиқамин
                Инна аллааҳа ла йахфа ааалайҳи шайон фий аларди вала фий ассамай
                Ҳува аллазий йусаувирукум фий аларҳами кайфа йашао ла илаҳа илла ҳува алааазийзу алҳакийму
                Ҳува аллазий анзала ааалайка алкитаба минҳу айатун муҳкаматун ҳунна омму алкитаби ваохару муташабиҳатун фаамма аллазийна фий қулубиҳим зайғун файаттабиаауна ма ташабаҳа минҳу ибтиғаа алфитнати вайбтиғаа тауийлиҳи вама йаааламу тауийлаҳу илла аллааҳу ваалррасихуна фий алааилми йақулуна аманна биҳи куллун мин ааинди роббина вама йассаккару илла олу алалбаби
                Роббана ла тузиғ қулубана бааада ис ҳадайтана ваҳаб лана мин ладунка роҳматан иннака анта алваҳҳабу
                Роббана иннака жамиаау аннаси лийаумин ла райба фийҳи инна аллааҳа ла йухлифу алмийааада
                Инна аллазийна кафару лан туғнийа ааанҳум амвалуҳум вала ауладуҳум мина аллааҳи шайан ваолайка ҳум вақуду аннари
                Кадаби али фирааауна вааллазийна мин қаблиҳим кассабу биайатина фаахасаҳуму аллааҳу бисунубиҳим вааллааҳу шадийду алааиқаби
                Қул лиллазийна кафару сатуғлабуна ватуҳшаруна ила жаҳаннама вабиса алмиҳаду
                Қад кана лакум айатун фий фиатайни илтақата фиатун туқатилу фий сабийли аллааҳи ваохра кафиратун йараунаҳум мислайҳим райа алааайни вааллааҳу йуаййиду бинасриҳи ман йашао инна фий салика лааайбратан лиолий алабсари
                Зуййина лилннаси ҳуббу ашшаҳауати мина аннисай ваалбанийна ваалқанатийри алмуқантарати мина ассаҳаби ваалфиддати ваалхайли алмусаувамати вааланааами ваалҳарси салика матааау алҳайати аддунйа вааллааҳу ааиндаҳу ҳусну алмааби
                Қул аонаббиокум бихайрин мин саликум лиллазийна иттақау ааинда роббиҳим жаннатун тажрий мин таҳтиҳа аланҳару халидийна фийҳа ваазважун мутаҳҳаратун варидванун мина аллааҳи вааллааҳу басийрун биалааибади
                Аллазийна йақулуна роббана иннана аманна файғфир лана сунубана вақина ааасаба аннари
                Ассабирийна ваалссадиқийна ваалқанитийна ваалмунфиқийна ваалмустағфирийна биалашари
                Шаҳида аллааҳу аннаҳу ла илаҳа илла ҳува ваалмалайкату ваолу алааилми қайман биалқисти ла илаҳа илла ҳува алааазийзу алҳакийму
                Инна аддийна ааинда аллааҳи алисламу вама ихталафа аллазийна уту алкитаба илла мин бааади ма жааҳуму алааилму бағйан байнаҳум ваман йакфур биайати аллааҳи файнна аллааҳа сарийаау алҳисаби
                Файн ҳажжука фақул асламту важҳийа лиллаҳи вамани иттабаааани вақул лиллазийна уту алкитаба вааломмиййийна аасламтум файн асламу фақади иҳтадау вайн тауаллау файннама ааалайка албалағу вааллааҳу басийрун биалааибади
                Инна аллазийна йакфуруна биайати аллааҳи вайақтулуна аннабиййийна биғайри ҳаққин вайақтулуна аллазийна йамуруна биалқисти мина аннаси фабашширҳум биааасабин алиймин
                Олайка аллазийна ҳабитат ааамалуҳум фий аддунйа ваалахирати вама лаҳум мин насирийна
                Алам тара ила аллазийна уту насийбан мина алкитаби йудааауна ила китаби аллааҳи лийаҳкума байнаҳум сумма йатауалла фарийқун минҳум ваҳум муааридуна
                Салика бианнаҳум қалу лан тамассана аннару илла аййаман мааадудатин вағарроҳум фий дийниҳим ма кану йафтаруна
                Факайфа иса жамааанаҳум лийаумин ла райба фийҳи ваууффийат куллу нафсин ма касабат ваҳум ла йусламуна
                Қули аллааҳумма малика алмулки тутий алмулка ман ташао ватанзиаау алмулка мимман ташао ватуааиззу ман ташао ватусиллу ман ташао бийадика алхайру иннака ааала кулли шайин қадийрун
                Тулижу аллайла фий аннаҳари ватулижу аннаҳара фий аллайли ватухрижу алҳаййа мина алмаййити ватухрижу алмаййита мина алҳаййи ватарзуқу ман ташао биғайри ҳисабин
                Ла йаттахиси алмуминуна алкафирийна аулийаа мин дуни алмуминийна ваман йафааал салика фалайса мина аллааҳи фий шайин илла ан таттақу минҳум туқатан вайуҳассирукуму аллааҳу нафсаҳу вайла аллааҳи алмасийру
                Қул ин тухфу ма фий судурикум ау тубдуҳу йаааламҳу аллааҳу вайаааламу ма фий ассамауати вама фий аларди вааллааҳу ааала кулли шайин қадийрун
                Йаума тажиду куллу нафсин ма ааамилат мин хайрин муҳдаран вама ааамилат мин суин тауадду лау анна байнаҳа вабайнаҳу амадан баааийдан вайуҳассирукуму аллааҳу нафсаҳу вааллааҳу рауфун биалааибади
                Қул ин кунтум туҳиббуна аллааҳа файттабиаауний йуҳбибкуму аллааҳу вайағфир лакум сунубакум вааллааҳу ғафурун роҳиймун
                Қул атийаау аллааҳа ваалррасула файн тауаллау файнна аллааҳа ла йуҳиббу алкафирийна
                Инна аллааҳа истафа адама вануҳан ваала иброҳийма ваала ааимрана ааала алаааламийна
                Сурриййатан бааадуҳа мин бааадин вааллааҳу самийааун ааалиймун
                Ис қалати имраату ааимрана робби инний насарту лака ма фий батний муҳарраран фатақаббал минний иннака анта ассамийаау алааалийму
                Фаламма вадааааса қалат робби инний вадааатуҳа онса вааллааҳу аааламу бима вадаааат валайса ассакару каалонса вайнний саммайтуҳа марйама вайнний оааийсуҳа бика васурриййатаҳа мина ашшайтани арражийми
                Фатақаббалаҳа роббуҳа биқабулин ҳасанин ваанбатаҳа набатан ҳасанан вакаффалаҳа закариййа куллама дахала ааалайҳа закариййа алмиҳроба важада ааиндаҳа ризқан қала йа марйаму анна лаки ҳаса қалат ҳува мин ааинди аллааҳи инна аллааҳа йарзуқу ман йашао биғайри ҳисабин
                Ҳуналика даааа закариййа роббаҳу қала робби ҳаб лий мин ладунка сурриййатан таййибатан иннака самийаау аддуааай
                Фанадасу алмалайкату ваҳува қаймун йусаллий фий алмиҳроби анна аллааҳа йубашширука бийаҳйа мусаддиқан бикалиматин мина аллааҳи васаййидан ваҳасуран ванабиййан мина ассалиҳийна
                Қала робби анна йакуну лий ғуламун вақад балағанийа алкибару ваймраатий ааақирун қала касалика аллааҳу йафааалу ма йашао
                Қала робби ижааал лий айатан қала айатука алла тукаллима аннаса саласата аййамин илла рамзан ваоскур роббака касийран васаббиҳ биалааашиййи ваалибкари
                Вайс қалати алмалайкату йа марйаму инна аллааҳа истафаки ватаҳҳараки вайстафаки ааала нисай алаааламийна
                Йа марйаму оқнутий лироббики ваосжудий вайркаааий маааа арракиааийна
                Салика мин анбай алғайби нуҳийҳи илайка вама кунта ладайҳим ис йулқуна ақламаҳум аййуҳум йакфулу марйама вама кунта ладайҳим ис йахтасимуна
                Ис қалати алмалайкату йа марйаму инна аллааҳа йубашшируки бикалиматин минҳу исмуҳу алмасийҳу ааийса ибну марйама важийҳан фий аддунйа ваалахирати вамина алмуқарробийна
                Вайукаллиму аннаса фий алмаҳди вакаҳлан вамина ассалиҳийна
                Қалат робби анна йакуну лий валадун валам йамсасний башарун қала касалики аллааҳу йахлуқу ма йашао иса қада амран файннама йақулу лаҳу кун файакуну
                Вайуаааллимуҳу алкитаба ваалҳикмата ваалттаурата ваалинжийла
                Варасулан ила баний исраийла анний қад житукум биайатин мин роббикум анний ахлуқу лакум мина аттийни каҳайати аттайри фаанфуху фийҳи файакуну тайран бийсни аллааҳи ваобрио алакмаҳа ваалабраса ваоҳйий алмаута бийсни аллааҳи ваонаббиокум бима такулуна вама таддахируна фий буйутикум инна фий салика лаайатан лакум ин кунтум муминийна
                Вамусаддиқан лима байна йадаййа мина аттаурати валиоҳилла лакум бааада аллазий ҳуррима ааалайкум важитукум биайатин мин роббикум файттақу аллааҳа ваатийаауни
                Инна аллааҳа роббий вароббукум фаоаабудуҳу ҳаса сиратун мустақиймун
                Фаламма аҳасса ааийса минҳуму алкуфра қала ман ансарий ила аллааҳи қала алҳауариййуна наҳну ансару аллааҳи аманна биаллааҳи вайшҳад бианна муслимуна
                Роббана аманна бима анзалта вайттабааана аррасула фаоктубна маааа ашшаҳидийна
                Вамакару вамакара аллааҳу вааллааҳу хайру алмакирийна
                Ис қала аллааҳу йа ааийса инний мутауаффийка варафиааука илаййа вамутаҳҳирука мина аллазийна кафару важааайлу аллазийна иттабаааука фауқа аллазийна кафару ила йауми алқийамати сумма илаййа маржиааукум фааҳкуму байнакум фийма кунтум фийҳи тахталифуна
                Фаамма аллазийна кафару фаоааассибуҳум ааасабан шадийдан фий аддунйа ваалахирати вама лаҳум мин насирийна
                Ваамма аллазийна аману ваааамилу ассалиҳати файуваффийҳим ожуроҳум вааллааҳу ла йуҳиббу ассалимийна
                Салика натлуҳу ааалайка мина алайати ваалссикри алҳакийми
                Инна масала ааийса ааинда аллааҳи камасали адама халақаҳу мин туробин сумма қала лаҳу кун файакуну
                Алҳаққу мин роббика фала такун мина алмумтарийна
                Фаман ҳажжака фийҳи мин бааади ма жаака мина алааилми фақул таааалау надаау абнаана ваабнаакум ванисаана ванисаакум ваанфусана ваанфусакум сумма набтаҳил фанажааал лаааната аллааҳи ааала алкасибийна
                Инна ҳаса лаҳува алқасасу алҳаққу вама мин илаҳин илла аллааҳу вайнна аллааҳа лаҳува алааазийзу алҳакийму
                Файн тауаллау файнна аллааҳа ааалиймун биалмуфсидийна
                Қул йа аҳла алкитаби таааалау ила калиматин сауайн байнана вабайнакум алла нааабуда илла аллааҳа вала нушрика биҳи шайан вала йаттахиса бааадуна бааадан арбабан мин дуни аллааҳи файн тауаллау фақулу ишҳаду бианна муслимуна
                Йа аҳла алкитаби лима туҳажжуна фий иброҳийма вама онзилати аттаурату ваалинжийлу илла мин бааадиҳи афала тааақилуна
                Ҳаантум ҳаолай ҳажажтум фийма лакум биҳи ааилмун фалима туҳажжуна фийма лайса лакум биҳи ааилмун вааллааҳу йаааламу ваантум ла таааламуна
                Ма кана иброҳийму йаҳудиййан вала насраниййан валакин кана ҳанийфан муслиман вама кана мина алмушрикийна
                Инна аула аннаси бийброҳийма лаллазийна иттабааауҳу ваҳаса аннабиййу вааллазийна аману вааллааҳу валиййу алмуминийна
                Ваддат тайфатун мин аҳли алкитаби лау йудиллунакум вама йудиллуна илла анфусаҳум вама йашаауруна
                Йа аҳла алкитаби лима такфуруна биайати аллааҳи ваантум ташҳадуна
                Йа аҳла алкитаби лима талбисуна алҳаққа биалбатили ватактумуна алҳаққа ваантум таааламуна
                Вақалат тайфатун мин аҳли алкитаби амину биаллазий онзила ааала аллазийна аману важҳа аннаҳари ваокфуру ахироҳу лааааллааҳум йаржиаауна
                Вала тумину илла лиман табиааа дийнакум қул инна алҳуда ҳуда аллааҳи ан йута аҳадун мисла ма утийтум ау йуҳажжукум ааинда роббикум қул инна алфадла бийади аллааҳи йутийҳи ман йашао вааллааҳу васиааун ааалиймун
                Йахтассу бироҳматиҳи ман йашао вааллааҳу су алфадли алааасийми
                Вамин аҳли алкитаби ман ин таманҳу биқинтарин йуаддиҳи илайка ваминҳум ман ин таманҳу бидийнарин ла йуаддиҳи илайка илла ма думта ааалайҳи қайман салика бианнаҳум қалу лайса ааалайна фий аломмиййийна сабийлун вайақулуна ааала аллааҳи алкасиба ваҳум йаааламуна
                Бала ман ауфа биаааҳдиҳи вайттақа файнна аллааҳа йуҳиббу алмуттақийна
                Инна аллазийна йаштаруна биаааҳди аллааҳи ваайманиҳим саманан қалийлан олайка ла халақа лаҳум фий алахирати вала йукаллимуҳуму аллааҳу вала йансуру илайҳим йаума алқийамати вала йузаккийҳим валаҳум ааасабун алиймун
                Вайнна минҳум лафарийқан йалвуна алсинатаҳум биалкитаби литаҳсабуҳу мина алкитаби вама ҳува мина алкитаби вайақулуна ҳува мин ааинди аллааҳи вама ҳува мин ааинди аллааҳи вайақулуна ааала аллааҳи алкасиба ваҳум йаааламуна
                Ма кана либашарин ан йутийаҳу аллааҳу алкитаба ваалҳукма ваалннубуввата сумма йақула лилннаси куну ааибадан лий мин дуни аллааҳи валакин куну роббаниййийна бима кунтум туаааллимуна алкитаба вабима кунтум тадрусуна
                Вала йамуракум ан таттахису алмалайката ваалннабиййийна арбабан айамурукум биалкуфри бааада ис антум муслимуна
                Вайс ахаса аллааҳу мийсақа аннабиййийна лама атайтукум мин китабин ваҳикматин сумма жаакум расулун мусаддиқун лима маааакум латуминунна биҳи валатансуруннаҳу қала аақрартум ваахастум ааала саликум исрий қалу ақрарна қала файшҳаду ваана маааакум мина ашшаҳидийна
                Фаман тауалла бааада салика фаолайка ҳуму алфасиқуна
                Афағайра дийни аллааҳи йабғуна валаҳу аслама ман фий ассамауати вааларди тауааан вакарҳан вайлайҳи йуржааауна
                Қул аманна биаллааҳи вама онзила ааалайна вама онзила ааала иброҳийма вайсмаааийла вайшақа вайааақуба вааласбати вама утийа муса ваааийса ваалннабиййуна мин роббиҳим ла нуфарриқу байна аҳадин минҳум ванаҳну лаҳу муслимуна
                Ваман йабтағи ғайра алислами дийнан фалан йуқбала минҳу ваҳува фий алахирати мина алхасирийна
                Кайфа йаҳдий аллааҳу қауман кафару бааада ийманиҳим вашаҳиду анна аррасула ҳаққун важааҳуму албаййинату вааллааҳу ла йаҳдий алқаума ассалимийна
                Олайка жазаоҳум анна ааалайҳим лаааната аллааҳи ваалмалайкати ваалннаси ажмаааийна
                Халидийна фийҳа ла йухаффафу ааанҳуму алааасабу вала ҳум йунсаруна
                Илла аллазийна табу мин бааади салика вааслаҳу файнна аллааҳа ғафурун роҳиймун
                Инна аллазийна кафару бааада ийманиҳим сумма издаду куфран лан туқбала таубатуҳум ваолайка ҳуму аддаллуна
                Инна аллазийна кафару вамату ваҳум куффарун фалан йуқбала мин аҳадиҳим мило аларди саҳабан валауи ифтада биҳи олайка лаҳум ааасабун алиймун вама лаҳум мин насирийна
                Лан таналу албирра ҳатта тунфиқу мимма туҳиббуна вама тунфиқу мин шайин файнна аллааҳа биҳи ааалиймун
                Куллу аттаааами кана ҳиллан либаний исраийла илла ма ҳаррама исраийлу ааала нафсиҳи мин қабли ан туназзала аттаурату қул фату биалттаурати фаотлуҳа ин кунтум садиқийна
                Фамани ифтара ааала аллааҳи алкасиба мин бааади салика фаолайка ҳуму асалимуна
                Қул садақа аллааҳу файттабиаау миллата иброҳийма ҳанийфан вама кана мина алмушрикийна
                Инна аувала байтин вудиааа лилннаси лаллазий бибакката мубаракан ваҳудан лилаааламийна
                Фийҳи айатун баййинатун мақаму иброҳийма ваман дахалаҳу кана аминан валиллаҳи ааала аннаси ҳижжу албайти мани истатаааа илайҳи сабийлан ваман кафара файнна аллааҳа ғаниййун ааани алаааламийна
                Қул йа аҳла алкитаби лима такфуруна биайати аллааҳи вааллааҳу шаҳийдун ааала ма тааамалуна
                Қул йа аҳла алкитаби лима тасуддуна ааан сабийли аллааҳи ман амана табғунаҳа ааиважан ваантум шуҳадао вама аллааҳу биғафилин ааамма тааамалуна
                Йа аййуҳа аллазийна аману ин тутийаау фарийқан мина аллазийна уту алкитаба йаруддукум бааада ийманикум кафирийна
                Вакайфа такфуруна ваантум тутла ааалайкум айату аллааҳи вафийкум расулуҳу ваман йааатасим биаллааҳи фақад ҳудийа ила сиратин мустақиймин
                Йа аййуҳа аллазийна аману иттақу аллааҳа ҳаққа туқатиҳи вала тамутунна илла ваантум муслимуна
                Вайаатасиму биҳабли аллааҳи жамийааан вала тафаррақу ваоскуру ниаамата аллааҳи ааалайкум ис кунтум ааадаан фааллафа байна қулубикум фаасбаҳтум биниааматиҳи ихванан вакунтум ааала шафа ҳуфратин мина аннари фаанқасакум минҳа касалика йубаййину аллааҳу лакум айатиҳи лааааллакум таҳтадуна
                Валтакун минкум омматун йадаауна ила алхайри вайамуруна биалмаааруфи вайанҳауна ааани алмункари ваолайка ҳуму алмуфлиҳуна
                Вала такуну кааллазийна тафаррақу вайхталафу мин бааади ма жааҳуму албаййинату ваолайка лаҳум ааасабун ааасиймун
                Йаума табйадду вужуҳун ватасвадду вужуҳун фаамма аллазийна исваддат вужуҳуҳум акафартум бааада ийманикум фасуқу алааасаба бима кунтум такфуруна
                Ваамма аллазийна ибйаддат вужуҳуҳум фафий роҳмати аллааҳи ҳум фийҳа халидуна
                Тилка айату аллааҳи натлуҳа ааалайка биалҳаққи вама аллааҳу йурийду сулман лилаааламийна
                Валиллаҳи ма фий ассамауати вама фий аларди вайла аллааҳи туржааау аломуру
                Кунтум хайра омматин охрижат лилннаси тамуруна биалмаааруфи ватанҳауна ааани алмункари ватуминуна биаллааҳи валау амана аҳлу алкитаби лакана хайран лаҳум минҳуму алмуминуна вааксаруҳуму алфасиқуна
                Лан йадуррукум илла асан вайн йуқатилукум йуваллукуму аладбара сумма ла йунсаруна
                Дурибат ааалайҳиму ассиллату айна ма суқифу илла биҳаблин мина аллааҳи ваҳаблин мина аннаси вабау биғадабин мина аллааҳи вадурибат ааалайҳиму алмасканату салика бианнаҳум кану йакфуруна биайати аллааҳи вайақтулуна аланбийаа биғайри ҳаққин салика бима ааасау вакану йааатадуна
                Лайсу сауаан мин аҳли алкитаби омматун қайматун йатлуна айати аллааҳи анаа аллайли ваҳум йасжудуна
                Йуминуна биаллааҳи ваалйауми алахири вайамуруна биалмаааруфи вайанҳауна ааани алмункари вайусариаауна фий алхайрати ваолайка мина ассалиҳийна
                Вама йафааалу мин хайрин фалан йукфаруҳу вааллааҳу ааалиймун биалмуттақийна
                Инна аллазийна кафару лан туғнийа ааанҳум амвалуҳум вала ауладуҳум мина аллааҳи шайан ваолайка ашабу аннари ҳум фийҳа халидуна
                Масалу ма йунфиқуна фий ҳасиҳи алҳайати аддунйа камасали рийҳин фийҳа сиррун асабат ҳарса қаумин саламу анфусаҳум фааҳлакасу вама саламаҳуму аллааҳу валакин анфусаҳум йаслимуна
                Йа аййуҳа аллазийна аману ла таттахису битанатан мин дуникум ла йалунакум хабалан вадду ма аааниттум қад бадати албағдао мин афваҳиҳим вама тухфий судуруҳум акбару қад баййанна лакуму алайати ин кунтум тааақилуна
                Ҳаантум олай туҳиббунаҳум вала йуҳиббунакум ватуминуна биалкитаби куллиҳи вайса лақукум қалу аманна вайса халау ааадду ааалайкуму аланамила мина алғайси қул муту биғайсикум инна аллааҳа ааалиймун бисати ассудури
                Ин тамсаскум ҳасанатун тасуҳум вайн тусибкум саййиатун йафроҳу биҳа вайн тасбиру вататтақу ла йадуррукум кайдуҳум шайан инна аллааҳа бима йааамалуна муҳийтун
                Вайс ғадаута мин аҳлика тубаувио алмуминийна мақааайда лилқитали вааллааҳу самийааун ааалиймун
                Ис ҳаммат тайфатани минкум ан тафшала вааллааҳу валиййуҳума ваааала аллааҳи фалйатауаккали алмуминуна
                Валақад насаракуму аллааҳу бибадрин ваантум асиллатун файттақу аллааҳа лааааллакум ташкуруна
                Ис тақулу лилмуминийна алан йакфийакум ан йумиддакум роббукум бисаласати алафин мина алмалайкати мунзалийна
                Бала ин тасбиру вататтақу вайатукум мин фауриҳим ҳаса йумдидкум роббукум бихамсати алафин мина алмалайкати мусаувимийна
                Вама жаааалаҳу аллааҳу илла бушра лакум валитатмайнна қулубукум биҳи вама аннасру илла мин ааинди аллааҳи алааазийзи алҳакийми
                Лийақтаааа тарафан мина аллазийна кафару ау йакбитаҳум файанқалибу хайбийна
                Лайса лака мина аламри шайон ау йатуба ааалайҳим ау йуааассибаҳум файннаҳум салимуна
                Валиллаҳи ма фий ассамауати вама фий аларди йағфиру лиман йашао вайуааассибу ман йашао вааллааҳу ғафурун роҳиймун
                Йа аййуҳа аллазийна аману ла такулу арриба адааафан мудаааафатан вайттақу аллааҳа лааааллакум туфлиҳуна
                Вайттақу аннара аллатий оааиддат лилкафирийна
                Ваатийаау аллааҳа ваалррасула лааааллакум турҳамуна
                Васариаау ила мағфиратин мин роббикум важаннатин ааардуҳа ассамауату вааларду оааиддат лилмуттақийна
                Аллазийна йунфиқуна фий ассаррай ваалддаррай ваалкасимийна алғайса ваалааафийна ааани аннаси вааллааҳу йуҳиббу алмуҳсинийна
                Вааллазийна иса фаааалу фаҳишатан ау саламу анфусаҳум сакару аллааҳа файстағфару лисунубиҳим ваман йағфиру ассунуба илла аллааҳу валам йусирру ааала ма фаааалу ваҳум йаааламуна
                Олайка жазаоҳум мағфиратун мин роббиҳим важаннатун тажрий мин таҳтиҳа аланҳару халидийна фийҳа ваниаама ажру алааамилийна
                Қад халат мин қабликум сунанун фасийру фий аларди фаонсуру кайфа кана ааақибату алмукассибийна
                Ҳаса байанун лилннаси ваҳудан вамауааисатун лилмуттақийна
                Вала таҳину вала таҳзану ваантуму алааалауна ин кунтум муминийна
                Ин йамсаскум қарҳун фақад масса алқаума қарҳун мислуҳу ватилка алаййаму нудауилуҳа байна аннаси валийааалама аллааҳу аллазийна аману вайаттахиса минкум шуҳадаа вааллааҳу ла йуҳиббу ассалимийна
                Валийумаҳҳиса аллааҳу аллазийна аману вайамҳақа алкафирийна
                Ам ҳасибтум ан тадхулу алжанната валамма йааалами аллааҳу аллазийна жаҳаду минкум вайааалама ассабирийна
                Валақад кунтум таманнауна алмаута мин қабли ан талқауҳу фақад раайтумуҳу ваантум тансуруна
                Вама муҳаммадун илла расулун қад халат мин қаблиҳи аррусулу афайн мата ау қутила инқалабтум ааала ааақабикум ваман йанқалиб ааала ааақибайҳи фалан йадурра аллааҳа шайан васайажзий аллааҳу ашшакирийна
                Вама кана линафсин ан тамута илла бийсни аллааҳи китабан муажжалан ваман йурид сауаба аддунйа нутиҳи минҳа ваман йурид сауаба алахирати нутиҳи минҳа васанажзий ашшакирийна
                Вакааййин мин набиййин қатала мааааҳу риббиййуна касийрун фама ваҳану лима асабаҳум фий сабийли аллааҳи вама дааауфу вама истакану вааллааҳу йуҳиббу ассабирийна
                Вама кана қаулаҳум илла ан қалу роббана иғфир лана сунубана вайсрафана фий амрина васаббит ақдамана ваонсурна ааала алқауми алкафирийна
                Фаатаҳуму аллааҳу сауаба аддунйа ваҳусна сауаби алахирати вааллааҳу йуҳиббу алмуҳсинийна
                Йа аййуҳа аллазийна аману ин тутийаау аллазийна кафару йаруддукум ааала ааақабикум фатанқалибу хасирийна
                Бали аллааҳу маулакум ваҳува хайру аннасирийна
                Санулқий фий қулуби аллазийна кафару арруааба бима ашраку биаллааҳи ма лам йуназзил биҳи султанан вамауаҳуму аннару вабиса масва ассалимийна
                Валақад садақакуму аллааҳу вааадаҳу ис таҳуссунаҳум бийсниҳи ҳатта иса фашилтум ватаназааатум фий аламри ваааасайтум мин бааади ма аракум ма туҳиббуна минкум ман йурийду аддунйа ваминкум ман йурийду алахирата сумма сарафакум ааанҳум лийабталийакум валақад ааафа ааанкум вааллааҳу су фадлин ааала алмуминийна
                Ис тусааидуна вала талвуна ааала аҳадин ваалррасулу йадааукум фий охракум фаасабакум ғамман биғаммин ликайла таҳзану ааала ма фатакум вала ма асабакум вааллааҳу хабийрун бима тааамалуна
                Сумма анзала ааалайкум мин бааади алғамми аманатан нуааасан йағша тайфатан минкум ватайфатун қад аҳаммасум анфусуҳум йасуннуна биаллааҳи ғайра алҳаққи санна алжаҳилиййати йақулуна ҳал лана мина аламри мин шайин қул инна аламра куллаҳу лиллаҳи йухфуна фий анфусиҳим ма ла йубдуна лака йақулуна лау кана лана мина аламри шайон ма қутилна ҳаҳуна қул лау кунтум фий буйутикум лабараза аллазийна кутиба ааалайҳиму алқатлу ила мадажиааиҳим валийабталийа аллааҳу ма фий судурикум валийумаҳҳиса ма фий қулубикум вааллааҳу ааалиймун бисати ассудури
                Инна аллазийна тауаллау минкум йаума илтақа алжамааани иннама истазаллааҳуму ашшайтану бибааади ма касабу валақад ааафа аллааҳу ааанҳум инна аллааҳа ғафурун ҳалиймун
                Йа аййуҳа аллазийна аману ла такуну кааллазийна кафару вақалу лийхваниҳим иса даробу фий аларди ау кану ғуззан лау кану ааиндана ма мату вама қутилу лийажааала аллааҳу салика ҳасратан фий қулубиҳим вааллааҳу йуҳйий вайумийту вааллааҳу бима тааамалуна басийрун
                Валайн қутилтум фий сабийли аллааҳи ау муттум ламағфиратун мина аллааҳи вароҳматун хайрун мимма йажмааауна
                Валайн муттум ау қутилтум лайла аллааҳи туҳшаруна
                Фабима роҳматин мина аллааҳи линта лаҳум валау кунта фассан ғалийса алқалби лайнфадду мин ҳаулика фаоаафу ааанҳум вайстағфир лаҳум вашауирҳум фий аламри файса ааазамта фатауаккал ааала аллааҳи инна аллааҳа йуҳиббу алмутауаккилийна
                Ин йансуркуму аллааҳу фала ғалиба лакум вайн йахсулкум фаман са аллазий йансурукум мин бааадиҳи ваааала аллааҳи фалйатауаккали алмуминуна
                Вама кана линабиййин ан йағулла ваман йағлул йати бима ғалла йаума алқийамати сумма туваффа куллу нафсин ма касабат ваҳум ла йусламуна
                Афамани иттабаааа ридвана аллааҳи каман баа бисахатин мина аллааҳи вамауаҳу жаҳаннаму вабиса алмасийру
                Ҳум даражатун ааинда аллааҳи вааллааҳу басийрун бима йааамалуна
                Лақад манна аллааҳу ааала алмуминийна ис бааааса фийҳим расулан мин анфусиҳим йатлу ааалайҳим айатиҳи вайузаккийҳим вайуаааллимуҳуму алкитаба ваалҳикмата вайн кану мин қаблу лафий далалин мубийнин
                Ауаламма асабаткум мусийбатун қад асабтум мислайҳа қултум анна ҳаса қул ҳува мин ааинди анфусикум инна аллааҳа ааала кулли шайин қадийрун
                Вама асабакум йаума илтақа алжамааани фабийсни аллааҳи валийааалама алмуминийна
                Валийааалама аллазийна нафақу вақийла лаҳум таааалау қатилу фий сабийли аллааҳи ауи идфааау қалу лау наааламу қиталан лайттабааанакум ҳум лилкуфри йаумайсин ақробу минҳум лилиймани йақулуна биафваҳиҳим ма лайса фий қулубиҳим вааллааҳу аааламу бима йактумуна
                Аллазийна қалу лийхваниҳим вақааааду лау атааауна ма қутилу қул файдрау ааан анфусикуму алмаута ин кунтум садиқийна
                Вала таҳсабанна аллазийна қутилу фий сабийли аллааҳи амватан бал аҳйаон ааинда роббиҳим йурзақуна
                Фариҳийна бима атаҳуму аллааҳу мин фадлиҳи вайастабшируна биаллазийна лам йалҳақу биҳим мин халфиҳим алла хауфун ааалайҳим вала ҳум йаҳзануна
                Йастабшируна биниааматин мина аллааҳи вафадлин ваанна аллааҳа ла йудийаау ажра алмуминийна
                Аллазийна истажабу лиллаҳи ваалррасули мин бааади ма асабаҳуму алқарҳу лиллазийна аҳсану минҳум вайттақау ажрун ааасиймун
                Аллазийна қала лаҳуму аннасу инна аннаса қад жамааау лакум файхшауҳум фазадаҳум ийманан вақалу ҳасбуна аллааҳу ваниаама алвакийлу
                Файнқалабу биниааматин мина аллааҳи вафадлин лам йамсашум суон вайттабааау ридвана аллааҳи вааллааҳу су фадлин ааасиймин
                Иннама саликуму ашшайтану йухаувифу аулийааҳу фала тахафуҳум вахафуни ин кунтум муминийна
                Вала йаҳзунка аллазийна йусариаауна фий алкуфри иннаҳум лан йадурру аллааҳа шайан йурийду аллааҳу алла йажааала лаҳум ҳассан фий алахирати валаҳум ааасабун ааасиймун
                Инна аллазийна иштарауу алкуфра биалиймани лан йадурру аллааҳа шайан валаҳум ааасабун алиймун
                Вала йаҳсабанна аллазийна кафару аннама нумлий лаҳум хайрун лианфусиҳим иннама нумлий лаҳум лийаздаду исман валаҳум ааасабун муҳийнун
                Ма кана аллааҳу лийасара алмуминийна ааала ма антум ааалайҳи ҳатта йамийза алхабийса мина аттаййиби вама кана аллааҳу лийутлиааакум ааала алғайби валакинна аллааҳа йажтабий мин русулиҳи ман йашао фаамину биаллааҳи варусулиҳи вайн тумину вататтақу фалакум ажрун ааасиймун
                Вала йаҳсабанна аллазийна йабхалуна бима атаҳумму аллааҳу мин фадлиҳи ҳува хайран лаҳум бал ҳува шаррун лаҳум сайутаувақуна ма бахилу биҳи йаума алқийамати валиллаҳи мийрасу ассамауати вааларди вааллааҳу бима тааамалуна хабийрун
                Лақад самиааа аллааҳу қаула аллазийна қалу инна аллааҳа фақийрун ванаҳну ағнийаон санактубу ма қалу вақатлаҳуму аланбийаа биғайри ҳаққин ванақулу суқу ааасаба алҳарийқи
                Салика бима қаддамат айдийкум ваанна аллааҳа лайса бисалламин лилааабийди
                Аллазийна қалу инна аллааҳа аааҳида илайна алла нумина лирасулин ҳатта йатийана биқурбанин такулуҳу аннару қул қад жаакум русулун мин қаблий биалбаййинати вабиаллазий қултум фалима қаталтумуҳум ин кутум садиқийна
                Файн кассабука фақад куссиба русулун мин қаблика жау биалбаййинати ваалззубури ваалкитаби алмунийри
                Куллу нафсин сайқату алмаути вайннама туваффауна ожуракум йаума алқийамати фаман зуҳзиҳа ааани аннари ваодхила алжанната фақад фаза вама алҳайату аддунйа илла матааау алғурури
                Латублауунна фий амваликум ваанфусикум валатасмаааунна мина аллазийна уту алкитаба мин қабликум вамина аллазийна ашраку асан касийран вайн тасбиру вататтақу файнна салика мин ааазми аломури
                Вайс ахаса аллааҳу мийсақа аллазийна уту алкитаба латубаййинуннаҳу лилннаси вала тактумунаҳу фанабасуҳу вараа суҳуриҳим вайштарау биҳи саманан қалийлан фабиса ма йаштаруна
                Ла таҳсабанна аллазийна йафроҳуна бима атау вайуҳиббуна ан йуҳмаду бима лам йафааалу фала таҳсабаннаҳум бимафазатин мина алааасаби валаҳум ааасабун алиймун
                Валиллаҳи мулку ассамауати вааларди вааллааҳу ааала кулли шайин қадийрун
                Инна фий халқи ассамауати вааларди вайхтилафи аллайли ваалннаҳари лаайатин лиолий алалбаби
                Аллазийна йаскуруна аллааҳа қийаман вақуааудан ваааала жунубиҳим вайатафаккаруна фий халқи ассамауати вааларди роббана ма халақта ҳаса батилан субҳанака фақина ааасаба аннари
                Роббана иннака ман тудхили аннара фақад ахзайтаҳу вама лилссалимийна мин ансарин
                Роббана иннана самиаана мунадийан йунадий лилиймани ан амину бироббикум фааманна роббана файғфир лана сунубана вакаффир ааанна саййиатина ватауаффана маааа алабрари
                Роббана ваатина ма ваааадтана ааала русулика вала тухзина йаума алқийамати иннака ла тухлифу алмийааада
                Файстажаба лаҳум роббуҳум анний ла одийаау ааамала ааамилин минкум мин сакарин ау онса бааадукум мин бааадин фааллазийна ҳажару ваохрижу мин дийариҳим ваусу фий сабийлий вақаталу вақутилу лаокаффиранна ааанҳум саййиатиҳим валаодхиланнаҳум жаннатин тажрий мин таҳтиҳа аланҳару сауабан мин ааинди аллааҳи вааллааҳу ааиндаҳу ҳусну ассауаби
                Ла йағурраннака тақаллубу аллазийна кафару фий албилади
                Матаааун қалийлун сумма мауаҳум жаҳаннаму вабиса алмиҳаду
                Лакини аллазийна иттақау роббаҳум лаҳум жаннатун тажрий мин таҳтиҳа аланҳару халидийна фийҳа нузулан мин ааинди аллааҳи вама ааинда аллааҳи хайрун лилабрари
                Вайнна мин аҳли алкитаби ламан йумину биаллааҳи вама онзила илайкум вама онзила илайҳим хашиааийна лиллаҳи ла йаштаруна биайати аллааҳи саманан қалийлан олайка лаҳум ажруҳум ааинда роббиҳим инна аллааҳа сарийаау алҳисаби
                Йа аййуҳа аллазийна аману исбиру васабиру варобиту вайттақу аллааҳа лааааллакум туфлиҳуна
            """.trimIndent(),
        ),
        Surah(
            id = 4,
            arabicName = "النساء",
            latinName = "An-Nisa",
            transliteration = """
                Йа аййуҳа аннасу иттақу роббакуму аллазий халақакум мин нафсин ваҳидатин вахалақа минҳа заужаҳа вабасса минҳума рижалан касийран ванисаан вайттақу аллааҳа аллазий тасаалуна биҳи вааларҳама инна аллааҳа кана ааалайкум рақийбан
                Ваату алйатама амвалаҳум вала татабаддалу алхабийса биалттаййиби вала такулу амвалаҳум ила амваликум иннаҳу кана ҳубан кабийран
                Вайн хифтум алла туқситу фий алйатама файнкиҳу ма таба лакум мина аннисай масна васуласа варубаааа файн хифтум алла тааадилу фауаҳидатан ау ма малакат айманукум салика адна алла таааулу
                Ваату аннисаа садуқатиҳинна ниҳлатан файн тибна лакум ааан шайин минҳу нафсан факулуҳу ҳанийан марийан
                Вала туту ассуфаҳаа амвалакуму аллатий жаааала аллааҳу лакум қийаман ваорзуқуҳум фийҳа ваоксуҳум вақулу лаҳум қаулан маааруфан
                Вайбталу алйатама ҳатта иса балағу анникаҳа файн анастум минҳум рушдан файдфааау илайҳим амвалаҳум вала такулуҳа исрафан вабидаран ан йакбару ваман кана ғаниййан фалйастааафиф ваман кана фақийран фалйакул биалмаааруфи файса дафааатум илайҳим амвалаҳум фаашҳиду ааалайҳим вакафа биаллааҳи ҳасийбан
                Лилррижали насийбун мимма тарака алвалидани ваалақробуна валилннисай насийбун мимма тарака алвалидани ваалақробуна мимма қалла минҳу ау касура насийбан мафрудан
                Вайса ҳадара алқисмата олу алқурба ваалйатама ваалмасакийну фаорзуқуҳум минҳу вақулу лаҳум қаулан маааруфан
                Валйахша аллазийна лау тараку мин халфиҳим сурриййатан диааафан хафу ааалайҳим фалйаттақу аллааҳа валйақулу қаулан садийдан
                Инна аллазийна йакулуна амвала алйатама сулман иннама йакулуна фий бутуниҳим наран васайаслауна саааийран
                Йусийкуму аллааҳу фий ауладикум лилссакари мислу ҳасси алонсайайни файн кунна нисаан фауқа иснатайни фалаҳунна сулуса ма тарака вайн канат ваҳидатан фалаҳа аннисфу валиабауайҳи ликулли ваҳидин минҳума ассудусу мимма тарака ин кана лаҳу валадун файн лам йакун лаҳу валадун вауарисаҳу абауаҳу фалиоммиҳи ассулусу файн кана лаҳу ихватун фалиоммиҳи ассудусу мин бааади васиййатин йусий биҳа ау дайнин абаокум ваабнаокум ла тадруна аййуҳум ақробу лакум нафааан фарийдатан мина аллааҳи инна аллааҳа кана ааалийман ҳакийман
                Валакум нисфу ма тарака азважукум ин лам йакун лаҳунна валадун файн кана лаҳунна валадун фалакуму аррубуаау мимма таракна мин бааади васиййатин йусийна биҳа ау дайнин валаҳунна аррубуаау мимма тарактум ин лам йакун лакум валадун файн кана лакум валадун фалаҳунна ассумуну мимма тарактум мин бааади васиййатин тусуна биҳа ау дайнин вайн кана ражулун йурасу калалатан ауи имраатун валаҳу ахун ау охтун фаликулли ваҳидин минҳума ассудусу файн кану аксара мин салика фаҳум шуракао фий ассулуси мин бааади васиййатин йуса биҳа ау дайнин ғайра мударрин васиййатан мина аллааҳи вааллааҳу ааалиймун ҳалиймун
                Тилка ҳудуду аллааҳи ваман йутиааи аллааҳа варасулаҳу йудхилҳу жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа васалика алфаузу алааасийму
                Ваман йаааси аллааҳа варасулаҳу вайатаааадда ҳудудаҳу йудхилҳу наран халидан фийҳа валаҳу ааасабун муҳийнун
                Вааллатий йатийна алфаҳишата мин нисайкум файсташҳиду ааалайҳинна арбаааатан минкум файн шаҳиду фаамсикуҳунна фий албуйути ҳатта йатауаффаҳунна алмауту ау йажааала аллааҳу лаҳунна сабийлан
                Вааллазани йатийаниҳа минкум фаасуҳума файн таба вааслаҳа фаааариду ааанҳума инна аллааҳа кана таувабан роҳийман
                Иннама аттаубату ааала аллааҳи лиллазийна йааамалуна ассуа бижаҳалатин сумма йатубуна мин қарийбин фаолайка йатубу аллааҳу ааалайҳим вакана аллааҳу ааалийман ҳакийман
                Валайсати аттаубату лиллазийна йааамалуна ассаййиати ҳатта иса ҳадара аҳадаҳуму алмауту қала инний тубту алана вала аллазийна йамутуна ваҳум куффарун олайка ааатадна лаҳум ааасабан алийман
                Йа аййуҳа аллазийна аману ла йаҳиллу лакум ан тарису аннисаа карҳан вала тааадулуҳунна литасҳабу бибааади ма атайтумуҳунна илла ан йатийна бифаҳишатин мубаййинатин ваааашируҳунна биалмаааруфи файн кариҳтумуҳунна фааааса ан такроҳу шайан вайажааала аллааҳу фийҳи хайран касийран
                Вайн арадтуму истибдала заужин макана заужин ваатайтум иҳдаҳунна қинтаран фала тахусу минҳу шайан атахусунаҳу буҳтанан вайсман мубийнан
                Вакайфа тахусунаҳу вақад афда бааадукум ила бааадин ваахасна минкум мийсақан ғалийсан
                Вала танкиҳу ма накаҳа абаокум мина аннисай илла ма қад салафа иннаҳу кана фаҳишатан вамақтан васаа сабийлан
                Ҳурримат ааалайкум оммаҳатукум вабанатукум ваахауатукум ваааамматукум вахалатукум вабанату алахи вабанату алохти ваоммаҳатукуму аллатий ардааанакум ваахауатукум мина аррадаааати ваоммаҳату нисайкум варобайбукуму аллатий фий ҳужурикум мин нисайкуму аллатий дахалтум биҳинна файн лам такуну дахалтум биҳинна фала жунаҳа ааалайкум ваҳалайлу абнайкуму аллазийна мин аслабикум ваан тажмааау байна алохтайни илла ма қад салафа инна аллааҳа кана ғафуран роҳийман
                Ваалмуҳсанату мина аннисай илла ма малакат айманукум китаба аллааҳи ааалайкум ваоҳилла лакум ма вараа саликум ан табтағу биамваликум муҳсинийна ғайра мусафиҳийна фама истамтааатум биҳи минҳунна фаатуҳунна ожуроҳунна фарийдатан вала жунаҳа ааалайкум фийма тарадайтум биҳи мин бааади алфарийдати инна аллааҳа кана ааалийман ҳакийман
                Ваман лам йастатиаа минкум таулан ан йанкиҳа алмуҳсанати алмуминати фамин ма малакат айманукум мин фатайатикуму алмуминати вааллааҳу аааламу биийманикум бааадукум мин бааадин файнкиҳуҳунна бийсни аҳлиҳинна ваатуҳунна ожуроҳунна биалмаааруфи муҳсанатин ғайра масафиҳатин вала муттахисати ахданин файса оҳсинна файн атайна бифаҳишатин фаааалайҳинна нисфу ма ааала алмуҳсанати мина алааасаби салика лиман хашийа алаааната минкум ваан тасбиру хайрун лакум вааллааҳу ғафурун роҳиймун
                Йурийду аллааҳу лийубаййина лакум вайаҳдийакум сунана аллазийна мин қабликум вайатуба ааалайкум вааллааҳу ааалиймун ҳакиймун
                Вааллааҳу йурийду ан йатуба ааалайкум вайурийду аллазийна йаттабиаауна ашшаҳауати ан тамийлу майлан ааасийман
                Йурийду аллааҳу ан йухаффифа ааанкум вахулиқа алинсану даааийфан
                Йа аййуҳа аллазийна аману ла такулу амвалакум байнакум биалбатили илла ан такуна тижаратан ааан тарадин минкум вала тақтулу анфусакум инна аллааҳа кана бикум роҳийман
                Ваман йафааал салика ааудванан васулман фасауфа нуслийҳи наран вакана салика ааала аллааҳи йасийран
                Ин тажтанибу кабайра ма тунҳауна ааанҳу нукаффир ааанкум саййиатикум ванудхилкум мудхалан карийман
                Вала татаманнау ма фаддала аллааҳу биҳи бааадакум ааала бааадин лилррижали насийбун мимма иктасабу валилннисай насийбун мимма иктасабна вайсалу аллааҳа мин фадлиҳи инна аллааҳа кана бикулли шайин ааалийман
                Валикуллин жаааална мауалийа мимма тарака алвалидани ваалақробуна вааллазийна ааақадат айманукум фаатуҳум насийбаҳум инна аллааҳа кана ааала кулли шайин шаҳийдан
                Аррижалу қаувамуна ааала аннисай бима фаддала аллааҳу бааадаҳум ааала бааадин вабима анфақу мин амвалиҳим фаалссалиҳату қанитатун ҳафисатун лилғайби бима ҳафиса аллааҳу вааллатий тахафуна нушузаҳунна фааайсуҳунна ваоҳжуруҳунна фий алмадажиааи вайдрибуҳунна файн атааанакум фала табғу ааалайҳинна сабийлан инна аллааҳа кана ааалиййан кабийран
                Вайн хифтум шиқақа байниҳима файбааасу ҳакаман мин аҳлиҳи ваҳакаман мин аҳлиҳа ин йурийда ислаҳан йуваффиқи аллааҳу байнаҳума инна аллааҳа кана ааалийман хабийран
                Ваоаабуду аллааҳа вала тушрику биҳи шайан вабиалвалидайни иҳсанан вабисий алқурба ваалйатама ваалмасакийни ваалжари сий алқурба ваалжари алжунуби ваалссаҳиби биалжанби вайбни ассабийли вама малакат айманукум инна аллааҳа ла йуҳиббу ман кана мухталан фахуран
                Аллазийна йабхалуна вайамуруна аннаса биалбухли вайактумуна ма атаҳуму аллааҳу мин фадлиҳи ваааатадна лилкафирийна ааасабан муҳийнан
                Вааллазийна йунфиқуна амвалаҳум риаа аннаси вала йуминуна биаллааҳи вала биалйауми алахири ваман йакуни ашшайтану лаҳу қарийнан фасаа қарийнан
                Вамаса ааалайҳим лау аману биаллааҳи ваалйауми алахири ваанфақу мимма разақаҳуму аллааҳу вакана аллааҳу биҳим ааалийман
                Инна аллааҳа ла йаслиму мисқала сарратин вайн таку ҳасанатан йудааайфҳа вайути мин ладунҳу ажран ааасийман
                Факайфа иса жина мин кулли омматин бишаҳийдин важина бика ааала ҳаолай шаҳийдан
                Йаумайсин йауадду аллазийна кафару ваааасауу аррасула лау тусаува биҳиму аларду вала йактумуна аллааҳа ҳадийсан
                Йа аййуҳа аллазийна аману ла тақробу ассалата ваантум сукара ҳатта таааламу ма тақулуна вала жунубан илла ааабирий сабийлин ҳатта тағтасилу вайн кунтум марда ау ааала сафарин ау жаа аҳадун минкум мина алғайти ау ламастуму аннисаа фалам тажиду маан фатайаммаму саааийдан таййибан файмсаҳу бивужуҳикум ваайдийкум инна аллааҳа кана ааафувван ғафуран
                Алам тара ила аллазийна уту насийбан мина алкитаби йаштаруна аддалалата вайурийдуна ан тадиллу ассабийла
                Вааллааҳу аааламу биааадайкум вакафа биаллааҳи валиййан вакафа биаллааҳи насийран
                Мина аллазийна ҳаду йуҳаррифуна алкалима ааан мауадиааиҳи вайақулуна самиаана ваааасайна вайсмааа ғайра мусмааайн варааайна лаййан биалсинатиҳим ватааанан фий аддийни валау аннаҳум қалу самиаана ваатааана вайсмааа ваонсурна лакана хайран лаҳум ваақвама валакин лаааанаҳуму аллааҳу бикуфриҳим фала йуминуна илла қалийлан
                Йа аййуҳа аллазийна уту алкитаба амину бима наззална мусаддиқан лима маааакум мин қабли ан натмиса вужуҳан фанаруддаҳа ааала адбариҳа ау налааанаҳум кама лаааанна ашаба ассабти вакана амру аллааҳи мафааулан
                Инна аллааҳа ла йағфиру ан йушрака биҳи вайағфиру ма дуна салика лиман йашао ваман йушрик биаллааҳи фақади ифтара исман ааасийман
                Алам тара ила аллазийна йузаккуна анфусаҳум бали аллааҳу йузаккий ман йашао вала йусламуна фатийлан
                Онсур кайфа йафтаруна ааала аллааҳи алкасиба вакафа биҳи исман мубийнан
                Алам тара ила аллазийна уту насийбан мина алкитаби йуминуна биалжибти ваалттағути вайақулуна лиллазийна кафару ҳаолай аҳда мина аллазийна аману сабийлан
                Олайка аллазийна лаааанаҳуму аллааҳу ваман йалааани аллааҳу фалан тажида лаҳу насийран
                Ам лаҳум насийбун мина алмулки файсан ла йутуна аннаса нақийран
                Ам йаҳсудуна аннаса ааала ма атаҳуму аллааҳу мин фадлиҳи фақад атайна ала иброҳийма алкитаба ваалҳикмата ваатайнаҳум мулкан ааасийман
                Фаминҳум ман амана биҳи ваминҳум ман садда ааанҳу вакафа бижаҳаннама саааийран
                Инна аллазийна кафару биайатина сауфа нуслийҳим наран куллама надижат жулудуҳум баддалнаҳум жулудан ғайроҳа лийасуқу алааасаба инна аллааҳа кана ааазийзан ҳакийман
                Вааллазийна аману ваааамилу ассалиҳати санудхилуҳум жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа абадан лаҳум фийҳа азважун мутаҳҳаратун ванудхилуҳум силлан салийлан
                Инна аллааҳа йамурукум ан туадду аламанати ила аҳлиҳа вайса ҳакамтум байна аннаси ан таҳкуму биалааадли инна аллааҳа ниааимма йааайсукум биҳи инна аллааҳа кана самийааан басийран
                Йа аййуҳа аллазийна аману атийаау аллааҳа ваатийаау аррасула ваолий аламри минкум файн таназааатум фий шайин фаруддуҳу ила аллааҳи ваалррасули ин кунтум туминуна биаллааҳи ваалйауми алахири салика хайрун вааҳсану тауийлан
                Алам тара ила аллазийна йазааумуна аннаҳум аману бима онзила илайка вама онзила мин қаблика йурийдуна ан йатаҳакаму ила аттағути вақад омиру ан йакфуру биҳи вайурийду ашшайтану ан йудиллаҳум далалан баааийдан
                Вайса қийла лаҳум таааалау ила ма анзала аллааҳу вайла аррасули раайта алмунафиқийна йасуддуна ааанка судудан
                Факайфа иса асабасум мусийбатун бима қаддамат айдийҳим сумма жаука йаҳлифуна биаллааҳи ин арадна илла иҳсанан ватауфийқан
                Олайка аллазийна йаааламу аллааҳу ма фий қулубиҳим фаааарид ааанҳум вааайсҳум вақул лаҳум фий анфусиҳим қаулан балийған
                Вама арсална мин расулин илла лийутаааа бийсни аллааҳи валау аннаҳум ис саламу анфусаҳум жаука файстағфару аллааҳа вайстағфара лаҳуму аррасулу лауажаду аллааҳа таувабан роҳийман
                Фала вароббика ла йуминуна ҳатта йуҳаккимука фийма шажара байнаҳум сумма ла йажиду фий анфусиҳим ҳаражан мимма қадайта вайусаллиму таслийман
                Валау анна катабна ааалайҳим ани оқтулу анфусакум ауи охружу мин дийарикум ма фаааалуҳу илла қалийлун минҳум валау аннаҳум фаааалу ма йуааасуна биҳи лакана хайран лаҳум ваашадда тасбийтан
                Вайсан лаатайнаҳум мин ладунна ажран ааасийман
                Валаҳадайнаҳум сиратан мустақийман
                Ваман йутиааи аллааҳа ваалррасула фаолайка маааа аллазийна анааама аллааҳу ааалайҳим мина аннабиййийна ваалссиддийқийна ваалшшуҳадай ваалссалиҳийна ваҳасуна олайка рафийқан
                Салика алфадлу мина аллааҳи вакафа биаллааҳи ааалийман
                Йа аййуҳа аллазийна аману хусу ҳисракум файнфиру субатин ауи инфиру жамийааан
                Вайнна минкум ламан лайубаттианна файн асабаткум мусийбатун қала қад анааама аллааҳу ааалаййа ис лам акун мааааҳум шаҳийдан
                Валайн асабакум фадлун мина аллааҳи лайақуланна каан лам такун байнакум вабайнаҳу мауаддатун йа лайтаний кунту мааааҳум фаафуза фаузан ааасийман
                Фалйуқатил фий сабийли аллааҳи аллазийна йашруна алҳайата аддунйа биалахирати ваман йуқатил фий сабийли аллааҳи файуқтал ау йағлиб фасауфа нутийҳи ажран ааасийман
                Вама лакум ла туқатилуна фий сабийли аллааҳи ваалмустадааафийна мина аррижали ваалннисай ваалвилдани аллазийна йақулуна роббана ахрижна мин ҳасиҳи алқарйати ассалими аҳлуҳа вайжааал лана мин ладунка валиййан вайжааал лана мин ладунка насийран
                Аллазийна аману йуқатилуна фий сабийли аллааҳи вааллазийна кафару йуқатилуна фий сабийли аттағути фақатилу аулийаа ашшайтани инна кайда ашшайтани кана даааийфан
                Алам тара ила аллазийна қийла лаҳум куффу айдийакум ваақийму ассалата ваату аззаката фаламма кутиба ааалайҳиму алқиталу иса фарийқун минҳум йахшауна аннаса кахашйати аллааҳи ау ашадда хашйатан вақалу роббана лима катабта ааалайна алқитала лаула аххартана ила ажалин қарийбин қул матааау аддунйа қалийлун ваалахирату хайрун лимани иттақа вала тусламуна фатийлан
                Айнама такуну йудриккуму алмауту валау кунтум фий буружин мушаййадатин вайн тусибҳум ҳасанатун йақулу ҳасиҳи мин ааинди аллааҳи вайн тусибҳум саййиатун йақулу ҳасиҳи мин ааиндика қул куллун мин ааинди аллааҳи фамали ҳаолай алқауми ла йакадуна йафқаҳуна ҳадийсан
                Ма асабака мин ҳасанатин фамина аллааҳи вама асабака мин саййиатин фамин нафсика ваарсалнака лилннаси расулан вакафа биаллааҳи шаҳийдан
                Ман йутиааи аррасула фақад атаааа аллааҳа ваман тауалла фама арсалнака ааалайҳим ҳафийсан
                Вайақулуна таааатун файса баразу мин ааиндика баййата тайфатун минҳум ғайра аллазий тақулу вааллааҳу йактубу ма йубаййитуна фаааарид ааанҳум ватауаккал ааала аллааҳи вакафа биаллааҳи вакийлан
                Афала йатадаббаруна алқурана валау кана мин ааинди ғайри аллааҳи лауажаду фийҳи ихтилафан касийран
                Вайса жааҳум амрун мина аламни ауи алхауфи асааау биҳи валау раддуҳу ила аррасули вайла олий аламри минҳум лаааалимаҳу аллазийна йастанбитунаҳу минҳум валаула фадлу аллааҳи ааалайкум вароҳматуҳу лайттабааатуму ашшайтана илла қалийлан
                Фақатил фий сабийли аллааҳи ла тукаллафу илла нафсака ваҳарриди алмуминийна аааса аллааҳу ан йакуффа баса аллазийна кафару вааллааҳу ашадду басан ваашадду танкийлан
                Ман йашфааа шафаааатан ҳасанатан йакун лаҳу насийбун минҳа ваман йашфааа шафаааатан саййиатан йакун лаҳу кифлун минҳа вакана аллааҳу ааала кулли шайин муқийтан
                Вайса ҳуййийтум битаҳиййатин фаҳаййу биаҳсана минҳа ау руддуҳа инна аллааҳа кана ааала кулли шайин ҳасийбан
                Аллааҳу ла илаҳа илла ҳува лайажмааааннакум ила йауми алқийамати ла райба фийҳи ваман асдақу мина аллааҳи ҳадийсан
                Фама лакум фий алмунафиқийна фиатайни вааллааҳу аркасаҳум бима касабу атурийдуна ан таҳду ман адалла аллааҳу ваман йудлили аллааҳу фалан тажида лаҳу сабийлан
                Вадду лау такфуруна кама кафару фатакунуна сауаан фала таттахису минҳум аулийаа ҳатта йуҳажиру фий сабийли аллааҳи файн тауаллау фахусуҳум ваоқтулуҳум ҳайсу важадтумуҳум вала таттахису минҳум валиййан вала насийран
                Илла аллазийна йасилуна ила қаумин байнакум вабайнаҳум мийсақун ау жаукум ҳасират судуруҳум ан йуқатилукум ау йуқатилу қаумаҳум валау шаа аллааҳу ласаллатаҳум ааалайкум фалақаталукум файни иаатазалукум фалам йуқатилукум ваалқау илайкуму ассалама фама жаааала аллааҳу лакум ааалайҳим сабийлан
                Сатажидуна ахарийна йурийдуна ан йаманукум вайаману қаумаҳум кулла ма рудду ила алфитнати оркису фийҳа файн лам йааатазилукум вайулқу илайкуму ассалама вайакуффу айдийаҳум фахусуҳум ваоқтулуҳум ҳайсу сақифтумуҳум ваолайкум жаааална лакум ааалайҳим султанан мубийнан
                Вама кана лимуминин ан йақтула муминан илла хатаан ваман қатала муминан хатаан фатаҳрийру рақабатин муминатин вадийатун мусалламатун ила аҳлиҳи илла ан йассаддақу файн кана мин қаумин ааадуввин лакум ваҳува муминун фатаҳрийру рақабатин муминатин вайн кана мин қаумин байнакум вабайнаҳум мийсақун фадийатун мусалламатун ила аҳлиҳи ватаҳрийру рақабатин муминатин фаман лам йажид фасийаму шаҳрайни мутатабиааайни таубатан мина аллааҳи вакана аллааҳу ааалийман ҳакийман
                Ваман йақтул муминан мутааааммидан фажазаоҳу жаҳаннаму халидан фийҳа вағадиба аллааҳу ааалайҳи валаааанаҳу вааааадда лаҳу ааасабан ааасийман
                Йа аййуҳа аллазийна аману иса даробтум фий сабийли аллааҳи фатабаййану вала тақулу лиман алқа илайкуму ассалама ласта муминан табтағуна ааарада алҳайати аддунйа фааайнда аллааҳи мағаниму касийратун касалика кунтум мин қаблу фаманна аллааҳу ааалайкум фатабаййану инна аллааҳа кана бима тааамалуна хабийран
                Ла йастауий алқааайдуна мина алмуминийна ғайру олий аддарари ваалмужаҳидуна фий сабийли аллааҳи биамвалиҳим ваанфусиҳим фаддала аллааҳу алмужаҳидийна биамвалиҳим ваанфусиҳим ааала алқааайдийна даражатан вакуллан ваааада аллааҳу алҳусна вафаддала аллааҳу алмужаҳидийна ааала алқааайдийна ажран ааасийман
                Даражатин минҳу вамағфиратан вароҳматан вакана аллааҳу ғафуран роҳийман
                Инна аллазийна тауаффаҳуму алмалайкату салимий анфусиҳим қалу фийма кунтум қалу кунна мустадааафийна фий аларди қалу алам такун арду аллааҳи васиааатан фатуҳажиру фийҳа фаолайка мауаҳум жаҳаннаму васаат масийран
                Илла алмустадааафийна мина аррижали ваалннисай ваалвилдани ла йастатийаауна ҳийлатан вала йаҳтадуна сабийлан
                Фаолайка аааса аллааҳу ан йааафува ааанҳум вакана аллааҳу ааафувван ғафуран
                Ваман йуҳажир фий сабийли аллааҳи йажид фий аларди мурағаман касийран васаааатан ваман йахруж мин байтиҳи муҳажиран ила аллааҳи варасулиҳи сумма йудриху алмауту фақад вақаааа ажруҳу ааала аллааҳи вакана аллааҳу ғафуран роҳийман
                Вайса даробтум фий аларди фалайса ааалайкум жунаҳун ан тақсуру мина ассалати ин хифтум ан йафтинакуму аллазийна кафару инна алкафирийна кану лакум ааадувван мубийнан
                Вайса кунта фийҳим фаақамта лаҳуму ассалата фалтақум тайфатун минҳум маааака валйахусу аслиҳатаҳум файса сажаду фалйакуну мин варайкум валтати тайфатун охра лам йусаллу фалйусаллу маааака валйахусу ҳисроҳум вааслиҳатаҳум вадда аллазийна кафару лау тағфулуна ааан аслиҳатикум ваамтиааатикум файамийлуна ааалайкум майлатан ваҳидатан вала жунаҳа ааалайкум ин кана бикум асан мин матарин ау кунтум марда ан тадааау аслиҳатакум вахусу ҳисракум инна аллааҳа аааадда лилкафирийна ааасабан муҳийнан
                Файса қадайтуму ассалата фаоскуру аллааҳа қийаман вақуааудан ваааала жунубикум файса итманантум фаақийму ассалата инна ассалата канат ааала алмуминийна китабан мауқутан
                Вала таҳину фий ибтиғай алқауми ин такуну таламуна файннаҳум йаламуна кама таламуна ватаржуна мина аллааҳи ма ла йаржуна вакана аллааҳу ааалийман ҳакийман
                Инна анзална илайка алкитаба биалҳаққи литаҳкума байна аннаси бима арака аллааҳу вала такун лилхайнийна хасийман
                Вайстағфири аллааҳа инна аллааҳа кана ғафуран роҳийман
                Вала тужадил ааани аллазийна йахтануна анфусаҳум инна аллааҳа ла йуҳиббу ман кана хауванан асийман
                Йастахфуна мина аннаси вала йастахфуна мина аллааҳи ваҳува мааааҳум ис йубаййитуна ма ла йарда мина алқаули вакана аллааҳу бима йааамалуна муҳийтан
                Ҳаантум ҳаолай жадалтум ааанҳум фий алҳайати аддунйа фаман йужадилу аллааҳа ааанҳум йаума алқийамати ам ман йакуну ааалайҳим вакийлан
                Ваман йааамал суан ау йаслим нафсаҳу сумма йастағфири аллааҳа йажиди аллааҳа ғафуран роҳийман
                Ваман йаксиб исман файннама йаксибуҳу ааала нафсиҳи вакана аллааҳу ааалийман ҳакийман
                Ваман йаксиб хатийатан ау исман сумма йарми биҳи барийан фақади иҳтамала буҳтанан вайсман мубийнан
                Валаула фадлу аллааҳи ааалайка вароҳматуҳу лаҳаммат тайфатун минҳум ан йудиллука вама йудиллуна илла анфусаҳум вама йадуррунака мин шайин ваанзала аллааҳу ааалайка алкитаба ваалҳикмата ваааалламака ма лам такун таааламу вакана фадлу аллааҳи ааалайка ааасийман
                Ла хайра фий касийрин мин нажваҳум илла ман амара бисадақатин ау маааруфин ау ислаҳин байна аннаси ваман йафааал салика ибтиғаа мардати аллааҳи фасауфа нутийҳи ажран ааасийман
                Ваман йушақиқи аррасула мин бааади ма табаййана лаҳу алҳуда вайаттабиаа ғайра сабийли алмуминийна нуваллиҳи ма тауалла вануслиҳи жаҳаннама васаат масийран
                Инна аллааҳа ла йағфиру ан йушрака биҳи вайағфиру ма дуна салика лиман йашао ваман йушрик биаллааҳи фақад далла далалан баааийдан
                Ин йадаауна мин дуниҳи илла инасан вайн йадаауна илла шайтанан марийдан
                Лаааанаҳу аллааҳу вақала лааттахисанна мин ааибадика насийбан мафрудан
                Валаодилланнаҳум валаоманнийаннаҳум валаамураннаҳум фалайубаттикунна асана аланааами валаамураннаҳум фалайуғаййирунна халқа аллааҳи ваман йаттахиси ашшайтана валиййан мин дуни аллааҳи фақад хасира хусранан мубийнан
                Йааайдуҳум вайуманнийҳим вама йааайдуҳуму ашшайтану илла ғуруран
                Олайка мауаҳум жаҳаннаму вала йажидуна ааанҳа маҳийсан
                Вааллазийна аману ваааамилу ассалиҳати санудхилуҳум жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа абадан вааада аллааҳи ҳаққан ваман асдақу мина аллааҳи қийлан
                Лайса биаманиййикум вала аманиййи аҳли алкитаби ман йааамал суан йужза биҳи вала йажид лаҳу мин дуни аллааҳи валиййан вала насийран
                Ваман йааамал мина ассалиҳати мин сакарин ау онса ваҳува муминун фаолайка йадхулуна алжанната вала йусламуна нақийран
                Ваман аҳсану дийнан мимман аслама важҳаҳу лиллаҳи ваҳува муҳсинун вайттабаааа миллата иброҳийма ҳанийфан вайттахаса аллааҳу иброҳийма халийлан
                Валиллаҳи ма фий ассамауати вама фий аларди вакана аллааҳу бикулли шайин муҳийтан
                Вайастафтунака фий аннисай қули аллааҳу йуфтийкум фийҳинна вама йутла ааалайкум фий алкитаби фий йатама аннисай аллатий ла тутунаҳунна ма кутиба лаҳунна ватарғабуна ан танкиҳуҳунна ваалмустадааафийна мина алвилдани ваан тақуму лилйатама биалқисти вама тафааалу мин хайрин файнна аллааҳа кана биҳи ааалийман
                Вайни имраатун хафат мин бааалиҳа нушузан ау иаарадан фала жунаҳа ааалайҳима ан йуслиҳа байнаҳума сулҳан ваалссулҳу хайрун ваоҳдирати аланфусу ашшуҳҳа вайн туҳсину вататтақу файнна аллааҳа кана бима тааамалуна хабийран
                Валан тастатийаау ан тааадилу байна аннисай валау ҳарастум фала тамийлу кулла алмайли фатасаруҳа каалмуаааллақати вайн туслиҳу вататтақу файнна аллааҳа кана ғафуран роҳийман
                Вайн йатафаррақа йуғни аллааҳу куллан мин саааатиҳи вакана аллааҳу васиааан ҳакийман
                Валиллаҳи ма фий ассамауати вама фий аларди валақад вассайна аллазийна уту алкитаба мин қабликум вайййакум ани иттақу аллааҳа вайн такфуру файнна лиллаҳи ма фий ассамауати вама фий аларди вакана аллааҳу ғаниййан ҳамийдан
                Валиллаҳи ма фий ассамауати вама фий аларди вакафа биаллааҳи вакийлан
                Ин йаша йусҳибкум аййуҳа аннасу вайати биахарийна вакана аллааҳу ааала салика қадийран
                Ман кана йурийду сауаба аддунйа фааайнда аллааҳи сауабу аддунйа ваалахирати вакана аллааҳу самийааан басийран
                Йа аййуҳа аллазийна аману куну қаувамийна биалқисти шуҳадаа лиллаҳи валау ааала анфусикум ауи алвалидайни ваалақробийна ин йакун ғаниййан ау фақийран фааллааҳу аула биҳима фала таттабиаау алҳауа ан тааадилу вайн талву ау туаариду файнна аллааҳа кана бима тааамалуна хабийран
                Йа аййуҳа аллазийна аману амину биаллааҳи варасулиҳи ваалкитаби аллазий наззала ааала расулиҳи ваалкитаби аллазий анзала мин қаблу ваман йакфур биаллааҳи вамалайкатиҳи вакутубиҳи варусулиҳи ваалйауми алахири фақад далла далалан баааийдан
                Инна аллазийна аману сумма кафару сумма аману сумма кафару сумма издаду куфран лам йакуни аллааҳу лийағфира лаҳум вала лийаҳдийаҳум сабийлан
                Башшири алмунафиқийна бианна лаҳум ааасабан алийман
                Аллазийна йаттахисуна алкафирийна аулийаа мин дуни алмуминийна айабтағуна ааиндаҳуму алааиззата файнна алааиззата лиллаҳи жамийааан
                Вақад наззала ааалайкум фий алкитаби ан иса самиаатум айати аллааҳи йукфару биҳа вайустаҳзао биҳа фала тақаауду мааааҳум ҳатта йахуду фий ҳадийсин ғайриҳи иннакум исан мислуҳум инна аллааҳа жамиаау алмунафиқийна ваалкафирийна фий жаҳаннама жамийааан
                Аллазийна йатароббасуна бикум файн кана лакум фасун мина аллааҳи қалу алам накун маааакум вайн кана лилкафирийна насийбун қалу алам настаҳвис ааалайкум ванамнааакум мина алмуминийна фааллааҳу йаҳкуму байнакум йаума алқийамати валан йажааала аллааҳу лилкафирийна ааала алмуминийна сабийлан
                Инна алмунафиқийна йухадиаауна аллааҳа ваҳува хадиаауҳум вайса қаму ила ассалати қаму кусала йурауна аннаса вала йаскуруна аллааҳа илла қалийлан
                Мусабсабийна байна салика ла ила ҳаолай вала ила ҳаолай ваман йудлили аллааҳу фалан тажида лаҳу сабийлан
                Йа аййуҳа аллазийна аману ла таттахису алкафирийна аулийаа мин дуни алмуминийна атурийдуна ан тажааалу лиллаҳи ааалайкум султанан мубийнан
                Инна алмунафиқийна фий аддарки аласфали мина аннари валан тажида лаҳум насийран
                Илла аллазийна табу вааслаҳу вайаатасаму биаллааҳи ваахласу дийнаҳум лиллаҳи фаолайка маааа алмуминийна васауфа йути аллааҳу алмуминийна ажран ааасийман
                Ма йафааалу аллааҳу биааасабикум ин шакартум ваамантум вакана аллааҳу шакиран ааалийман
                Ла йуҳиббу аллааҳу алжаҳра биалссуи мина алқаули илла ман сулима вакана аллааҳу самийааан ааалийман
                Ин тубду хайран ау тухфуҳу ау тааафу ааан суин файнна аллааҳа кана ааафувван қадийран
                Инна аллазийна йакфуруна биаллааҳи варусулиҳи вайурийдуна ан йуфарриқу байна аллааҳи варусулиҳи вайақулуна нумину бибааадин ванакфуру бибааадин вайурийдуна ан йаттахису байна салика сабийлан
                Олайка ҳуму алкафируна ҳаққан ваааатадна лилкафирийна ааасабан муҳийнан
                Вааллазийна аману биаллааҳи варусулиҳи валам йуфарриқу байна аҳадин минҳум олайка сауфа йутийҳим ожуроҳум вакана аллааҳу ғафуран роҳийман
                Йасалука аҳлу алкитаби ан туназзила ааалайҳим китабан мина ассамай фақад саалу муса акбара мин салика фақалу арина аллааҳа жаҳратан фаахасасуму ассааайқату бисулмиҳим сумма иттахасу алааижла мин бааади ма жаасуму албаййинату фаааафауна ааан салика ваатайна муса султанан мубийнан
                Варафааана фауқаҳуму аттура бимийсақиҳим вақулна лаҳуму одхулу албаба сужжадан вақулна лаҳум ла таааду фий ассабти ваахасна минҳум мийсақан ғалийсан
                Фабима нақдиҳим мийсақаҳум вакуфриҳим биайати аллааҳи вақатлиҳиму аланбийаа биғайри ҳаққин вақаулиҳим қулубуна ғулфун бал табаааа аллааҳу ааалайҳа бикуфриҳим фала йуминуна илла қалийлан
                Вабикуфриҳим вақаулиҳим ааала марйама буҳтанан ааасийман
                Вақаулиҳим инна қатална алмасийҳа ааийса ибна марйама расула аллааҳи вама қаталуҳу вама салабуҳу валакин шуббиҳа лаҳум вайнна аллазийна ихталафу фийҳи лафий шаккин минҳу ма лаҳум биҳи мин ааилмин илла иттибаааа ассанни вама қаталуҳу йақийнан
                Бал рафааааҳу аллааҳу илайҳи вакана аллааҳу ааазийзан ҳакийман
                Вайн мин аҳли алкитаби илла лайуминанна биҳи қабла маутиҳи вайаума алқийамати йакуну ааалайҳим шаҳийдан
                Фабисулмин мина аллазийна ҳаду ҳаррамна ааалайҳим таййибатин оҳиллат лаҳум вабисаддиҳим ааан сабийли аллааҳи касийран
                Ваахсиҳиму арриба вақад нуҳу ааанҳу вааклиҳим амвала аннаси биалбатили ваааатадна лилкафирийна минҳум ааасабан алийман
                Лакини аррасихуна фий алааилми минҳум ваалмуминуна йуминуна бима онзила илайка вама онзила мин қаблика ваалмуқиймийна ассалата ваалмутуна аззаката ваалмуминуна биаллааҳи ваалйауми алахири олайка санутийҳим ажран ааасийман
                Инна ауҳайна илайка кама ауҳайна ила нуҳин ваалннабиййийна мин бааадиҳи ваавҳайна ила иброҳийма вайсмаааийла вайшақа вайааақуба вааласбати ваааийса вааййуба вайунуса ваҳаруна васулаймана ваатайна даууда забуран
                Варусулан қад қасаснаҳум ааалайка мин қаблу варусулан лам нақсушум ааалайка вакаллама аллааҳу муса таклийман
                Русулан мубашширийна вамунсирийна лиалла йакуна лилннаси ааала аллааҳи ҳужжатун бааада аррусули вакана аллааҳу ааазийзан ҳакийман
                Лакини аллааҳу йашҳаду бима анзала илайка анзалаҳу биааилмиҳи ваалмалайкату йашҳадуна вакафа биаллааҳи шаҳийдан
                Инна аллазийна кафару васадду ааан сабийли аллааҳи қад даллу далалан баааийдан
                Инна аллазийна кафару васаламу лам йакуни аллааҳу лийағфира лаҳум вала лийаҳдийаҳум тарийқан
                Илла тарийқа жаҳаннама халидийна фийҳа абадан вакана салика ааала аллааҳи йасийран
                Йа аййуҳа аннасу қад жаакуму аррасулу биалҳаққи мин роббикум фаамину хайран лакум вайн такфуру файнна лиллаҳи ма фий ассамауати вааларди вакана аллааҳу ааалийман ҳакийман
                Йа аҳла алкитаби ла тағлу фий дийникум вала тақулу ааала аллааҳи илла алҳаққа иннама алмасийҳу ааийса ибну марйама расулу аллааҳи вакалиматуҳу алқаҳа ила марйама варуҳун минҳу фаамину биаллааҳи варусулиҳи вала тақулу саласатун интаҳу хайран лакум иннама аллааҳу илаҳун ваҳидун субҳанаҳу ан йакуна лаҳу валадун лаҳу ма фий ассамауати вама фий аларди вакафа биаллааҳи вакийлан
                Лан йастанкифа алмасийҳу ан йакуна ааабдан лиллаҳи вала алмалайкату алмуқарробуна ваман йастанкиф ааан ааибадатиҳи вайастакбир фасайаҳшуруҳум илайҳи жамийааан
                Фаамма аллазийна аману ваааамилу ассалиҳати файуваффийҳим ожуроҳум вайазийдуҳум мин фадлиҳи ваамма аллазийна истанкафу вайстакбару файуааассибуҳум ааасабан алийман вала йажидуна лаҳум мин дуни аллааҳи валиййан вала насийран
                Йа аййуҳа аннасу қад жаакум бурҳанун мин роббикум ваанзална илайкум нуран мубийнан
                Фаамма аллазийна аману биаллааҳи вайаатасаму биҳи фасайудхилуҳум фий роҳматин минҳу вафадлин вайаҳдийҳим илайҳи сиратан мустақийман
                Йастафтунака қули аллааҳу йуфтийкум фий алкалалати ини имруон ҳалака лайса лаҳу валадун валаҳу охтун фалаҳа нисфу ма тарака ваҳува йарисуҳа ин лам йакун лаҳа валадун файн каната иснатайни фалаҳума ассулусани мимма тарака вайн кану ихватан рижалан ванисаан фалилссакари мислу ҳасси алонсайайни йубаййину аллааҳу лакум ан тадиллу вааллааҳу бикулли шайин ааалиймун
            """.trimIndent(),
        ),
        Surah(
            id = 5,
            arabicName = "المائدة",
            latinName = "Al-Ma'idah",
            transliteration = """
                Йа аййуҳа аллазийна аману ауфу биалаауқуди оҳиллат лакум баҳиймату аланааами илла ма йутла ааалайкум ғайра муҳиллий ассайди ваантум ҳурумун инна аллааҳа йаҳкуму ма йурийду
                Йа аййуҳа аллазийна аману ла туҳиллу шааааира аллааҳи вала ашшаҳра алҳарама вала алҳадйа вала алқалайда вала аммийна албайта алҳарама йабтағуна фадлан мин роббиҳим варидванан вайса ҳалалтум файстаду вала йажриманнакум шанаану қаумин ан саддукум ааани алмасжиди алҳарами ан тааатаду ватаааавану ааала албирри ваалттақва вала таааавану ааала алисми ваалааудвани вайттақу аллааҳа инна аллааҳа шадийду алааиқаби
                Ҳурримат ааалайкуму алмайтату ваалддаму валаҳму алхинзийри вама оҳилла лиғайри аллааҳи биҳи ваалмунханиқату ваалмауқусату ваалмутараддийату ваалннатийҳату вама акала ассабуаау илла ма саккайтум вама субиҳа ааала аннусуби ваан тастақсиму биалазлами саликум фисқун алйаума йайса аллазийна кафару мин дийникум фала тахшауҳум вайхшауни алйаума акмалту лакум дийнакум ваатмамту ааалайкум ниааматий варадийту лакуму алислама дийнан фамани идтурра фий махмасатин ғайра мутажанифин лийсмин файнна аллааҳа ғафурун роҳиймун
                Йасалунака маса оҳилла лаҳум қул оҳилла лакуму аттаййибату вама ааалламтум мина алжауариҳи мукаллибийна туаааллимунаҳунна мимма ааалламакуму аллааҳу факулу мимма амсакна ааалайкум ваоскуру исма аллааҳи ааалайҳи вайттақу аллааҳа инна аллааҳа сарийаау алҳисаби
                Алйаума оҳилла лакуму аттаййибату ватааааму аллазийна уту алкитаба ҳиллун лакум ватаааамукум ҳиллун лаҳум ваалмуҳсанату мина алмуминати ваалмуҳсанату мина аллазийна уту алкитаба мин қабликум иса атайтумуҳунна ожуроҳунна муҳсинийна ғайра мусафиҳийна вала муттахисий ахданин ваман йакфур биалиймани фақад ҳабита ааамалуҳу ваҳува фий алахирати мина алхасирийна
                Йа аййуҳа аллазийна аману иса қумтум ила ассалати файғсилу вужуҳакум ваайдийакум ила алмарафиқи ваймсаҳу бируусикум вааржулакум ила алкааабайни вайн кунтум жунубан файттаҳҳару вайн кунтум марда ау ааала сафарин ау жаа аҳадун минкум мина алғайти ау ламастуму аннисаа фалам тажиду маан фатайаммаму саааийдан таййибан файмсаҳу бивужуҳикум ваайдийкум минҳу ма йурийду аллааҳу лийажааала ааалайкум мин ҳаражин валакин йурийду лийутаҳҳиракум валийутимма ниааматаҳу ааалайкум лааааллакум ташкуруна
                Ваоскуру ниаамата аллааҳи ааалайкум вамийсақаҳу аллазий васақакум биҳи ис қултум самиаана ваатааана вайттақу аллааҳа инна аллааҳа ааалиймун бисати ассудури
                Йа аййуҳа аллазийна аману куну қаувамийна лиллаҳи шуҳадаа биалқисти вала йажриманнакум шанаану қаумин ааала алла тааадилу иаадилу ҳува ақробу лилттақва вайттақу аллааҳа инна аллааҳа хабийрун бима тааамалуна
                Ваааада аллааҳу аллазийна аману ваааамилу ассалиҳати лаҳум мағфиратун ваажрун ааасиймун
                Вааллазийна кафару вакассабу биайатина олайка ашабу алжаҳийми
                Йа аййуҳа аллазийна аману оскуру ниаамата аллааҳи ааалайкум ис ҳамма қаумун ан йабсуту илайкум айдийаҳум факаффа айдийаҳум ааанкум вайттақу аллааҳа ваааала аллааҳи фалйатауаккали алмуминуна
                Валақад ахаса аллааҳу мийсақа баний исраийла вабаааасна минҳуму иснай ааашара нақийбан вақала аллааҳу инний маааакум лайн ақамтуму ассалата ваатайтуму аззаката ваамантум бирусулий вааааззартумуҳум ваақрадтуму аллааҳа қардан ҳасанан лаокаффиранна ааанкум саййиатикум валаодхиланнакум жаннатин тажрий мин таҳтиҳа аланҳару фаман кафара бааада салика минкум фақад далла сауаа ассабийли
                Фабима нақдиҳим мийсақаҳум лааааннаҳум важаааална қулубаҳум қасийатан йуҳаррифуна алкалима ааан мауадиааиҳи ванасу ҳассан мимма суккиру биҳи вала тазалу татталиаау ааала хайнатин минҳум илла қалийлан минҳум фаоаафу ааанҳум вайсфаҳ инна аллааҳа йуҳиббу алмуҳсинийна
                Вамина аллазийна қалу инна насара ахасна мийсақаҳум фанасу ҳассан мимма суккиру биҳи фаағрайна байнаҳуму алааадауата ваалбағдаа ила йауми алқийамати васауфа йунаббиоҳуму аллааҳу бима кану йаснааауна
                Йа аҳла алкитаби қад жаакум расулуна йубаййину лакум касийран мимма кунтум тухфуна мина алкитаби вайааафу ааан касийрин қад жаакум мина аллааҳи нурун вакитабун мубийнун
                Йаҳдий биҳи аллааҳу мани иттабаааа ридванаҳу субула ассалами вайухрижуҳум мина ассулумати ила аннури бийсниҳи вайаҳдийҳим ила сиратин мустақиймин
                Лақад кафара аллазийна қалу инна аллааҳа ҳува алмасийҳу ибну марйама қул фаман йамлику мина аллааҳи шайан ин арада ан йуҳлика алмасийҳа ибна марйама ваоммаҳу ваман фий аларди жамийааан валиллаҳи мулку ассамауати вааларди вама байнаҳума йахлуқу ма йашао вааллааҳу ааала кулли шайин қадийрун
                Вақалати алйаҳуду ваалннасара наҳну абнао аллааҳи вааҳиббаоҳу қул фалима йуааассибукум бисунубикум бал антум башарун мимман халақа йағфиру лиман йашао вайуааассибу ман йашао валиллаҳи мулку ассамауати вааларди вама байнаҳума вайлайҳи алмасийру
                Йа аҳла алкитаби қад жаакум расулуна йубаййину лакум ааала фатратин мина аррусули ан тақулу ма жаана мин башийрин вала насийрин фақад жаакум башийрун ванасийрун вааллааҳу ааала кулли шайин қадийрун
                Вайс қала муса лиқаумиҳи йа қауми оскуру ниаамата аллааҳи ааалайкум ис жаааала фийкум анбийаа важаааалакум мулукан ваатакум ма лам йути аҳадан мина алаааламийна
                Йа қауми одхулу аларда алмуқаддасата аллатий катаба аллааҳу лакум вала тартадду ааала адбарикум фатанқалибу хасирийна
                Қалу йа муса инна фийҳа қауман жаббарийна вайнна лан надхулаҳа ҳатта йахружу минҳа файн йахружу минҳа файнна дахилуна
                Қала ражулани мина аллазийна йахафуна анааама аллааҳу ааалайҳима одхулу ааалайҳиму албаба файса дахалтумуҳу файннакум ғалибуна ваааала аллааҳи фатауаккалу ин кунтум муминийна
                Қалу йа муса инна лан надхулаҳа абадан ма даму фийҳа файсҳаб анта вароббука фақатила инна ҳаҳуна қааайдуна
                Қала робби инний ла амлику илла нафсий ваахий фаофруқ байнана вабайна алқауми алфасиқийна
                Қала файннаҳа муҳарраматун ааалайҳим арбаааийна санатан йатийҳуна фий аларди фала таса ааала алқауми алфасиқийна
                Ваотлу ааалайҳим набаа ибнай адама биалҳаққи ис қарроба қурбанан фатуқуббила мин аҳадиҳима валам йутақаббал мина алахари қала лаақтуланнака қала иннама йатақаббалу аллааҳу мина алмуттақийна
                Лайн басатта илаййа йадака литақтуланий ма ана бибаситин йадийа илайка лиақтулака инний ахафу аллааҳа робба алаааламийна
                Инний орийду ан табуа бийсмий вайсмика фатакуна мин ашаби аннари васалика жазао ассалимийна
                Фатауваааат лаҳу нафсуҳу қатла ахийҳи фақаталаҳу фаасбаҳа мина алхасирийна
                Фабааааса аллааҳу ғуробан йабҳасу фий аларди лийурийаҳу кайфа йуварий сауата ахийҳи қала йа вайлата аааажазту ан акуна мисла ҳаса алғуроби фаоварийа сауата ахий фаасбаҳа мина аннадимийна
                Мин ажли салика катабна ааала баний исраийла аннаҳу ман қатала нафсан биғайри нафсин ау фасадин фий аларди факааннама қатала аннаса жамийааан ваман аҳйаҳа факааннама аҳйа аннаса жамийааан валақад жаа сум русулуна биалбаййинати сумма инна касийран минҳум бааада салика фий аларди ламусрифуна
                Иннама жазао аллазийна йуҳарибуна аллааҳа варасулаҳу вайасааауна фий аларди фасадан ан йуқатталу ау йусаллабу ау туқаттаааа айдийҳим вааржулуҳум мин хилафин ау йунфау мина аларди салика лаҳум хизйун фий аддунйа валаҳум фий алахирати ааасабун ааасиймун
                Илла аллазийна табу мин қабли ан тақдиру ааалайҳим файааламу анна аллааҳа ғафурун роҳиймун
                Йа аййуҳа аллазийна аману иттақу аллааҳа вайбтағу илайҳи алвасийлата важаҳиду фий сабийлиҳи лааааллакум туфлиҳуна
                Инна аллазийна кафару лау анна лаҳум ма фий аларди жамийааан вамислаҳу мааааҳу лийафтаду биҳи мин ааасаби йауми алқийамати ма туқуббила минҳум валаҳум ааасабун алиймун
                Йурийдуна ан йахружу мина аннари вама ҳум бихарижийна минҳа валаҳум ааасабун муқиймун
                Ваалссариқу ваалссариқату файқтааау айдийаҳума жазаан бима касаба накалан мина аллааҳи вааллааҳу ааазийзун ҳакиймун
                Фаман таба мин бааади сулмиҳи вааслаҳа файнна аллааҳа йатубу ааалайҳи инна аллааҳа ғафурун роҳиймун
                Алам тааалам анна аллааҳа лаҳу мулку ассамауати вааларди йуааассибу ман йашао вайағфиру лиман йашао вааллааҳу ааала кулли шайин қадийрун
                Йа аййуҳа аррасулу ла йаҳзунка аллазийна йусариаауна фий алкуфри мина аллазийна қалу аманна биафваҳиҳим валам тумин қулубуҳум вамина аллазийна ҳаду саммааауна лилкасиби саммааауна лиқаумин ахарийна лам йатука йуҳаррифуна алкалима мин бааади мауадиааиҳи йақулуна ин утийтум ҳаса фахусуҳу вайн лам тутауҳу файҳсару ваман йуриди аллааҳу фитнатаҳу фалан тамлика лаҳу мина аллааҳи шайан олайка аллазийна лам йуриди аллааҳу ан йутаҳҳира қулубаҳум лаҳум фий аддунйа хизйун валаҳум фий алахирати ааасабун ааасиймун
                Саммааауна лилкасиби аккалуна лилссуҳти файн жаука фаоҳкум байнаҳум ау ааарид ааанҳум вайн туаарид ааанҳум фалан йадуррука шайан вайн ҳакамта фаоҳкум байнаҳум биалқисти инна аллааҳа йуҳиббу алмуқситийна
                Вакайфа йуҳаккимунака вааайндаҳуму аттаурату фийҳа ҳукму аллааҳи сумма йатауаллауна мин бааади салика вама олайка биалмуминийна
                Инна анзална аттаурата фийҳа ҳудан ванурун йаҳкуму биҳа аннабиййуна аллазийна асламу лиллазийна ҳаду ваалрроббаниййуна ваалаҳбару бима истуҳфису мин китаби аллааҳи вакану ааалайҳи шуҳадаа фала тахшауу аннаса вайхшауни вала таштару биайатий саманан қалийлан ваман лам йаҳкум бима анзала аллааҳу фаолайка ҳуму алкафируна
                Вакатабна ааалайҳим фийҳа анна аннафса биалннафси ваалааайна биалааайни вааланфа биаланфи ваалосуна биалосуни ваалссинна биалссинни ваалжуруҳа қисасун фаман тасаддақа биҳи фаҳува каффаратун лаҳу ваман лам йаҳкум бима анзала аллааҳу фаолайка ҳуму ассалимуна
                Вақаффайна ааала асариҳим биааийса ибни марйама мусаддиқан лима байна йадайҳи мина аттаурати ваатайнаҳу алинжийла фийҳи ҳудан ванурун вамусаддиқан лима байна йадайҳи мина аттаурати ваҳудан вамауааисатан лилмуттақийна
                Валйаҳкум аҳлу алинжийли бима анзала аллааҳу фийҳи ваман лам йаҳкум бима анзала аллааҳу фаолайка ҳуму алфасиқуна
                Ваанзална илайка алкитаба биалҳаққи мусаддиқан лима байна йадайҳи мина алкитаби вамуҳайминан ааалайҳи фаоҳкум байнаҳум бима анзала аллааҳу вала таттабиаа аҳвааҳум ааамма жаака мина алҳаққи ликуллин жаааална минкум ширааатан ваминҳажан валау шаа аллааҳу лажаааалакум омматан ваҳидатан валакин лийаблувакум фий ма атакум файстабиқу алхайрати ила аллааҳи маржиааукум жамийааан файунаббиокум бима кунтум фийҳи тахталифуна
                Ваани оҳкум байнаҳум бима анзала аллааҳу вала таттабиаа аҳвааҳум вайҳсарҳум ан йафтинука ааан бааади ма анзала аллааҳу илайка файн тауаллау файаалам аннама йурийду аллааҳу ан йусийбаҳум бибааади сунубиҳим вайнна касийран мина аннаси лафасиқуна
                Афаҳукма алжаҳилиййати йабғуна ваман аҳсану мина аллааҳу ҳукман лиқаумин йуқинуна
                Йа аййуҳа аллазийна аману ла таттахису алйаҳуда ваалннасара аулийаа бааадуҳум аулийао бааадин ваман йатауаллааҳум минкум файннаҳу минҳум инна аллааҳа ла йаҳдий алқаума ассалимийна
                Фатара аллазийна фий қулубиҳим марадун йусариаауна фийҳим йақулуна нахша ан тусийбана дайратун фааааса аллааҳу ан йатийа биалфаси ау амрин мин ааиндиҳи файусбиҳу ааала ма асарру фий анфусиҳим надимийна
                Вайақулу аллазийна аману аҳаолай аллазийна ақсаму биаллааҳи жаҳда айманиҳим иннаҳум ламаааакум ҳабитат ааамалуҳум фаасбаҳу хасирийна
                Йа аййуҳа аллазийна аману ман йартадда минкум ааан дийниҳи фасауфа йатий аллааҳу биқаумин йуҳиббуҳум вайуҳиббунаҳу асиллатин ааала алмуминийна ааайззатин ааала алкафирийна йужаҳидуна фий сабийли аллааҳи вала йахафуна лаумата лаймин салика фадлу аллааҳи йутийҳи ман йашао вааллааҳу васиааун ааалиймун
                Иннама валиййукуму аллааҳу варасулуҳу вааллазийна аману аллазийна йуқиймуна ассалата вайутуна аззаката ваҳум ракиаауна
                Ваман йатауалла аллааҳа варасулаҳу вааллазийна аману файнна ҳизба аллааҳи ҳуму алғалибуна
                Йа аййуҳа аллазийна аману ла таттахису аллазийна иттахасу дийнакум ҳузуван валааайбан мина аллазийна уту алкитаба мин қабликум ваалкуффара аулийаа вайттақу аллааҳа ин кунтум муминийна
                Вайса надайтум ила ассалати иттахасуҳа ҳузуван валааайбан салика бианнаҳум қаумун ла йааақилуна
                Қул йа аҳла алкитаби ҳал танқимуна минна илла ан аманна биаллааҳи вама онзила илайна вама онзила мин қаблу ваанна аксаракум фасиқуна
                Қул ҳал онаббиокум бишаррин мин салика масубатан ааинда аллааҳи ман лаааанаҳу аллааҳу вағадиба ааалайҳи важаааала минҳуму алқирадата ваалханазийра ваааабада аттағути олайка шаррун маканан ваадаллу ааан сауай ассабийли
                Вайса жаукум қалу аманна вақад дахалу биалкуфри ваҳум қад харажу биҳи вааллааҳу аааламу бима кану йактумуна
                Ватара касийран минҳум йусариаауна фий алисми ваалааудвани вааклиҳиму ассуҳта лабиса ма кану йааамалуна
                Лаула йанҳаҳуму арроббаниййуна ваалаҳбару ааан қаулиҳиму алисма вааклиҳиму ассуҳта лабиса ма кану йаснааауна
                Вақалати алйаҳуду йаду аллааҳи мағлулатун ғуллат айдийҳим валуааину бима қалу бал йадаҳу мабсутатани йунфиқу кайфа йашао валайазийданна касийран минҳум ма онзила илайка мин роббика туғйанан вакуфран ваалқайна байнаҳуму алааадауата ваалбағдаа ила йауми алқийамати куллама ауқаду наран лилҳарби атфааҳа аллааҳу вайасааауна фий аларди фасадан вааллааҳу ла йуҳиббу алмуфсидийна
                Валау анна аҳла алкитаби аману вайттақау лакаффарна ааанҳум саййиатиҳим валаадхалнаҳум жаннати аннаааийми
                Валау аннаҳум ақаму аттаурата ваалинжийла вама онзила илайҳим мин роббиҳим лаакалу мин фауқиҳим вамин таҳти аржулиҳим минҳум омматун муқтасидатун вакасийрун минҳум саа ма йааамалуна
                Йа аййуҳа аррасулу баллиғ ма онзила илайка мин роббика вайн лам тафааал фама баллағта рисалатаҳу вааллааҳу йааасимука мина аннаси инна аллааҳа ла йаҳдий алқаума алкафирийна
                Қул йа аҳла алкитаби ластум ааала шайин ҳатта туқийму аттаурата ваалинжийла вама онзила илайкум мин роббикум валайазийданна касийран минҳум ма онзила илайка мин роббика туғйанан вакуфран фала таса ааала алқауми алкафирийна
                Инна аллазийна аману вааллазийна ҳаду ваалссабиуна ваалннасара ман амана биаллааҳи ваалйауми алахири ваааамила салиҳан фала хауфун ааалайҳим вала ҳум йаҳзануна
                Лақад ахасна мийсақа баний исраийла ваарсална илайҳим русулан куллама жааҳум расулун бима ла таҳва анфусуҳум фарийқан кассабу вафарийқан йақтулуна
                Ваҳасибу алла такуна фитнатун фааааму васамму сумма таба аллааҳу ааалайҳим сумма аааму васамму касийрун минҳум вааллааҳу басийрун бима йааамалуна
                Лақад кафара аллазийна қалу инна аллааҳа ҳува алмасийҳу ибну марйама вақала алмасийҳу йа баний исраийла оаабуду аллааҳа роббий вароббакум иннаҳу ман йушрик биаллааҳи фақад ҳаррама аллааҳу ааалайҳи алжанната вамауаҳу аннару вама лилссалимийна мин ансарин
                Лақад кафара аллазийна қалу инна аллааҳа салису саласатин вама мин илаҳин илла илаҳун ваҳидун вайн лам йантаҳу ааамма йақулуна лайамассанна аллазийна кафару минҳум ааасабун алиймун
                Афала йатубуна ила аллааҳи вайастағфирунаҳу вааллааҳу ғафурун роҳиймун
                Ма алмасийҳу ибну марйама илла расулун қад халат мин қаблиҳи аррусулу ваоммуҳу сиддийқатун кана йакулани аттаааама онсур кайфа нубаййину лаҳуму алайати сумма онсур анна йуфакуна
                Қул атааабудуна мин дуни аллааҳи ма ла йамлику лакум дарран вала нафааан вааллааҳу ҳува ассамийаау алааалийму
                Қул йа аҳла алкитаби ла тағлу фий дийникум ғайра алҳаққи вала таттабиаау аҳваа қаумин қад даллу мин қаблу ваадаллу касийран вадаллу ааан сауай ассабийли
                Луааина аллазийна кафару мин баний исраийла ааала лисани даууда ваааийса ибни марйама салика бима ааасау вакану йааатадуна
                Кану ла йатанаҳауна ааан мункарин фаааалуҳу лабиса ма кану йафааалуна
                Тара касийран минҳум йатауаллауна аллазийна кафару лабиса ма қаддамат лаҳум анфусуҳум ан сахита аллааҳу ааалайҳим вафий алааасаби ҳум халидуна
                Валау кану йуминуна биаллааҳи ваалннабиййи вама онзила илайҳи ма иттахасуҳум аулийаа валакинна касийран минҳум фасиқуна
                Латажиданна ашадда аннаси ааадауатан лиллазийна аману алйаҳуда вааллазийна ашраку валатажиданна ақробаҳум мауаддатан лиллазийна аману аллазийна қалу инна насара салика бианна минҳум қиссийсийна варуҳбанан вааннаҳум ла йастакбируна
                Вайса самиаау ма онзила ила аррасули тара ааайунаҳум тафийду мина аддамааи мимма ааарафу мина алҳаққи йақулуна роббана аманна фаоктубна маааа ашшаҳидийна
                Вама лана ла нумину биаллааҳи вама жаана мина алҳаққи ванатмааау ан йудхилана роббуна маааа алқауми ассалиҳийна
                Фаасабаҳуму аллааҳу бима қалу жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа васалика жазао алмуҳсинийна
                Вааллазийна кафару вакассабу биайатина олайка ашабу алжаҳийми
                Йа аййуҳа аллазийна аману ла туҳарриму таййибати ма аҳалла аллааҳу лакум вала тааатаду инна аллааҳа ла йуҳиббу алмуаатадийна
                Вакулу мимма разақакуму аллааҳу ҳалалан таййибан вайттақу аллааҳа аллазий антум биҳи муминуна
                Ла йуахисукуму аллааҳу биаллағви фий айманикум валакин йуахисукум бима аааққадтуму алаймана факаффаратуҳу итаааму ааашарати масакийна мин аусати ма тутааимуна аҳлийкум ау кисватуҳум ау таҳрийру рақабатин фаман лам йажид фасийаму саласати аййамин салика каффарату айманикум иса ҳалафтум вайҳфасу айманакум касалика йубаййину аллааҳу лакум айатиҳи лааааллакум ташкуруна
                Йа аййуҳа аллазийна аману иннама алхамру ваалмайсиру ваалансабу ваалазламу рижсун мин ааамали ашшайтани файжтанибуҳу лааааллакум туфлиҳуна
                Иннама йурийду ашшайтану ан йуқиааа байнакуму алааадауата ваалбағдаа фий алхамри ваалмайсири вайасуддакум ааан сикри аллааҳи ваааани ассалати фаҳал антум мунтаҳуна
                Ваатийаау аллааҳа ваатийаау аррасула вайҳсару файн тауаллайтум файааламу аннама ааала расулина албалағу алмубийну
                Лайса ааала аллазийна аману ваааамилу ассалиҳати жунаҳун фийма тааайму иса ма иттақау вааману ваааамилу ассалиҳати сумма иттақау вааману сумма иттақау вааҳсану вааллааҳу йуҳиббу алмуҳсинийна
                Йа аййуҳа аллазийна аману лайаблуваннакуму аллааҳу бишайин мина ассайди таналуҳу айдийкум варимаҳукум лийааалама аллааҳу ман йахафуҳу биалғайби фамани иаатада бааада салика фалаҳу ааасабун алиймун
                Йа аййуҳа аллазийна аману ла тақтулу ассайда ваантум ҳурумун ваман қаталаҳу минкум мутааааммидан фажазаон мислу ма қатала мина аннаааами йаҳкуму биҳи сауа ааадлин минкум ҳадйан балиға алкааабати ау каффаратун тааааму масакийна ау ааадлу салика сийаман лийасуқа вабала амриҳи ааафа аллааҳу ааамма салафа ваман ааада файантақиму аллааҳу минҳу вааллааҳу ааазийзун су интиқамин
                Оҳилла лакум сайду албаҳри ватаааамуҳу матаааан лакум валилссаййарати ваҳуррима ааалайкум сайду албарри ма думтум ҳуруман вайттақу аллааҳа аллазий илайҳи туҳшаруна
                Жаааала аллааҳу алкааабата албайта алҳарама қийаман лилннаси ваалшшаҳра алҳарама ваалҳадйа ваалқалайда салика литаааламу анна аллааҳа йаааламу ма фий ассамауати вама фий аларди ваанна аллааҳа бикулли шайин ааалиймун
                Иааламу анна аллааҳа шадийду алааиқаби ваанна аллааҳа ғафурун роҳиймун
                Ма ааала аррасули илла албалағу вааллааҳу йаааламу ма тубдуна вама тактумуна
                Қул ла йастауий алхабийсу ваалттаййибу валау ааажабака касрату алхабийси файттақу аллааҳа йа олий алалбаби лааааллакум туфлиҳуна
                Йа аййуҳа аллазийна аману ла тасалу ааан ашйаа ин тубда лакум тасукум вайн тасалу ааанҳа ҳийна йуназзалу алқурану тубда лакум ааафа аллааҳу ааанҳа вааллааҳу ғафурун ҳалиймун
                Қад саалаҳа қаумун мин қабликум сумма асбаҳу биҳа кафирийна
                Ма жаааала аллааҳу мин баҳийратин вала сайбатин вала васийлатин вала ҳамин валакинна аллазийна кафару йафтаруна ааала аллааҳи алкасиба вааксаруҳум ла йааақилуна
                Вайса қийла лаҳум таааалау ила ма анзала аллааҳу вайла аррасули қалу ҳасбуна ма важадна ааалайҳи абаана ауалау кана абаоҳум ла йаааламуна шайан вала йаҳтадуна
                Йа аййуҳа аллазийна аману ааалайкум анфусакум ла йадуррукум ман далла иса иҳтадайтум ила аллааҳи маржиааукум жамийааан файунаббиокум бима кунтум тааамалуна
                Йа аййуҳа аллазийна аману шаҳадату байникум иса ҳадара аҳадакуму алмауту ҳийна алвасиййати иснани сауа ааадлин минкум ау ахарани мин ғайрикум ин антум даробтум фий аларди фаасабаткум мусийбату алмаути таҳбисунаҳума мин бааади ассалати файуқсимани биаллааҳи ини иртабтум ла наштарий биҳи саманан валау кана са қурба вала нактуму шаҳадата аллааҳи инна исан ламина аласимийна
                Файн ааусира ааала аннаҳума истаҳаққа исман фаахарани йақумани мақамаҳума мина аллазийна истаҳаққа ааалайҳиму алаулайани файуқсимани биаллааҳи лашаҳадатуна аҳаққу мин шаҳадатиҳима вама иаатадайна инна исан ламина ассалимийна
                Салика адна ан йату биалшшаҳадати ааала важҳиҳа ау йахафу ан турадда айманун бааада айманиҳим вайттақу аллааҳа вайсмааау вааллааҳу ла йаҳдий алқаума алфасиқийна
                Йаума йажмааау аллааҳу аррусула файақулу маса ожибтум қалу ла ааилма лана иннака анта ааалламу алғуйуби
                Ис қала аллааҳу йа ааийса ибна марйама оскур ниааматий ааалайка ваааала валидатика ис аййадтука бируҳи алқудуси тукаллиму аннаса фий алмаҳди вакаҳлан вайс ааалламтука алкитаба ваалҳикмата ваалттаурата ваалинжийла вайс тахлуқу мина аттийни каҳайати аттайри бийсний фатанфуху фийҳа фатакуну тайран бийсний ватубрио алакмаҳа ваалабраса бийсний вайс тухрижу алмаута бийсний вайс кафафту баний исраийла ааанка ис житаҳум биалбаййинати фақала аллазийна кафару минҳум ин ҳаса илла сиҳрун мубийнун
                Вайс ауҳайту ила алҳауариййийна ан амину бий вабирасулий қалу аманна вайшҳад бианнана муслимуна
                Ис қала алҳауариййуна йа ааийса ибна марйама ҳал йастатийаау роббука ан йуназзила ааалайна майдатан мина ассамай қала иттақу аллааҳа ин кунтум муминийна
                Қалу нурийду ан накула минҳа вататмайнна қулубуна ванааалама ан қад садақтана ванакуна ааалайҳа мина ашшаҳидийна
                Қала ааийса ибну марйама аллааҳумма роббана анзил ааалайна майдатан мина ассамай такуну лана ааийдан лиаувалина ваахирина ваайатан минка ваорзуқна ваанта хайру арразиқийна
                Қала аллааҳу инний муназзилуҳа ааалайкум фаман йакфур баааду минкум файнний оааассибуҳу ааасабан ла оааассибуҳу аҳадан мина алаааламийна
                Вайс қала аллааҳу йа ааийса ибна марйама аанта қулта лилннаси иттахисуний ваоммийа илаҳайни мин дуни аллааҳи қала субҳанака ма йакуну лий ан ақула ма лайса лий биҳаққин ин кунту қултуҳу фақад ааалимтаҳу таааламу ма фий нафсий вала аааламу ма фий нафсика иннака анта ааалламу алғуйуби
                Ма қулту лаҳум илла ма амартаний биҳи ани оаабуду аллааҳа роббий вароббакум вакунту ааалайҳим шаҳийдан ма думту фийҳим фаламма тауаффайтаний кунта анта аррақийба ааалайҳим ваанта ааала кулли шайин шаҳийдун
                Ин туааассибҳум файннаҳум ааибадука вайн тағфир лаҳум файннака анта алааазийзу алҳакийму
                Қала аллааҳу ҳаса йауму йанфааау ассадиқийна сидқуҳум лаҳум жаннатун тажрий мин таҳтиҳа аланҳару халидийна фийҳа абадан радийа аллааҳу ааанҳум вараду ааанҳу салика алфаузу алааасийму
                Лиллаҳи мулку ассамауати вааларди вама фийҳинна ваҳува ааала кулли шайин қадийрун
            """.trimIndent(),
        ),
        Surah(
            id = 6,
            arabicName = "الأنعام",
            latinName = "Al-An'am",
            transliteration = """
                Алҳамду лиллаҳи аллазий халақа ассамауати вааларда важаааала ассулумати ваалннура сумма аллазийна кафару бироббиҳим йааадилуна
                Ҳува аллазий халақакум мин тийнин сумма қада ажалан ваажалун мусамман ааиндаҳу сумма антум тамтаруна
                Ваҳува аллааҳу фий ассамауати вафий аларди йаааламу сирракум важаҳракум вайаааламу ма таксибуна
                Вама татийҳим мин айатин мин айати роббиҳим илла кану ааанҳа муааридийна
                Фақад кассабу биалҳаққи ламма жааҳум фасауфа йатийҳим анбао ма кану биҳи йастаҳзиуна
                Алам йарау кам аҳлакна мин қаблиҳим мин қарнин макканнаҳум фий аларди ма лам нумаккин лакум ваарсална ассамаа ааалайҳим мидраран важаааална аланҳара тажрий мин таҳтиҳим фааҳлакнаҳум бисунубиҳим вааншана мин бааадиҳим қарнан ахарийна
                Валау наззална ааалайка китабан фий қиртасин фаламасуҳу биайдийҳим лақала аллазийна кафару ин ҳаса илла сиҳрун мубийнун
                Вақалу лаула онзила ааалайҳи малакун валау анзална малакан лақудийа аламру сумма ла йунсаруна
                Валау жаааалнаҳу малакан лажаааалнаҳу ражулан валалабасна ааалайҳим ма йалбисуна
                Валақади истуҳзиа бирусулин мин қаблика фаҳақа биаллазийна сахиру минҳум ма кану биҳи йастаҳзиуна
                Қул сийру фий аларди сумма онсуру кайфа кана ааақибату алмукассибийна
                Қул лиман ма фий ассамауати вааларди қул лиллаҳи катаба ааала нафсиҳи арроҳмата лайажмааааннакум ила йауми алқийамати ла райба фийҳи аллазийна хасиру анфусаҳум фаҳум ла йуминуна
                Валаҳу ма сакана фий аллайли ваалннаҳари ваҳува ассамийаау алааалийму
                Қул ағайра аллааҳи аттахису валиййан фатири ассамауати вааларди ваҳува йутааиму вала йутаааму қул инний омирту ан акуна аувала ман аслама вала такунанна мина алмушрикийна
                Қул инний ахафу ин ааасайту роббий ааасаба йаумин ааасиймин
                Ман йусраф ааанҳу йаумайсин фақад роҳимаҳу васалика алфаузу алмубийну
                Вайн йамсаска аллааҳу бидуррин фала кашифа лаҳу илла ҳува вайн йамсаска бихайрин фаҳува ааала кулли шайин қадийрун
                Ваҳува алқаҳиру фауқа ааибадиҳи ваҳува алҳакийму алхабийру
                Қул аййу шайин акбару шаҳадатан қули аллааҳу шаҳийдун байний вабайнакум вауҳийа илаййа ҳаса алқурану лионсиракум биҳи ваман балаға айннакум латашҳадуна анна маааа аллааҳи алиҳатан охра қул ла ашҳаду қул иннама ҳува илаҳун ваҳидун вайннаний барийон мимма тушрикуна
                Аллазийна атайнаҳуму алкитаба йааарифунаҳу кама йааарифуна абнааҳум аллазийна хасиру анфусаҳум фаҳум ла йуминуна
                Ваман асламу миммани ифтара ааала аллааҳи касибан ау кассаба биайатиҳи иннаҳу ла йуфлиҳу ассалимуна
                Вайаума наҳшуруҳум жамийааан сумма нақулу лиллазийна ашраку айна шуракаокуму аллазийна кунтум тазааумуна
                Сумма лам такун фитнатуҳум илла ан қалу вааллааҳи роббина ма кунна мушрикийна
                Онсур кайфа касабу ааала анфусиҳим вадалла ааанҳум ма кану йафтаруна
                Ваминҳум ман йастамиаау илайка важаааална ааала қулубиҳим акиннатан ан йафқаҳуҳу вафий асаниҳим вақран вайн йарау кулла айатин ла йумину биҳа ҳатта иса жаука йужадилунака йақулу аллазийна кафару ин ҳаса илла асатийру алаувалийна
                Ваҳум йанҳауна ааанҳу вайанауна ааанҳу вайн йуҳликуна илла анфусаҳум вама йашаауруна
                Валау тара ис вуқифу ааала аннари фақалу йа лайтана нурадду вала нукассиба биайати роббина ванакуна мина алмуминийна
                Бал бада лаҳум ма кану йухфуна мин қаблу валау рудду лааааду лима нуҳу ааанҳу вайннаҳум лакасибуна
                Вақалу ин ҳийа илла ҳайатуна аддунйа вама наҳну бимабааусийна
                Валау тара ис вуқифу ааала роббиҳим қала алайса ҳаса биалҳаққи қалу бала вароббина қала фасуқу алааасаба бима кунтум такфуруна
                Қад хасира аллазийна кассабу билиқай аллааҳи ҳатта иса жаасуму ассаааату бағтатан қалу йа ҳасратана ааала ма фарратна фийҳа ваҳум йаҳмилуна аузароҳум ааала суҳуриҳим ала саа ма йазируна
                Вама алҳайату аддунйа илла лааайбун валаҳвун валалддару алахирати хайрун лиллазийна йаттақуна афала тааақилуна
                Қад наааламу иннаҳу лайаҳзунука аллазий йақулуна файннаҳум ла йукассибунака валакинна ассалимийна биайати аллааҳи йажҳадуна
                Валақад куссибат русулун мин қаблика фасабару ааала ма куссибу ваусу ҳатта атаҳум насруна вала мубаддила ликалимати аллааҳи валақад жаака мин набай алмурсалийна
                Вайн кана кабура ааалайка иаарадуҳум файни истатааата ан табтағийа нафақан фий аларди ау сулламан фий ассамай фататийаҳум биайатин валау шаа аллааҳу лажамааааҳум ааала алҳуда фала такунанна мина алжаҳилийна
                Иннама йастажийбу аллазийна йасмааауна ваалмаута йабааасуҳуму аллааҳу сумма илайҳи йуржааауна
                Вақалу лаула нуззила ааалайҳи айатун мин роббиҳи қул инна аллааҳа қадирун ааала ан йуназзила айатан валакинна аксароҳум ла йаааламуна
                Вама мин даббатин фий аларди вала тайрин йатийру бижанаҳайҳи илла омамун амсалукум ма фарратна фий алкитаби мин шайин сумма ила роббиҳим йуҳшаруна
                Вааллазийна кассабу биайатина суммун вабукмун фий ассулумати ман йашай аллааҳу йудлилҳу ваман йаша йажааалҳу ааала сиратин мустақиймин
                Қул араайтакум ин атакум ааасабу аллааҳи ау ататкуму ассаааату ағайра аллааҳи тадаауна ин кунтум садиқийна
                Бал иййаҳу тадаауна файакшифу ма тадаауна илайҳи ин шаа ватансауна ма тушрикуна
                Валақад арсална ила омамин мин қаблика фаахаснаҳум биалбасай ваалддаррай лааааллааҳум йатадаррааауна
                Фалаула ис жааҳум басуна тадаррааау валакин қасат қулубуҳум вазаййана лаҳуму ашшайтану ма кану йааамалуна
                Фаламма насу ма суккиру биҳи фатаҳна ааалайҳим абваба кулли шайин ҳатта иса фариҳу бима уту ахаснаҳум бағтатан файса ҳум мублисуна
                Фақутиааа дабиру алқауми аллазийна саламу ваалҳамду лиллаҳи робби алаааламийна
                Қул араайтум ин ахаса аллааҳу самааакум ваабсаракум вахатама ааала қулубикум ман илаҳун ғайру аллааҳи йатийкум биҳи онсур кайфа нусаррифу алайати сумма ҳум йасдифуна
                Қул араайтакум ин атакум ааасабу аллааҳи бағтатан ау жаҳратан ҳал йуҳлаку илла алқауму ассалимуна
                Вама нурсилу алмурсалийна илла мубашширийна вамунсирийна фаман амана вааслаҳа фала хауфун ааалайҳим вала ҳум йаҳзануна
                Вааллазийна кассабу биайатина йамассуҳуму алааасабу бима кану йафсуқуна
                Қул ла ақулу лакум ааиндий хазайну аллааҳи вала аааламу алғайба вала ақулу лакум инний малакун ин аттабиаау илла ма йуҳа илаййа қул ҳал йастауий алааама ваалбасийру афала татафаккаруна
                Ваансир биҳи аллазийна йахафуна ан йуҳшару ила роббиҳим лайса лаҳум мин дуниҳи валиййун вала шафийааун лааааллааҳум йаттақуна
                Вала татруди аллазийна йадаауна роббаҳум биалғадати ваалааашиййи йурийдуна важҳаҳу ма ааалайка мин ҳисабиҳим мин шайин вама мин ҳисабика ааалайҳим мин шайин фататрудаҳум фатакуна мина ассалимийна
                Вакасалика фатанна бааадаҳум бибааадин лийақулу аҳаолай манна аллааҳу ааалайҳим мин байнина алайса аллааҳу биааалама биалшшакирийна
                Вайса жаака аллазийна йуминуна биайатина фақул саламун ааалайкум катаба роббукум ааала нафсиҳи арроҳмата аннаҳу ман ааамила минкум суан бижаҳалатин сумма таба мин бааадиҳи вааслаҳа фааннаҳу ғафурун роҳиймун
                Вакасалика нуфассилу алайати валитастабийна сабийлу алмужримийна
                Қул инний нуҳийту ан ааабуда аллазийна тадаауна мин дуни аллааҳи қул ла аттабиаау аҳваакум қад далалту исан вама ана мина алмуҳтадийна
                Қул инний ааала баййинатин мин роббий вакассабтум биҳи ма ааиндий ма тастааажилуна биҳи ини алҳукму илла лиллаҳи йақуссу алҳаққа ваҳува хайру алфасилийна
                Қул лау анна ааиндий ма тастааажилуна биҳи лақудийа аламру байний вабайнакум вааллааҳу аааламу биалссалимийна
                Вааайндаҳу мафатиҳу алғайби ла йаааламуҳа илла ҳува вайаааламу ма фий албарри ваалбаҳри вама тасқуту мин варақатин илла йаааламуҳа вала ҳаббатин фий сулумати аларди вала ратбин вала йабисин илла фий китабин мубийнин
                Ваҳува аллазий йатауаффакум биаллайли вайаааламу ма жароҳтум биалннаҳари сумма йабааасукум фийҳи лийуқда ажалун мусамман сумма илайҳи маржиааукум сумма йунаббиокум бима кунтум тааамалуна
                Ваҳува алқаҳиру фауқа ааибадиҳи вайурсилу ааалайкум ҳафасатан ҳатта иса жаа аҳадакуму алмауту тауаффасу русулуна ваҳум ла йуфарритуна
                Сумма рудду ила аллааҳи маулаҳуму алҳаққи ала лаҳу алҳукму ваҳува асрааау алҳасибийна
                Қул ман йунажжийкум мин сулумати албарри ваалбаҳри тадааунаҳу тадарруааан вахуфйатан лайн анжана мин ҳасиҳи ланакунанна мина ашшакирийна
                Қули аллааҳу йунажжийкум минҳа вамин кулли карбин сумма антум тушрикуна
                Қул ҳува алқадиру ааала ан йабаааса ааалайкум ааасабан мин фауқикум ау мин таҳти аржуликум ау йалбисакум шийаааан вайусийқа бааадакум баса бааадин онсур кайфа нусаррифу алайати лааааллааҳум йафқаҳуна
                Вакассаба биҳи қаумука ваҳува алҳаққу қул ласту ааалайкум бивакийлин
                Ликулли набайн мустақаррун васауфа таааламуна
                Вайса раайта аллазийна йахудуна фий айатина фаааарид ааанҳум ҳатта йахуду фий ҳадийсин ғайриҳи ваймма йунсийаннака ашшайтану фала тақаауд бааада ассикра маааа алқауми ассалимийна
                Вама ааала аллазийна йаттақуна мин ҳисабиҳим мин шайин валакин сикра лааааллааҳум йаттақуна
                Васари аллазийна иттахасу дийнаҳум лааайбан валаҳван вағаррасуму алҳайату аддунйа васаккир биҳи ан тубсала нафсун бима касабат лайса лаҳа мин дуни аллааҳи валиййун вала шафийааун вайн тааадил кулла ааадлин ла йухас минҳа олайка аллазийна обсилу бима касабу лаҳум шаробун мин ҳамиймин ваааасабун алиймун бима кану йакфуруна
                Қул анадаау мин дуни аллааҳи ма ла йанфааауна вала йадурруна ванурадду ааала ааақабина бааада ис ҳадана аллааҳу кааллазий истаҳвасу ашшайатийну фий аларди ҳайрана лаҳу ашабун йадааунаҳу ила алҳуда итина қул инна ҳуда аллааҳи ҳува алҳуда ваомирна линуслима лиробби алаааламийна
                Ваан ақийму ассалата вайттақуҳу ваҳува аллазий илайҳи туҳшаруна
                Ваҳува аллазий халақа ассамауати вааларда биалҳаққи вайаума йақулу кун файакуну қаулуҳу алҳаққу валаҳу алмулку йаума йунфаху фий ассури ааалиму алғайби ваалшшаҳадати ваҳува алҳакийму алхабийру
                Вайс қала иброҳийму лиабийҳи азара ататтахису аснаман алиҳатан инний арака вақаумака фий далалин мубийнин
                Вакасалика нурий иброҳийма малакута ассамауати вааларди валийакуна мина алмуқинийна
                Фаламма жанна ааалайҳи аллайлу раа каукабан қала ҳаса роббий фаламма афала қала ла оҳиббу алафилийна
                Фаламма раа алқамара базиған қала ҳаса роббий фаламма афала қала лайн лам йаҳдиний роббий лаакунанна мина алқауми аддаллийна
                Фаламма раа ашшамса базиғатан қала ҳаса роббий ҳаса акбару фаламма афалат қала йа қауми инний барийон мимма тушрикуна
                Инний важжаҳту важҳийа лиллазий фатара ассамауати вааларда ҳанийфан вама ана мина алмушрикийна
                Ваҳажжаҳу қаумуҳу қала атуҳажжунний фий аллааҳи вақад ҳадани вала ахафу ма тушрикуна биҳи илла ан йашаа роббий шайан васиааа роббий кулла шайин ааилман афала татасаккаруна
                Вакайфа ахафу ма ашрактум вала тахафуна аннакум ашрактум биаллааҳи ма лам йуназзил биҳи ааалайкум султанан фааййу алфарийқайни аҳаққу биаламни ин кунтум таааламуна
                Аллазийна аману валам йалбису ийманаҳум бисулмин олайка лаҳуму аламну ваҳум муҳтадуна
                Ватилка ҳужжатуна атайнаҳа иброҳийма ааала қаумиҳи нарфааау даражатин ман нашао инна роббака ҳакиймун ааалиймун
                Вауаҳабна лаҳу ишақа вайааақуба куллан ҳадайна вануҳан ҳадайна мин қаблу вамин сурриййатиҳи даууда васулаймана вааййуба вайусуфа вамуса ваҳаруна вакасалика нажзий алмуҳсинийна
                Вазакариййа вайаҳйа ваааийса вайлйаса куллун мина ассалиҳийна
                Вайсмаааийла вайлйасаааа вайунуса валутан вакуллан фаддална ааала алаааламийна
                Вамин абайҳим васурриййатиҳим вайхваниҳим вайжтабайнаҳум ваҳадайнаҳум ила сиратин мустақиймин
                Салика ҳуда аллааҳи йаҳдий биҳи ман йашао мин ааибадиҳи валау ашраку лаҳабита ааанҳум ма кану йааамалуна
                Олайка аллазийна атайнаҳуму алкитаба ваалҳукма ваалннубуввата файн йакфур биҳа ҳаолай фақад ваккална биҳа қауман лайсу биҳа бикафирийна
                Олайка аллазийна ҳада аллааҳу фабиҳудаҳуму иқтадиҳ қул ла асалукум ааалайҳи ажран ин ҳува илла сикра лилаааламийна
                Вама қадару аллааҳа ҳаққа қадриҳи ис қалу ма анзала аллааҳу ааала башарин мин шайин қул ман анзала алкитаба аллазий жаа биҳи муса нуран ваҳудан лилннаси тажааалунаҳу қаратийса тубдунаҳа ватухфуна касийран вааауллимтум ма лам таааламу антум вала абаокум қули аллааҳу сумма сарҳум фий хаудиҳим йалааабуна
                Ваҳаса китабун анзалнаҳу мубаракун мусаддиқу аллазий байна йадайҳи валитунсира омма алқура ваман ҳаулаҳа вааллазийна йуминуна биалахирати йуминуна биҳи ваҳум ааала салатиҳим йуҳафисуна
                Ваман асламу миммани ифтара ааала аллааҳи касибан ау қала уҳийа илаййа валам йуҳа илайҳи шайон ваман қала саонзилу мисла ма анзала аллааҳу валау тара иси ассалимуна фий ғамарати алмаути ваалмалайкату баситу айдийҳим ахрижу анфусакуму алйаума тужзауна ааасаба алҳуни бима кунтум тақулуна ааала аллааҳи ғайра алҳаққи вакунтум ааан айатиҳи тастакбируна
                Валақад житумуна фурада кама халақнакум аувала марратин ватарактум ма хаувалнакум вараа суҳурикум вама нара маааакум шуфааааакуму аллазийна заааамтум аннаҳум фийкум шуракао лақад тақаттаааа байнакум вадалла ааанкум ма кунтум тазааумуна
                Инна аллааҳа фалиқу алҳабби ваалннауа йухрижу алҳаййа мина алмаййити вамухрижу алмаййити мина алҳаййи саликуму аллааҳу фаанна туфакуна
                Фалиқу алисбаҳи важаааала аллайла саканан ваалшшамса ваалқамара ҳусбанан салика тақдийру алааазийзи алааалийми
                Ваҳува аллазий жаааала лакуму аннужума литаҳтаду биҳа фий сулумати албарри ваалбаҳри қад фассална алайати лиқаумин йаааламуна
                Ваҳува аллазий аншаакум мин нафсин ваҳидатин фамустақаррун вамустаудаааун қад фассална алайати лиқаумин йафқаҳуна
                Ваҳува аллазий анзала мина ассамай маан фаахражна биҳи набата кулли шайин фаахражна минҳу хадиран нухрижу минҳу ҳаббан мутаракибан вамина аннахли мин талааиҳа қинванун данийатун важаннатин мин ааанабин ваалззайтуна ваалрруммана муштабиҳан вағайра муташабиҳин онсуру ила самариҳи иса асмара вайанааиҳи инна фий саликум лаайатин лиқаумин йуминуна
                Важаааалу лиллаҳи шуракаа алжинна вахалақаҳум вахарақу лаҳу банийна вабанатин биғайри ааилмин субҳанаҳу ватаааала ааамма йасифуна
                Бадийаау ассамауати вааларди анна йакуну лаҳу валадун валам такун лаҳу саҳибатун вахалақа кулла шайин ваҳува бикулли шайин ааалиймун
                Саликуму аллааҳу роббукум ла илаҳа илла ҳува халиқу кулли шайин фаоаабудуҳу ваҳува ааала кулли шайин вакийлун
                Ла тудрикуҳу алабсару ваҳува йудрику алабсара ваҳува аллатийфу алхабийру
                Қад жаакум басайру мин роббикум фаман абсара фалинафсиҳи ваман ааамийа фаааалайҳа вама ана ааалайкум биҳафийсин
                Вакасалика нусаррифу алайати валийақулу дараста валинубаййинаҳу лиқаумин йаааламуна
                Иттабиаа ма уҳийа илайка мин роббика ла илаҳа илла ҳува ваааарид ааани алмушрикийна
                Валау шаа аллааҳу ма ашраку вама жаааалнака ааалайҳим ҳафийсан вама анта ааалайҳим бивакийлин
                Вала тасуббу аллазийна йадаауна мин дуни аллааҳи файасуббу аллааҳа ааадван биғайри ааилмин касалика заййанна ликулли омматин ааамалаҳум сумма ила роббиҳим маржиаауҳум файунаббиоҳум бима кану йааамалуна
                Ваақсаму биаллааҳи жаҳда айманиҳим лайн жаасум айатун лайуминунна биҳа қул иннама алайату ааинда аллааҳи вама йушааирукум аннаҳа иса жаат ла йуминуна
                Вануқаллибу афидатаҳум ваабсароҳум кама лам йумину биҳи аувала марратин ванасаруҳум фий туғйаниҳим йааамаҳуна
                Валау аннана наззална илайҳиму алмалайката вакалламаҳуму алмаута ваҳашарна ааалайҳим кулла шайин қубулан ма кану лийумину илла ан йашаа аллааҳу валакинна аксароҳум йажҳалуна
                Вакасалика жаааална ликулли набиййин ааадувван шайатийна алинси ваалжинни йуҳий бааадуҳум ила бааадин зухруфа алқаули ғуруран валау шаа роббука ма фаааалуҳу фасарҳум вама йафтаруна
                Валитасға илайҳи афидату аллазийна ла йуминуна биалахирати валийардауҳу валийақтарифу ма ҳум муқтарифуна
                Афағайра аллааҳи абтағий ҳакаман ваҳува аллазий анзала илайкуму алкитаба муфассалан вааллазийна атайнаҳуму алкитаба йаааламуна аннаҳу муназзалун мин роббика биалҳаққи фала такунанна мина алмумтарийна
                Ватаммат калимату роббика сидқан ваааадлан ла мубаддила ликалиматиҳи ваҳува ассамийаау алааалийму
                Вайн тутиаа аксара ман фий аларди йудиллука ааан сабийли аллааҳи ин йаттабиаауна илла ассанна вайн ҳум илла йахрусуна
                Инна роббака ҳува аааламу ман йадиллу ааан сабийлиҳи ваҳува аааламу биалмуҳтадийна
                Факулу мимма сукира исму аллааҳи ааалайҳи ин кунтум биайатиҳи муминийна
                Вама лакум алла такулу мимма сукира исму аллааҳи ааалайҳи вақад фассала лакум ма ҳаррама ааалайкум илла ма идтуриртум илайҳи вайнна касийран лайудиллуна биаҳвайҳим биғайри ааилмин инна роббака ҳува аааламу биалмуаатадийна
                Васару саҳира алисми вабатинаҳу инна аллазийна йаксибуна алисма сайужзауна бима кану йақтарифуна
                Вала такулу мимма лам йускари исму аллааҳи ааалайҳи вайннаҳу лафисқун вайнна ашшайатийна лайуҳуна ила аулийайҳим лийужадилукум вайн атааатумуҳум иннакум ламушрикуна
                Ауа ман кана майтан фааҳйайнаҳу важаааална лаҳу нуран йамший биҳи фий аннаси каман масалуҳу фий ассулумати лайса бихарижин минҳа касалика зуййина лилкафирийна ма кану йааамалуна
                Вакасалика жаааална фий кулли қарйатин акабира мужримийҳа лийамкуру фийҳа вама йамкуруна илла бианфусиҳим вама йашаауруна
                Вайса жаасум айатун қалу лан нумина ҳатта нута мисла ма утийа русулу аллааҳи аллааҳу аааламу ҳайсу йажааалу рисалатаҳу сайусийбу аллазийна ажраму сағарун ааинда аллааҳи ваааасабун шадийдун бима кану йамкуруна
                Фаман йуриди аллааҳу ан йаҳдийаҳу йашроҳ садроҳу лилислами ваман йурид ан йудиллаҳу йажааал садроҳу даййиқан ҳаражан кааннама йассааааааду фий ассамай касалика йажааалу аллааҳу аррижса ааала аллазийна ла йуминуна
                Ваҳаса сирату роббика мустақийман қад фассална алайати лиқаумин йассаккаруна
                Лаҳум дару ассалами ааинда роббиҳим ваҳува валиййуҳум бима кану йааамалуна
                Вайаума йаҳшуруҳум жамийааан йа мааашара алжинни қади истаксартум мина алинси вақала аулийаоҳум мина алинси роббана истамтаааа бааадуна бибааадин вабалағна ажалана аллазий ажжалта лана қала аннару масвакум халидийна фийҳа илла ма шаа аллааҳу инна роббака ҳакиймун ааалиймун
                Вакасалика нуваллий бааада ассалимийна бааадан бима кану йаксибуна
                Йа мааашара алжинни ваалинси алам йатикум русулун минкум йақуссуна ааалайкум айатий вайунсирунакум лиқаа йаумикум ҳаса қалу шаҳидна ааала анфусина вағаррасуму алҳайату аддунйа вашаҳиду ааала анфусиҳим аннаҳум кану кафирийна
                Салика ан лам йакун роббука муҳлика алқура бисулмин вааҳлуҳа ғафилуна
                Валикуллин даражатун мимма ааамилу вама роббука биғафилин ааамма йааамалуна
                Вароббука алғаниййу су арроҳмати ин йаша йусҳибкум вайастахлиф мин бааадикум ма йашао кама аншаакум мин сурриййати қаумин ахарийна
                Инна ма туааадуна лаатин вама антум бимуаажизийна
                Қул йа қауми иаамалу ааала маканатикум инний ааамилун фасауфа таааламуна ман такуну лаҳу ааақибату аддари иннаҳу ла йуфлиҳу ассалимуна
                Важаааалу лиллаҳи мимма сараа мина алҳарси вааланааами насийбан фақалу ҳаса лиллаҳи бизааамиҳим ваҳаса лишуракайна фама кана лишуракайҳим фала йасилу ила аллааҳи вама кана лиллаҳи фаҳува йасилу ила шуракайҳим саа ма йаҳкумуна
                Вакасалика заййана ликасийрин мина алмушрикийна қатла ауладиҳим шуракаоҳум лийурдуҳум валийалбису ааалайҳим дийнаҳум валау шаа аллааҳу ма фаааалуҳу фасарҳум вама йафтаруна
                Вақалу ҳасиҳи анааамун ваҳарсун ҳижрун ла йатааамуҳа илла ман нашао бизааамиҳим ваанааамун ҳурримат суҳуруҳа ваанааамун ла йаскуруна исма аллааҳи ааалайҳа ифтираан ааалайҳи сайажзийҳим бима кану йафтаруна
                Вақалу ма фий бутуни ҳасиҳи аланааами халисатун лисукурина вамуҳаррамун ааала азважина вайн йакун майтатан фаҳум фийҳи шуракао сайажзийҳим васфаҳум иннаҳу ҳакиймун ааалиймун
                Қад хасира аллазийна қаталу ауладаҳум сафаҳан биғайри ааилмин ваҳарраму ма разақаҳуму аллааҳу ифтираан ааала аллааҳи қад даллу вама кану муҳтадийна
                Ваҳува аллазий аншаа жаннатин мааарушатин вағайра мааарушатин ваалннахла ваалззарааа мухталифан окулуҳу ваалззайтуна ваалрруммана муташабиҳан вағайра муташабиҳин кулу мин самариҳи иса асмара ваату ҳаққаҳу йаума ҳасадиҳи вала тусрифу иннаҳу ла йуҳиббу алмусрифийна
                Вамина аланааами ҳамулатан вафаршан кулу мимма разақакуму аллааҳу вала таттабиаау хутувати ашшайтани иннаҳу лакум ааадуввун мубийнун
                Саманийата азважин мина аддани иснайни вамина алмааази иснайни қул ассакарайни ҳаррама ами алонсайайни амма иштамалат ааалайҳи арҳаму алонсайайни наббиуний биааилмин ин кунтум садиқийна
                Вамина алибили иснайни вамина албақари иснайни қул ассакарайни ҳаррама ами алонсайайни амма иштамалат ааалайҳи арҳаму алонсайайни ам кунтум шуҳадаа ис вассакуму аллааҳу биҳаса фаман асламу миммани ифтара ааала аллааҳи касибан лийудилла аннаса биғайри ааилмин инна аллааҳа ла йаҳдий алқаума ассалимийна
                Қул ла ажиду фий ма уҳийа илаййа муҳарраман ааала таааймин йатааамуҳу илла ан йакуна майтатан ау даман масфуҳан ау лаҳма хинзийрин файннаҳу рижсун ау фисқан оҳилла лиғайри аллааҳи биҳи фамани идтурра ғайра бағин вала ааадин файнна роббака ғафурун роҳиймун
                Ваааала аллазийна ҳаду ҳаррамна кулла сий суфурин вамина албақари ваалғанами ҳаррамна ааалайҳим шуҳумаҳума илла ма ҳамалат суҳуруҳума ауи алҳауайа ау ма ихталата биааасмин салика жазайнаҳум бибағйиҳим вайнна ласадиқуна
                Файн кассабука фақул роббукум су роҳматин васиааатин вала йурадду басуҳу ааани алқауми алмужримийна
                Сайақулу аллазийна ашраку лау шаа аллааҳу ма ашракна вала абаона вала ҳаррамна мин шайин касалика кассаба аллазийна мин қаблиҳим ҳатта сақу басана қул ҳал ааиндакум мин ааилмин фатухрижуҳу лана ин таттабиаауна илла ассанна вайн антум илла тахрусуна
                Қул фалиллаҳи алҳужжату албалиғату фалау шаа лаҳадакум ажмаааийна
                Қул ҳалумма шуҳадаакуму аллазийна йашҳадуна анна аллааҳа ҳаррама ҳаса файн шаҳиду фала ташҳад мааааҳум вала таттабиаа аҳваа аллазийна кассабу биайатина вааллазийна ла йуминуна биалахирати ваҳум бироббиҳим йааадилуна
                Қул таааалау атлу ма ҳаррама роббукум ааалайкум алла тушрику биҳи шайан вабиалвалидайни иҳсанан вала тақтулу ауладакум мин имлақин наҳну нарзуқукум вайййаҳум вала тақробу алфауаҳиша ма саҳара минҳа вама батана вала тақтулу аннафса аллатий ҳаррама аллааҳу илла биалҳаққи саликум вассакум биҳи лааааллакум тааақилуна
                Вала тақробу мала алйатийми илла биаллатий ҳийа аҳсану ҳатта йаблуға ашуддаҳу ваавфу алкайла ваалмийзана биалқисти ла нукаллифу нафсан илла вусаааҳа вайса қултум файаадилу валау кана са қурба вабиаааҳди аллааҳи ауфу саликум вассакум биҳи лааааллакум тасаккаруна
                Ваанна ҳаса сиратий мустақийман файттабиаауҳу вала таттабиаау ассубула фатафаррақа бикум ааан сабийлиҳи саликум вассакум биҳи лааааллакум таттақуна
                Сумма атайна муса алкитаба тамаман ааала аллазий аҳсана ватафсийлан ликулли шайин ваҳудан вароҳматан лааааллааҳум билиқай роббиҳим йуминуна
                Ваҳаса китабун анзалнаҳу мубаракун файттабиаауҳу вайттақу лааааллакум турҳамуна
                Ан тақулу иннама онзила алкитабу ааала тайфатайни мин қаблина вайн кунна ааан дирасатиҳим лағафилийна
                Ау тақулу лау анна онзила ааалайна алкитабу лакунна аҳда минҳум фақад жаакум баййинатун мин роббикум ваҳудан вароҳматун фаман асламу мимман кассаба биайати аллааҳи васадафа ааанҳа санажзий аллазийна йасдифуна ааан айатина суа алааасаби бима кану йасдифуна
                Ҳал йансуруна илла ан татийаҳуму алмалайкату ау йатийа роббука ау йатийа баааду айати роббика йаума йатий баааду айати роббика ла йанфааау нафсан иймануҳа лам такун аманат мин қаблу ау касабат фий ийманиҳа хайран қули интасиру инна мунтасируна
                Инна аллазийна фаррақу дийнаҳум вакану шийаааан ласта минҳум фий шайин иннама амруҳум ила аллааҳи сумма йунаббиоҳум бима кану йафааалуна
                Ман жаа биалҳасанати фалаҳу ааашру амсалиҳа ваман жаа биалссаййиати фала йужза илла мислаҳа ваҳум ла йусламуна
                Қул иннаний ҳаданий роббий ила сиратин мустақиймин дийнан қийаман миллата иброҳийма ҳанийфан вама кана мина алмушрикийна
                Қул инна салатий ванусукий вамаҳйайа вамаматий лиллаҳи робби алаааламийна
                Ла шарийка лаҳу вабисалика омирту ваана аувалу алмуслимийна
                Қул ағайра аллааҳи абғий роббан ваҳува роббу кулли шайин вала таксибу куллу нафсин илла ааалайҳа вала тазиру вазиратун визра охра сумма ила роббикум маржиааукум файунаббиокум бима кунтум фийҳи тахталифуна
                Ваҳува аллазий жаааалакум халайфа аларди варафаааа бааадакум фауқа бааадин даражатин лийаблувакум фий ма атакум инна роббака сарийаау алааиқаби вайннаҳу лағафурун роҳиймун
            """.trimIndent(),
        ),
        Surah(
            id = 7,
            arabicName = "الأعراف",
            latinName = "Al-A'raf",
            transliteration = """
                Алифламмиймсад
                Китабун онзила илайка фала йакун фий садрика ҳаражун минҳу литунсира биҳи васикра лилмуминийна
                Иттабиаау ма онзила илайкум мин роббикум вала таттабиаау мин дуниҳи аулийаа қалийлан ма тасаккаруна
                Вакам мин қарйатин аҳлакнаҳа фажааҳа басуна байатан ау ҳум қайлуна
                Фама кана дааауаҳум ис жааҳум басуна илла ан қалу инна кунна салимийна
                Фаланасаланна аллазийна орсила илайҳим валанасаланна алмурсалийна
                Фаланақуссанна ааалайҳим биааилмин вама кунна ғайбийна
                Ваалвазну йаумайсини алҳаққу фаман сақулат мауазийнуҳу фаолайка ҳуму алмуфлиҳуна
                Ваман хаффат мауазийнуҳу фаолайка аллазийна хасиру анфусаҳум бима кану биайатина йаслимуна
                Валақад макканнакум фий аларди важаааална лакум фийҳа маааайиша қалийлан ма ташкуруна
                Валақад халақнакум сумма сауварнакум сумма қулна лилмалайкати осжуду лиадама фасажаду илла иблийса лам йакун мина ассажидийна
                Қала ма манаааака алла тасжуда ис амартука қала ана хайрун минҳу халақтаний мин нарин вахалақтаҳу мин тийнин
                Қала файҳбит минҳа фама йакуну лака ан татакаббара фийҳа фаохруж иннака мина ассағирийна
                Қала ансирний ила йауми йубааасуна
                Қала иннака мина алмунсарийна
                Қала фабима ағвайтаний лаақаауданна лаҳум сиратака алмустақийма
                Сумма лаатийаннаҳум мин байни айдийҳим вамин халфиҳим ваааан айманиҳим ваааан шамайлиҳим вала тажиду аксароҳум шакирийна
                Қала охруж минҳа масуман мазуран ламан табиааака минҳум лаамлаанна жаҳаннама минкум ажмаааийна
                Вайа адаму оскун анта вазаужука алжанната факула мин ҳайсу шитума вала тақроба ҳасиҳи ашшажарата фатакуна мина ассалимийна
                Фауасваса лаҳума ашшайтану лийубдийа лаҳума ма вурийа ааанҳума мин сауатиҳима вақала ма наҳакума роббукума ааан ҳасиҳи ашшажарати илла ан такуна малакайни ау такуна мина алхалидийна
                Вақасамаҳума инний лакума ламина аннасиҳийна
                Фадаллааҳума биғурурин фаламма сақа ашшажарата бадат лаҳума сауатуҳума ватафиқа йахсифани ааалайҳима мин варақи алжаннати ванадаҳума роббуҳума алам анҳакума ааан тилкума ашшажарати ваақул лакума инна ашшайтана лакума ааадуввун мубийнун
                Қала роббана саламна анфусана вайн лам тағфир лана ватарҳамна ланакунанна мина алхасирийна
                Қала иҳбиту бааадукум либааадин ааадуввун валакум фий аларди мустақаррун ваматаааун ила ҳийнин
                Қала фийҳа таҳйауна вафийҳа тамутуна ваминҳа тухражуна
                Йа баний адама қад анзална ааалайкум либасан йуварий сауатикум варийшан валибасу аттақва салика хайрун салика мин айати аллааҳи лааааллааҳум йассаккаруна
                Йа баний адама ла йафтинаннакуму ашшайтану кама ахража абауайкум мина алжаннати йанзиаау ааанҳума либасаҳума лийурийаҳума сауатиҳима иннаҳу йаракум ҳува вақабийлуҳу мин ҳайсу ла тараунаҳум инна жаааална ашшайатийна аулийаа лиллазийна ла йуминуна
                Вайса фаааалу фаҳишатан қалу важадна ааалайҳа абаана вааллааҳу амарана биҳа қул инна аллааҳа ла йамуру биалфаҳшай атақулуна ааала аллааҳи ма ла таааламуна
                Қул амара роббий биалқисти ваақийму вужуҳакум ааинда кулли масжидин ваодаауҳу мухлисийна лаҳу аддийна кама бадаакум таааудуна
                Фарийқан ҳада вафарийқан ҳаққа ааалайҳиму аддалалату иннаҳуму иттахасу ашшайатийна аулийаа мин дуни аллааҳи вайаҳсабуна аннаҳум муҳтадуна
                Йа баний адама хусу зийнатакум ааинда кулли масжидин вакулу вайшробу вала тусрифу иннаҳу ла йуҳиббу алмусрифийна
                Қул ман ҳаррама зийната аллааҳи аллатий ахража лиааибадиҳи ваалттаййибати мина арризқи қул ҳийа лиллазийна аману фий алҳайати аддунйа халисатан йаума алқийамати касалика нуфассилу алайати лиқаумин йаааламуна
                Қул иннама ҳаррама роббийа алфауаҳиша ма саҳара минҳа вама батана ваалисма ваалбағйа биғайри алҳаққи ваан тушрику биаллааҳи ма лам йуназзил биҳи султанан ваан тақулу ааала аллааҳи ма ла таааламуна
                Валикулли омматин ажалун файса жаа ажалуҳум ла йастахируна саааатан вала йастақдимуна
                Йа баний адама имма йатийаннакум русулун минкум йақуссуна ааалайкум айатий фамани иттақа вааслаҳа фала хауфун ааалайҳим вала ҳум йаҳзануна
                Вааллазийна кассабу биайатина вайстакбару ааанҳа олайка ашабу аннари ҳум фийҳа халидуна
                Фаман асламу миммани ифтара ааала аллааҳи касибан ау кассаба биайатиҳи олайка йаналуҳум насийбуҳум мина алкитаби ҳатта иса жаасум русулуна йатауаффаунаҳум қалу айна ма кунтум тадаауна мин дуни аллааҳи қалу даллу ааанна вашаҳиду ааала анфусиҳим аннаҳум кану кафирийна
                Қала одхулу фий омамин қад халат мин қабликум мина алжинни ваалинси фий аннари куллама дахалат омматун лаааанат охтаҳа ҳатта иса иддараку фийҳа жамийааан қалат охроҳум лиулаҳум роббана ҳаолай адаллуна фаатиҳим ааасабан диаафан мина аннари қала ликуллин диаафун валакин ла таааламуна
                Вақалат улаҳум лиохроҳум фама кана лакум ааалайна мин фадлин фасуқу алааасаба бима кунтум таксибуна
                Инна аллазийна кассабу биайатина вайстакбару ааанҳа ла туфаттаҳу лаҳум абвабу ассамай вала йадхулуна алжанната ҳатта йалижа алжамалу фий самми алхийати вакасалика нажзий алмужримийна
                Лаҳум мин жаҳаннама миҳадун вамин фауқиҳим ғауашин вакасалика нажзий ассалимийна
                Вааллазийна аману ваааамилу ассалиҳати ла нукаллифу нафсан илла вусаааҳа олайка ашабу алжаннати ҳум фийҳа халидуна
                Ваназааана ма фий судуриҳим мин ғиллин тажрий мин таҳтиҳиму аланҳару вақалу алҳамду лиллаҳи аллазий ҳадана лиҳаса вама кунна линаҳтадийа лаула ан ҳадана аллааҳу лақад жаат русулу роббина биалҳаққи вануду ан тилкуму алжаннату уристумуҳа бима кунтум тааамалуна
                Ванада ашабу алжаннати ашаба аннари ан қад важадна ма ваааадана роббуна ҳаққан фаҳал важадтум ма ваааада роббукум ҳаққан қалу наааам фаассана муассинун байнаҳум ан лааанату аллааҳи ааала ассалимийна
                Аллазийна йасуддуна ааан сабийли аллааҳи вайабғунаҳа ааиважан ваҳум биалахирати кафируна
                Вабайнаҳума ҳижабун ваааала алааарафи рижалун йааарифуна куллан бисиймаҳум ванадау ашаба алжаннати ан саламун ааалайкум лам йадхулуҳа ваҳум йатмааауна
                Вайса сурифат абсаруҳум тилқаа ашаби аннари қалу роббана ла тажааална маааа алқауми ассалимийна
                Ванада ашабу алааарафи рижалан йааарифунаҳум бисиймаҳум қалу ма ағна ааанкум жамааукум вама кунтум тастакбируна
                Аҳаолай аллазийна ақсамтум ла йаналуҳуму аллааҳу бироҳматин одхулу алжанната ла хауфун ааалайкум вала антум таҳзануна
                Ванада ашабу алнари ашаба алжаннати ан афийду ааалайна мина алмай ау мимма разақакуму аллааҳу қалу инна аллааҳа ҳаррамаҳума ааала алкафирийна
                Аллазийна иттахасу дийнаҳум лаҳван валааайбан вағаррасуму алҳайату аддунйа фаалйаума нансаҳум кама насу лиқаа йаумиҳим ҳаса вама кану биайатина йажҳадуна
                Валақад жинаҳум бикитабин фассалнаҳу ааала ааилмин ҳудан вароҳматан лиқаумин йуминуна
                Ҳал йансуруна илла тауийлаҳу йаума йатий тауийлуҳу йақулу аллазийна насуҳу мин қаблу қад жаат русулу роббина биалҳаққи фаҳал лана мин шуфааааа файашфааау лана ау нурадду фанааамала ғайра аллазий кунна нааамалу қад хасиру анфусаҳум вадалла ааанҳум ма кану йафтаруна
                Инна роббакуму аллааҳу аллазий халақа ассамауати вааларда фий ситтати аййамин сумма истауа ааала алааарши йуғший аллайла аннаҳара йатлубуҳу ҳасийсан ваалшшамса ваалқамара ваалннужума мусаххаратин биамриҳи ала лаҳу алхалқу вааламру табарака аллааҳу роббу алаааламийна
                Одаау роббакум тадарруааан вахуфйатан иннаҳу ла йуҳиббу алмуаатадийна
                Вала туфсиду фий аларди бааада ислаҳиҳа ваодаауҳу хауфан ватамаааан инна роҳмата аллааҳи қарийбун мина алмуҳсинийна
                Ваҳува аллазий йурсилу аррийаҳа бушран байна йадай роҳматиҳи ҳатта иса ақаллат саҳабан сиқалан суқнаҳу либаладин маййитин фаанзална биҳи алмаа фаахражна биҳи мин кулли ассамарати касалика нухрижу алмаута лааааллакум тасаккаруна
                Ваалбаладу аттаййибу йахружу набатуҳу бийсни роббиҳи вааллазий хабуса ла йахружу илла накидан касалика нусаррифу алайати лиқаумин йашкуруна
                Лақад арсална нуҳан ила қаумиҳи фақала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу инний ахафу ааалайкум ааасаба йаумин ааасиймин
                Қала алмалао мин қаумиҳи инна ланарака фий далалин мубийнин
                Қала йа қауми лайса бий далалатун валакинний расулун мин робби алаааламийна
                Обаллиғукум рисалати роббий ваансаҳу лакум вааааламу мина аллааҳи ма ла таааламуна
                Ауаааажибтум ан жаакум сикрун мин роббикум ааала ражулин минкум лийунсиракум валитаттақу валааааллакум турҳамуна
                Факассабуҳу фаанжайнаҳу вааллазийна мааааҳу фий алфулки ваағрақна аллазийна кассабу биайатина иннаҳум кану қауман ааамийна
                Вайла ааадин ахаҳум ҳудан қала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу афала таттақуна
                Қала алмалао аллазийна кафару мин қаумиҳи инна ланарака фий сафаҳатин вайнна ланасуннука мина алкасибийна
                Қала йа қауми лайса бий сафаҳатун валакинний расулун мин робби алаааламийна
                Обаллиғукум рисалати роббий ваана лакум насиҳун амийнун
                Ауаааажибтум ан жаакум сикрун мин роббикум ааала ражулин минкум лийунсиракум ваоскуру ис жаааалакум хулафаа мин бааади қауми нуҳин вазадакум фий алхалқи бастатан фаоскуру алаа аллааҳи лааааллакум туфлиҳуна
                Қалу ажитана линааабуда аллааҳа ваҳдаҳу ванасара ма кана йааабуду абаона фатина бима тааайдуна ин кунта мина ассадиқийна
                Қала қад вақаааа ааалайкум мин роббикум рижсун вағадабун атужадилунаний фий асмайн саммайтумуҳа антум ваабаокум ма наззала аллааҳу биҳа мин султанин файнтасиру инний маааакум мина алмунтасирийна
                Фаанжайнаҳу вааллазийна мааааҳу бироҳматин минна вақатааана дабира аллазийна кассабу биайатина вама кану муминийна
                Вайла самуда ахаҳум салиҳан қала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу қад жааткум баййинатун мин роббикум ҳасиҳи нақату аллааҳи лакум айатан фасаруҳа такул фий арди аллааҳи вала тамассуҳа бисуин файахусакум ааасабун алиймун
                Ваоскуру ис жаааалакум хулафаа мин бааади ааадин вабауваакум фий аларди таттахисуна мин суҳулиҳа қусуран ватанҳитуна алжибала буйутан фаоскуру алаа аллааҳи вала тааасау фий аларди муфсидийна
                Қала алмалао аллазийна истакбару мин қаумиҳи лиллазийна истудааифу лиман амана минҳум атаааламуна анна салиҳан мурсалун мин роббиҳи қалу инна бима орсила биҳи муминуна
                Қала аллазийна истакбару инна биаллазий амантум биҳи кафируна
                Фаааақару аннақата ваааатау ааан амри роббиҳим вақалу йа салиҳу итина бима тааайдуна ин кунта мина алмурсалийна
                Фаахасасуму арражфату фаасбаҳу фий дариҳим жасимийна
                Фатауалла ааанҳум вақала йа қауми лақад аблағтукум рисалата роббий ванасаҳту лакум валакин ла туҳиббуна аннасиҳийна
                Валутан ис қала лиқаумиҳи ататуна алфаҳишата ма сабақакум биҳа мин аҳадин мина алаааламийна
                Иннакум лататуна аррижала шаҳватан мин дуни аннисай бал антум қаумун мусрифуна
                Вама кана жауаба қаумиҳи илла ан қалу ахрижуҳум мин қарйатикум иннаҳум онасун йататаҳҳаруна
                Фаанжайнаҳу вааҳлаҳу илла имраатаҳу канат мина алғабирийна
                Ваамтарна ааалайҳим матаран фаонсур кайфа кана ааақибату алмужримийна
                Вайла мадйана ахаҳум шуааайбан қала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу қад жааткум баййинатун мин роббикум фаавфу алкайла ваалмийзана вала табхасу аннаса ашйааҳум вала туфсиду фий аларди бааада ислаҳиҳа саликум хайрун лакум ин кунтум муминийна
                Вала тақаауду бикулли сиратин туааидуна ватасуддуна ааан сабийли аллааҳи ман амана биҳи ватабғунаҳа ааиважан ваоскуру ис кунтум қалийлан факассаракум ваонсуру кайфа кана ааақибату алмуфсидийна
                Вайн кана тайфатун минкум аману биаллазий орсилту биҳи ватайфатун лам йумину файсбиру ҳатта йаҳкума аллааҳу байнана ваҳува хайру алҳакимийна
                Қала алмалао аллазийна истакбару мин қаумиҳи ланухрижаннака йа шуааайбу вааллазийна аману маааака мин қарйатина ау латаааудунна фий миллатина қала ауалау кунна кариҳийна
                Қади ифтарайна ааала аллааҳи касибан ин ааудна фий миллатикум бааада ис нажжана аллааҳу минҳа вама йакуну лана ан нааауда фийҳа илла ан йашаа аллааҳу роббуна васиааа роббуна кулла шайин ааилман ааала аллааҳи тауаккална роббана ифтаҳ байнана вабайна қаумина биалҳаққи ваанта хайру алфатиҳийна
                Вақала алмалао аллазийна кафару мин қаумиҳи лайни иттабааатум шуааайбан иннакум исан лахасируна
                Фаахасасуму арражфату фаасбаҳу фий дариҳим жасимийна
                Аллазийна кассабу шуааайбан каан лам йағнау фийҳа аллазийна кассабу шуааайбан кану ҳуму алхасирийна
                Фатауалла ааанҳум вақала йа қауми лақад аблағтукум рисалати роббий ванасаҳту лакум факайфа аса ааала қаумин кафирийна
                Вама арсална фий қарйатин мин набиййин илла ахасна аҳлаҳа биалбасай ваалддаррай лааааллааҳум йаддаррааауна
                Сумма баддална макана ассаййиати алҳасаната ҳатта ааафау вақалу қад масса абаана аддаррао ваалссаррао фаахаснаҳум бағтатан ваҳум ла йашаауруна
                Валау анна аҳла алқура аману вайттақау лафатаҳна ааалайҳим баракатин мина ассамай вааларди валакин кассабу фаахаснаҳум бима кану йаксибуна
                Афаамина аҳлу алқура ан йатийаҳум басуна байатан ваҳум наймуна
                Ауа амина аҳлу алқура ан йатийаҳум басуна дуҳан ваҳум йалааабуна
                Афаамину макра аллааҳи фала йаману макра аллааҳи илла алқауму алхасируна
                Ауалам йаҳди лиллазийна йарисуна аларда мин бааади аҳлиҳа ан лау нашао асабнаҳум бисунубиҳим ванатбааау ааала қулубиҳим фаҳум ла йасмааауна
                Тилка алқура нақуссу ааалайка мин анбайҳа валақад жаасум русулуҳум биалбаййинати фама кану лийумину бима кассабу мин қаблу касалика йатбааау аллааҳу ааала қулуби алкафирийна
                Вама важадна лиаксариҳим мин аааҳдин вайн важадна аксароҳум лафасиқийна
                Сумма баааасна мин бааадиҳим муса биайатина ила фирааауна вамалайҳи фасаламу биҳа фаонусур кайфа кана ааақибату алмуфсидийна
                Вақала муса йа фирааауну инний расулун мин робби алаааламийна
                Ҳақийқун ааала ан ла ақула ааала аллааҳи илла алҳаққа қад житукум бибаййинатин мин роббикум фаарсил маааййа баний исраийла
                Қала ин кунта жита биайатин фати биҳа ин кунта мина ассадиқийна
                Фаалқа ааасаҳу файса ҳийа суаабанун мубийнун
                Ваназаааа йадаҳу файса ҳийа байдао лилннасирийна
                Қала алмалао мин қауми фирааауна инна ҳаса ласаҳирун ааалиймун
                Йурийду ан йухрижакум мин ардикум фамаса тамуруна
                Қалу аржиҳ ваахаҳу ваарсил фий алмадайни ҳаширийна
                Йатука бикулли саҳирин ааалиймин
                Важаа ассаҳарату фирааауна қалу инна лана лаажран ин кунна наҳну алғалибийна
                Қала наааам вайннакум ламина алмуқарробийна
                Қалу йа муса имма ан тулқийа ваймма ан накуна наҳну алмулқийна
                Қала алқу фаламма алқау саҳару ааайуна аннаси вайстарҳабуҳум важау бисиҳрин ааасиймин
                Ваавҳайна ила муса ан алқи ааасака файса ҳийа талқафу ма йафикуна
                Фауақаааа алҳаққу вабатала ма кану йааамалуна
                Фағулибу ҳуналика вайнқалабу сағирийна
                Ваолқийа ассаҳарату сажидийна
                Қалу аманна биробби алаааламийна
                Робби муса ваҳаруна
                Қала фирааауну амантум биҳи қабла ан асана лакум инна ҳаса ламакрун макартумуҳу фий алмадийнати литухрижу минҳа аҳлаҳа фасауфа таааламуна
                Лаоқатиааанна айдийакум вааржулакум мин хилафин сумма лаосаллибаннакум ажмаааийна
                Қалу инна ила роббина мунқалибуна
                Вама танқиму минна илла ан аманна биайати роббина ламма жаатна роббана африғ ааалайна сабран ватауаффана муслимийна
                Вақала алмалао мин қауми фирааауна атасару муса вақаумаҳу лийуфсиду фий аларди вайасарака ваалиҳатака қала сануқаттилу абнааҳум ванастаҳйий нисааҳум вайнна фауқаҳум қаҳируна
                Қала муса лиқаумиҳи истаааийну биаллааҳи вайсбиру инна аларда лиллаҳи йурисуҳа ман йашао мин ааибадиҳи ваалааақибату лилмуттақийна
                Қалу усийна мин қабли ан татийана вамин бааади ма житана қала аааса роббукум ан йуҳлика ааадуввакум вайастахлифакум фий аларди файансура кайфа тааамалуна
                Валақад ахасна ала фирааауна биалссинийна ванақсин мина ассамарати лааааллааҳум йассаккаруна
                Файса жаасуму алҳасанату қалу лана ҳасиҳи вайн тусибҳум саййиатун йаттаййару бимуса ваман мааааҳу ала иннама тайруҳум ааинда аллааҳи валакинна аксароҳум ла йаааламуна
                Вақалу маҳма татина биҳи мин айатин литашарана биҳа фама наҳну лака бимуминийна
                Фаарсална ааалайҳиму аттуфана ваалжарада ваалқуммала ваалддафадиааа ваалддама айатин муфассалатин файстакбару вакану қауман мужримийна
                Валамма вақаааа ааалайҳиму аррижзу қалу йа муса одаау лана роббака бима аааҳида ааиндака лайн кашафта ааанна аррижза лануминанна лака валанурсиланна маааака баний исраийла
                Фаламма кашафна ааанҳуму аррижза ила ажалин ҳум балиғуҳу иса ҳум йанкусуна
                Файнтақамна минҳум фаағрақнаҳум фий алйамми бианнаҳум кассабу биайатина вакану ааанҳа ғафилийна
                Вааврасна алқаума аллазийна кану йустадааафуна машариқа аларди вамағарибаҳа аллатий баракна фийҳа ватаммат калимату роббика алҳусна ааала баний исраийла бима сабару вадаммарна ма кана йаснааау фирааауну вақаумуҳу вама кану йаааришуна
                Важауазна бибаний исраийла албаҳра фаатау ааала қаумин йааакуфуна ааала аснамин лаҳум қалу йа муса ижааал лана илаҳан кама лаҳум алиҳатун қала иннакум қаумун тажҳалуна
                Инна ҳаолай мутаббарун ма ҳум фийҳи вабатилун ма кану йааамалуна
                Қала ағайра аллааҳи абғийкум илаҳан ваҳува фаддалакум ааала алаааламийна
                Вайс анжайнакум мин али фирааауна йасумунакум суа алааасаби йуқаттилуна абнаакум вайастаҳйуна нисаакум вафий саликум балаон мин роббикум ааасиймун
                Вауаааадна муса саласийна лайлатан ваатмамнаҳа биааашрин фатамма мийқату роббиҳи арбаааийна лайлатан вақала муса лиахийҳи ҳаруна охлуфний фий қаумий вааслиҳ вала таттабиаа сабийла алмуфсидийна
                Валамма жаа муса лимийқатина вакалламаҳу роббуҳу қала робби ариний ансур илайка қала лан тараний валакини онсур ила алжабали файни истақарра маканаҳу фасауфа тараний фаламма тажалла роббуҳу лилжабали жаааалаҳу даккан вахарра муса сааайқан фаламма афақа қала субҳанака тубту илайка ваана аувалу алмуминийна
                Қала йа муса инний истафайтука ааала аннаси бирисалатий вабикаламий фахус ма атайтука вакун мина ашшакирийна
                Вакатабна лаҳу фий алалваҳи мин кулли шайин мауааисатан ватафсийлан ликулли шайин фахусҳа биқувватин вамур қаумака йахусу биаҳсаниҳа саорийкум дара алфасиқийна
                Саасрифу ааан айатийа аллазийна йатакаббаруна фий аларди биғайри алҳаққи вайн йарау кулла айатин ла йумину биҳа вайн йарау сабийла аррушди ла йаттахисуҳу сабийлан вайн йарау сабийла алғаййи йаттахисуҳу сабийлан салика бианнаҳум кассабу биайатина вакану ааанҳа ғафилийна
                Вааллазийна кассабу биайатина валиқай алахирати ҳабитат ааамалуҳум ҳал йужзауна илла ма кану йааамалуна
                Вайттахаса қауму муса мин бааадиҳи мин ҳулиййиҳим ааижлан жасадан лаҳу хуварун алам йарау аннаҳу ла йукаллимуҳум вала йаҳдийҳим сабийлан иттахасуҳу вакану салимийна
                Валамма суқита фий айдийҳим вараав аннаҳум қад даллу қалу лайн лам йарҳамна роббуна вайағфир лана ланакунанна мина алхасирийна
                Валамма ражаааа муса ила қаумиҳи ғадбана асифан қала бисама халафтумуний мин бааадий аааажилтум амра роббикум ваалқа алалваҳа ваахаса бираси ахийҳи йажурруҳу илайҳи қала ибна омма инна алқаума истадааафуний вакаду йақтулунаний фала тушмит бийа алааадаа вала тажааалний маааа алқауми ассалимийна
                Қала робби иғфир лий валиахий ваадхилна фий роҳматика ваанта арҳаму арроҳимийна
                Инна аллазийна иттахасу алааижла сайаналуҳум ғадабун мин роббиҳим василлатун фий алҳайати аддунйа вакасалика нажзий алмуфтарийна
                Вааллазийна ааамилу ассаййиати сумма табу мин бааадиҳа вааману инна роббака мин бааадиҳа лағафурун роҳиймун
                Валамма саката ааан муса алғадабу ахаса алалваҳа вафий нусхатиҳа ҳудан вароҳматун лиллазийна ҳум лироббиҳим йарҳабуна
                Вайхтара муса қаумаҳу сабааийна ражулан лимийқатина фаламма ахасасуму арражфату қала робби лау шита аҳлактаҳум мин қаблу вайййайа атуҳликуна бима фаааала ассуфаҳао минна ин ҳийа илла фитнатука тудиллу биҳа ман ташао ватаҳдий ман ташао анта валиййуна файғфир лана вайрҳамна ваанта хайру алғафирийна
                Ваоктуб лана фий ҳасиҳи аддунйа ҳасанатан вафий алахирати инна ҳудна илайка қала ааасабий осийбу биҳи ман ашао вароҳматий васиааат кулла шайин фасаактубуҳа лиллазийна йаттақуна вайутуна аззаката вааллазийна ҳум биайатина йуминуна
                Аллазийна йаттабиаауна аррасула аннабиййа аломмиййа аллазий йажидунаҳу мактубан ааиндаҳум фий аттаурати ваалинжийли йамуруҳум биалмаааруфи вайанҳаҳум ааани алмункари вайуҳиллу лаҳуму аттаййибати вайуҳарриму ааалайҳиму алхабайса вайадааау ааанҳум исроҳум ваалағлала аллатий канат ааалайҳим фааллазийна аману биҳи вааааззаруҳу ванасаруҳу вайттабааау аннура аллазий онзила мааааҳу олайка ҳуму алмуфлиҳуна
                Қул йа аййуҳа аннасу инний расулу аллааҳи илайкум жамийааан аллазий лаҳу мулку ассамауати вааларди ла илаҳа илла ҳува йуҳйий вайумийту фаамину биаллааҳи варасулиҳи аннабиййи аломмиййи аллазий йумину биаллааҳи вакалиматиҳи вайттабиаауҳу лааааллакум таҳтадуна
                Вамин қауми муса омматун йаҳдуна биалҳаққи вабиҳи йааадилуна
                Вақаттааанаҳуму иснатай ааашрата асбатан омаман ваавҳайна ила муса иси истасқаҳу қаумуҳу ани идриб биааасака алҳажара файнбажасат минҳу исната ааашрата ааайнан қад ааалима куллу онасин машробаҳум васаллална ааалайҳиму алғамама ваанзална ааалайҳиму алманна ваалссалва кулу мин таййибати ма разақнакум вама саламуна валакин кану анфусаҳум йаслимуна
                Вайс қийла лаҳуму оскуну ҳасиҳи алқарйата вакулу минҳа ҳайсу шитум вақулу ҳиттатун ваодхулу албаба сужжадан нағфир лакум хатийатикум саназийду алмуҳсинийна
                Фабаддала аллазийна саламу минҳум қаулан ғайра аллазий қийла лаҳум фаарсална ааалайҳим рижзан мина ассамай бима кану йаслимуна
                Вайсалҳум ааани алқарйати аллатий канат ҳадирата албаҳри ис йааадуна фий ассабти ис татийҳим ҳийтануҳум йаума сабтиҳим шурраааан вайаума ла йасбитуна ла татийҳим касалика наблуҳум бима кану йафсуқуна
                Вайс қалат омматун минҳум лима тааайсуна қауман аллааҳу муҳликуҳум ау муааассибуҳум ааасабан шадийдан қалу мааасиратан ила роббикум валааааллааҳум йаттақуна
                Фаламма насу ма суккиру биҳи анжайна аллазийна йанҳауна ааани ассуи ваахасна аллазийна саламу биааасабин баийсин бима кану йафсуқуна
                Фаламма ааатау ааан ма нуҳу ааанҳу қулна лаҳум куну қирадатан хасиийна
                Вайс таассана роббука лайабааасанна ааалайҳим ила йауми алқийамати ман йасумуҳум суа алааасаби инна роббака ласарийаау алааиқаби вайннаҳу лағафурун роҳиймун
                Вақаттааанаҳум фий аларди омаман минҳуму ассалиҳуна ваминҳум дуна салика вабалаунаҳум биалҳасанати ваалссаййиати лааааллааҳум йаржиаауна
                Фахалафа мин бааадиҳим халфун варису алкитаба йахусуна ааарада ҳаса аладна вайақулуна сайуғфару лана вайн йатиҳим ааарадун мислуҳу йахусуҳу алам йухас ааалайҳим мийсақу алкитаби ан ла йақулу ааала аллааҳи илла алҳаққа вадарасу ма фийҳи ваалддару алахирату хайрун лиллазийна йаттақуна афала тааақилуна
                Вааллазийна йумассикуна биалкитаби ваақаму ассалата инна ла нудийаау ажра алмуслиҳийна
                Вайс натақна алжабала фауқаҳум кааннаҳу суллатун васанну аннаҳу вақиааун биҳим хусу ма атайнакум биқувватин ваоскуру ма фийҳи лааааллакум таттақуна
                Вайс ахаса роббука мин баний адама мин суҳуриҳим сурриййатаҳум ваашҳадаҳум ааала анфусиҳим аласту бироббикум қалу бала шаҳидна ан тақулу йаума алқийамати инна кунна ааан ҳаса ғафилийна
                Ау тақулу иннама ашрака абаона мин қаблу вакунна сурриййатан мин бааадиҳим афатуҳликуна бима фаааала алмубтилуна
                Вакасалика нуфассилу алайати валааааллааҳум йаржиаауна
                Ваотлу ааалайҳим набаа аллазий атайнаҳу айатина файнсалаха минҳа фаатбааааҳу ашшайтану факана мина алғауийна
                Валау шина ларафааанаҳу биҳа валакиннаҳу ахлада ила аларди вайттабаааа ҳауаҳу фамасалуҳу камасали алкалби ин таҳмил ааалайҳи йалҳас ау татруху йалҳас салика масалу алқауми аллазийна кассабу биайатина фаоқсуси алқасаса лааааллааҳум йатафаккаруна
                Саа масалан алқауму аллазийна кассабу биайатина ваанфусаҳум кану йаслимуна
                Ман йаҳди аллааҳу фаҳува алмуҳтадий ваман йудлил фаолайка ҳуму алхасируна
                Валақад сарана лижаҳаннама касийран мина алжинни ваалинси лаҳум қулубун ла йафқаҳуна биҳа валаҳум ааайунун ла йубсируна биҳа валаҳум асанун ла йасмааауна биҳа олайка кааланааами бал ҳум адаллу олайка ҳуму алғафилуна
                Валиллаҳи аласмао алҳусна фаодаауҳу биҳа васару аллазийна йулҳидуна фий асмайҳи сайужзауна ма кану йааамалуна
                Вамимман халақна омматун йаҳдуна биалҳаққи вабиҳи йааадилуна
                Вааллазийна кассабу биайатина санастадрижуҳум мин ҳайсу ла йаааламуна
                Ваомлий лаҳум инна кайдий матийнун
                Ауалам йатафаккару ма бисаҳибиҳим мин жиннатин ин ҳува илла насийрун мубийнун
                Ауалам йансуру фий малакути ассамауати вааларди вама халақа аллааҳу мин шайин ваан аааса ан йакуна қади иқтароба ажалуҳум фабиаййи ҳадийсин бааадаҳу йуминуна
                Ман йудлили аллааҳу фала ҳадийа лаҳу вайасаруҳум фий туғйаниҳим йааамаҳуна
                Йасалунака ааани ассаааати аййана мурсаҳа қул иннама ааилмуҳа ааинда роббий ла йужаллийҳа ливақтиҳа илла ҳува сақулат фий ассамауати вааларди ла татийкум илла бағтатан йасалунака кааннака ҳафиййун ааанҳа қул иннама ааилмуҳа ааинда аллааҳи валакинна аксара аннаси ла йаааламуна
                Қул ла амлику линафсий нафааан вала дарран илла ма шаа аллааҳу валау кунту аааламу алғайба лайстаксарту мина алхайри вама массанийа ассуо ин ана илла насийрун вабашийрун лиқаумин йуминуна
                Ҳува аллазий халақакум мин нафсин ваҳидатин важаааала минҳа заужаҳа лийаскуна илайҳа фаламма тағашшаҳа ҳамалат ҳамлан хафийфан фамаррат биҳи фаламма асқалат даааава аллааҳа роббаҳума лайн атайтана салиҳан ланакунанна мина ашшакирийна
                Фаламма атаҳума салиҳан жаааала лаҳу шуракаа фийма атаҳума фатаааала аллааҳу ааамма йушрикуна
                Айушрикуна ма ла йахлуқу шайан ваҳум йухлақуна
                Вала йастатийаауна лаҳум насран вала анфусаҳум йансуруна
                Вайн тадаауҳум ила алҳуда ла йаттабиааукум сауаон ааалайкум адаааавтумуҳум ам антум самитуна
                Инна аллазийна тадаауна мин дуни аллааҳи ааибадун амсалукум фаодаауҳум фалйастажийбу лакум ин кунтум садиқийна
                Алаҳум аржулун йамшуна биҳа ам лаҳум айдин йабтишуна биҳа ам лаҳум ааайунун йубсируна биҳа ам лаҳум асанун йасмааауна биҳа қули одаау шуракаакум сумма кийдуни фала тунсируни
                Инна валиййийа аллааҳу аллазий наззала алкитаба ваҳува йатауалла ассалиҳийна
                Вааллазийна тадаауна мин дуниҳи ла йастатийаауна насракум вала анфусаҳум йансуруна
                Вайн тадаауҳум ила алҳуда ла йасмааау ватароҳум йансуруна илайка ваҳум ла йубсируна
                Хуси алааафва вамур биалааурфи ваааарид ааани алжаҳилийна
                Ваймма йанзағаннака мина ашшайтани назғун файстааайс биаллааҳи иннаҳу самийааун ааалиймун
                Инна аллазийна иттақау иса массаҳум тайфун мина ашшайтани тасаккару файса ҳум мубсируна
                Вайхвануҳум йамуддунаҳум фий алғаййи сумма ла йуқсируна
                Вайса лам татиҳим биайатин қалу лаула ижтабайтаҳа қул иннама аттабиаау ма йуҳа илаййа мин роббий ҳаса басайру мин роббикум ваҳудан вароҳматун лиқаумин йуминуна
                Вайса қуриа алқурану файстамиаау лаҳу ваанситу лааааллакум турҳамуна
                Ваоскур роббака фий нафсика тадарруааан вахийфатан вадуна алжаҳри мина алқаули биалғудувви вааласали вала такун мина алғафилийна
                Инна аллазийна ааинда роббика ла йастакбируна ааан ааибадатиҳи вайусаббиҳунаҳу валаҳу йасжудуна
            """.trimIndent(),
        ),
        Surah(
            id = 8,
            arabicName = "الأنفال",
            latinName = "Al-Anfal",
            transliteration = """
                Йасалунака ааани аланфали қули аланфалу лиллаҳи ваалррасули файттақу аллааҳа вааслиҳу сата байникум ваатийаау аллааҳа варасулаҳу ин кунтум муминийна
                Иннама алмуминуна аллазийна иса сукира аллааҳу важилат қулубуҳум вайса тулийат ааалайҳим айатуҳу задасум ийманан ваааала роббиҳим йатауаккалуна
                Аллазийна йуқиймуна ассалата вамимма разақнаҳум йунфиқуна
                Олайка ҳуму алмуминуна ҳаққан лаҳум даражатун ааинда роббиҳим вамағфиратун варизқун кариймун
                Кама ахражака роббука мин байтика биалҳаққи вайнна фарийқан мина алмуминийна лакариҳуна
                Йужадилунака фий алҳаққи бааадама табаййана кааннама йусақуна ила алмаути ваҳум йансуруна
                Вайс йааайдукуму аллааҳу иҳда аттайфатайни аннаҳа лакум ватауаддуна анна ғайра сати ашшаукати такуну лакум вайурийду аллааҳу ан йуҳиққа алҳаққа бикалиматиҳи вайақтаааа дабира алкафирийна
                Лийуҳиққа алҳаққа вайубтила албатила валау кариҳа алмужримуна
                Ис тастағийсуна роббакум файстажаба лакум анний мумиддукум биалфин мина алмалайкати мурдифийна
                Вама жаааалаҳу аллааҳу илла бушра валитатмайнна биҳи қулубукум вама аннасру илла мин ааинди аллааҳи инна аллааҳа ааазийзун ҳакиймун
                Ис йуғашшийкуму аннуаааса аманатан минҳу вайуназзилу ааалайкум мина ассамай маан лийутаҳҳиракум биҳи вайусҳиба ааанкум рижза ашшайтани валийарбита ааала қулубикум вайусаббита биҳи алақдама
                Ис йуҳий роббука ила алмалайкати анний маааакум фасаббиту аллазийна аману саолқий фий қулуби аллазийна кафару арруааба файдрибу фауқа алааанақи вайдрибу минҳум кулла бананин
                Салика бианнаҳум шаққу аллааҳа варасулаҳу ваман йушақиқи аллааҳа варасулаҳу файнна аллааҳа шадийду алааиқаби
                Саликум фасуқуҳу ваанна лилкафирийна ааасаба аннари
                Йа аййуҳа аллазийна аману иса лақийтуму аллазийна кафару заҳфан фала туваллуҳуму аладбара
                Ваман йуваллиҳим йаумайсин дубуроҳу илла мутаҳаррифан лиқиталин ау мутаҳаййизан ила фиатин фақад баа биғадабин мина аллааҳи вамауаҳу жаҳаннаму вабиса алмасийру
                Фалам тақтулуҳум валакинна аллааҳа қаталаҳум вама рамайта ис рамайта валакинна аллааҳа рама валийублийа алмуминийна минҳу балаан ҳасанан инна аллааҳа самийааун ааалиймун
                Саликум ваанна аллааҳа муҳину кайди алкафирийна
                Ин тастафтиҳу фақад жаакуму алфасу вайн тантаҳу фаҳува хайрун лакум вайн тааауду нааауд валан туғнийа ааанкум фиатукум шайан валау касурат ваанна аллааҳа маааа алмуминийна
                Йа аййуҳа аллазийна аману атийаау аллааҳа варасулаҳу вала тауаллау ааанҳу ваантум тасмааауна
                Вала такуну кааллазийна қалу самиаана ваҳум ла йасмааауна
                Инна шарра аддауабби ааинда аллааҳи ассумму албукму аллазийна ла йааақилуна
                Валау ааалима аллааҳу фийҳим хайран лаасмааааҳум валау асмааааҳум латауаллау ваҳум муааридуна
                Йа аййуҳа аллазийна аману истажийбу лиллаҳи валилррасули иса даааакум лима йуҳйийкум вайааламу анна аллааҳа йаҳулу байна алмари вақалбиҳи вааннаҳу илайҳи туҳшаруна
                Вайттақу фитнатан ла тусийбанна аллазийна саламу минкум хассатан вайааламу анна аллааҳа шадийду алааиқаби
                Ваоскуру ис антум қалийлун мустадааафуна фий аларди тахафуна ан йатахаттафакуму аннасу фаавакум вааййадакум бинасриҳи варазақакум мина аттаййибати лааааллакум ташкуруна
                Йа аййуҳа аллазийна аману ла тахуну аллааҳа ваалррасула ватахуну аманатикум ваантум таааламуна
                Вайааламу аннама амвалукум ваавладукум фитнатун ваанна аллааҳа ааиндаҳу ажрун ааасиймун
                Йа аййуҳа аллазийна аману ин таттақу аллааҳа йажааал лакум фурқанан вайукаффир ааанкум саййиатикум вайағфир лакум вааллааҳу су алфадли алааасийми
                Вайс йамкуру бика аллазийна кафару лийусбитука ау йақтулука ау йухрижука вайамкуруна вайамкуру аллааҳу вааллааҳу хайру алмакирийна
                Вайса тутла ааалайҳим айатуна қалу қад самиаана лау нашао лақулна мисла ҳаса ин ҳаса илла асатийру алаувалийна
                Вайс қалу аллааҳумма ин кана ҳаса ҳува алҳаққа мин ааиндика фаамтир ааалайна ҳижаратан мина ассамай ауи итина биааасабин алиймин
                Вама кана аллааҳу лийуааассибаҳум ваанта фийҳим вама кана аллааҳу муааассибаҳум ваҳум йастағфируна
                Вама лаҳум алла йуааассибаҳуму аллааҳу ваҳум йасуддуна ааани алмасжиди алҳарами вама кану аулийааҳу ин аулийаоҳу илла алмуттақуна валакинна аксароҳум ла йаааламуна
                Вама кана салатуҳум ааинда албайти илла мукаан ватасдийатан фасуқу алааасаба бима кунтум такфуруна
                Инна аллазийна кафару йунфиқуна амвалаҳум лийасудду ааан сабийли аллааҳи фасайунфиқунаҳа сумма такуну ааалайҳим ҳасратан сумма йуғлабуна вааллазийна кафару ила жаҳаннама йуҳшаруна
                Лийамийза аллааҳу алхабийса мина аттаййиби вайажааала алхабийса бааадаҳу ааала бааадин файаркумаҳу жамийааан файажааалаҳу фий жаҳаннама олайка ҳуму алхасируна
                Қул лиллазийна кафару ин йантаҳу йуғфар лаҳум ма қад салафа вайн йааауду фақад мадат суннату алаувалийна
                Вақатилуҳум ҳатта ла такуна фитнатун вайакуна аддийну куллуҳу лиллаҳи файни интаҳау файнна аллааҳа бима йааамалуна басийрун
                Вайн тауаллау файааламу анна аллааҳа маулакум ниаама алмаула ваниаама аннасийру
                Вайааламу аннама ғанимтум мин шайин фаанна лиллаҳи хумусаҳу валилррасули валисий алқурба ваалйатама ваалмасакийни вайбни ассабийли ин кунтум амантум биаллааҳи вама анзална ааала ааабдина йаума алфурқани йаума илтақа алжамааани вааллааҳу ааала кулли шайин қадийрун
                Ис антум биалааудвати аддунйа ваҳум биалааудвати алқусва ваалрракбу асфала минкум валау тауаааадтум лайхталафтум фий алмийааади валакин лийақдийа аллааҳу амран кана мафааулан лийаҳлика ман ҳалака ааан баййинатин вайаҳйа ман ҳаййа ааан баййинатин вайнна аллааҳа ласамийааун ааалиймун
                Ис йурийкаҳуму аллааҳу фий манамика қалийлан валау аракаҳум касийран лафашилтум валатаназааатум фий аламри валакинна аллааҳа саллама иннаҳу ааалиймун бисати ассудури
                Вайс йурийкумуҳум иси илтақайтум фий ааайуникум қалийлан вайуқаллилукум фий ааайуниҳим лийақдийа аллааҳу амран кана мафааулан вайла аллааҳи туржааау аломуру
                Йа аййуҳа аллазийна аману иса лақийтум фиатан фаосбуту ваоскуру аллааҳа касийран лааааллакум туфлиҳуна
                Ваатийаау аллааҳа варасулаҳу вала таназааау фатафшалу ватасҳаба рийҳукум вайсбиру инна аллааҳа маааа ассабирийна
                Вала такуну кааллазийна харажу мин дийариҳим батаран вариаа аннаси вайасуддуна ааан сабийли аллааҳи вааллааҳу бима йааамалуна муҳийтун
                Вайс заййана лаҳуму ашшайтану ааамалаҳум вақала ла ғалиба лакуму алйаума мина аннаси вайнний жарун лакум фаламма тараати алфиатани накаса ааала ааақибайҳи вақала инний барийон минкум инний ара ма ла тарауна инний ахафу аллааҳа вааллааҳу шадийду алааиқаби
                Ис йақулу алмунафиқуна вааллазийна фий қулубиҳим марадун ғарра ҳаолай дийнуҳум ваман йатауаккал ааала аллааҳи файнна аллааҳа ааазийзун ҳакиймун
                Валау тара ис йатауаффа аллазийна кафару алмалайкату йадрибуна вужуҳаҳум ваадбароҳум васуқу ааасаба алҳарийқи
                Салика бима қаддамат айдийкум ваанна аллааҳа лайса бисалламин лилааабийди
                Кадаби али фирааауна вааллазийна мин қаблиҳим кафару биайати аллааҳи фаахасаҳуму аллааҳу бисунубиҳим инна аллааҳа қауиййун шадийду алааиқаби
                Салика бианна аллааҳа лам йаку муғаййиран ниааматан анааамаҳа ааала қаумин ҳатта йуғаййиру ма бианфусиҳим ваанна аллааҳа самийааун ааалиймун
                Кадаби али фирааауна вааллазийна мин қаблиҳим кассабу биайати роббиҳим фааҳлакнаҳум бисунубиҳим ваағрақна ала фирааауна вакуллун кану салимийна
                Инна шарра аддауабби ааинда аллааҳи аллазийна кафару фаҳум ла йуминуна
                Аллазийна аааҳадта минҳум сумма йанқудуна аааҳдаҳум фий кулли марратин ваҳум ла йаттақуна
                Файмма тасқафаннаҳум фий алҳарби фашаррид биҳим ман халфаҳум лааааллааҳум йассаккаруна
                Ваймма тахафанна мин қаумин хийанатан файнбис илайҳим ааала сауайн инна аллааҳа ла йуҳиббу алхайнийна
                Вала йаҳсабанна аллазийна кафару сабақу иннаҳум ла йуаажизуна
                Вааааидду лаҳум ма истатааатум мин қувватин вамин рибати алхайли турҳибуна биҳи ааадувва аллааҳи ваааадуввакум ваахарийна мин дуниҳим ла таааламунаҳуму аллааҳу йаааламуҳум вама тунфиқу мин шайин фий сабийли аллааҳи йуваффа илайкум ваантум ла тусламуна
                Вайн жанаҳу лилссалми файжнаҳ лаҳа ватауаккал ааала аллааҳи иннаҳу ҳува ассамийаау алааалийму
                Вайн йурийду ан йахдаааука файнна ҳасбака аллааҳу ҳува аллазий аййадака бинасриҳи вабиалмуминийна
                Вааллафа байна қулубиҳим лау анфақта ма фий аларди жамийааан ма аллафта байна қулубиҳим валакинна аллааҳа аллафа байнаҳум иннаҳу ааазийзун ҳакиймун
                Йа аййуҳа аннабиййу ҳасбука аллааҳу вамани иттабаааака мина алмуминийна
                Йа аййуҳа аннабиййу ҳарриди алмуминийна ааала алқитали ин йакун минкум ааишруна сабируна йағлибу миатайни вайн йакун минкум миатун йағлибу алфан мина аллазийна кафару бианнаҳум қаумун ла йафқаҳуна
                Алана хаффафа аллааҳу ааанкум ваааалима анна фийкум дааафан файн йакун минкум миатун сабиратун йағлибу миатайни вайн йакун минкум алфун йағлибу алфайни бийсни аллааҳи вааллааҳу маааа ассабирийна
                Ма кана линабиййин ан йакуна лаҳу асра ҳатта йусхина фий аларди турийдуна ааарада аддунйа вааллааҳу йурийду алахирата вааллааҳу ааазийзун ҳакиймун
                Лаула китабун мина аллааҳи сабақа ламассакум фийма ахастум ааасабун ааасиймун
                Факулу мимма ғанимтум ҳалалан таййибан вайттақу аллааҳа инна аллааҳа ғафурун роҳиймун
                Йа аййуҳа аннабиййу қул лиман фий айдийкум мина аласра ин йааалами аллааҳу фий қулубикум хайран йутикум хайран мимма охиса минкум вайағфир лакум вааллааҳу ғафурун роҳиймун
                Вайн йурийду хийанатака фақад хану аллааҳа мин қаблу фаамкана минҳум вааллааҳу ааалиймун ҳакиймун
                Инна аллазийна аману ваҳажару важаҳаду биамвалиҳим ваанфусиҳим фий сабийли аллааҳи вааллазийна ауау ванасару олайка бааадуҳум аулийао бааадин вааллазийна аману валам йуҳажиру ма лакум мин валайатиҳим мин шайин ҳатта йуҳажиру вайни истансарукум фий аддийни фаааалайкуму аннасру илла ааала қаумин байнакум вабайнаҳум мийсақун вааллааҳу бима тааамалуна басийрун
                Вааллазийна кафару бааадуҳум аулийао бааадин илла тафааалуҳу такун фитнатун фий аларди вафасадун кабийрун
                Вааллазийна аману ваҳажару важаҳаду фий сабийли аллааҳи вааллазийна ауау ванасару олайка ҳуму алмуминуна ҳаққан лаҳум мағфиратун варизқун кариймун
                Вааллазийна аману мин баааду ваҳажару важаҳаду маааакум фаолайка минкум ваолу аларҳами бааадуҳум аула бибааадин фий китаби аллааҳи инна аллааҳа бикулли шайин ааалиймун
            """.trimIndent(),
        ),
        Surah(
            id = 9,
            arabicName = "التوبة",
            latinName = "At-Tawbah",
            transliteration = """
                Бараатун мина аллааҳи варасулиҳи ила аллазийна аааҳадтум мина алмушрикийна
                Фасийҳу фий аларди арбаааата ашҳурин вайааламу аннакум ғайру муаажизий аллааҳи ваанна аллааҳа мухзий алкафирийна
                Ваасанун мина аллааҳи варасулиҳи ила аннаси йаума алҳажжи алакбари анна аллааҳа барийон мина алмушрикийна варасулуҳу файн тубтум фаҳува хайрун лакум вайн тауаллайтум файааламу аннакум ғайру муаажизий аллааҳи вабашшири аллазийна кафару биааасабин алиймин
                Илла аллазийна аааҳадтум мина алмушрикийна сумма лам йанқусукум шайан валам йусаҳиру ааалайкум аҳадан фаатимму илайҳим аааҳдаҳум ила муддатиҳим инна аллааҳа йуҳиббу алмуттақийна
                Файса инсалаха алашҳуру алҳуруму фаоқтулу алмушрикийна ҳайсу важадтумуҳум вахусуҳум ваоҳсуруҳум ваоқаауду лаҳум кулла марсадин файн табу ваақаму ассалата ваатауу аззаката фахаллу сабийлаҳум инна аллааҳа ғафурун роҳиймун
                Вайн аҳадун мина алмушрикийна истажарака фаажирҳу ҳатта йасмаааа калама аллааҳи сумма аблиғҳу маманаҳу салика бианнаҳум қаумун ла йаааламуна
                Кайфа йакуну лилмушрикийна аааҳдун ааинда аллааҳи вааайнда расулиҳи илла аллазийна аааҳадтум ааинда алмасжиди алҳарами фама истақаму лакум файстақийму лаҳум инна аллааҳа йуҳиббу алмуттақийна
                Кайфа вайн йасҳару ааалайкум ла йарқубу фийкум иллан вала симматан йурдунакум биафваҳиҳим ватаба қулубуҳум вааксаруҳум фасиқуна
                Иштарау биайати аллааҳи саманан қалийлан фасадду ааан сабийлиҳи иннаҳум саа ма кану йааамалуна
                Ла йарқубуна фий муминин иллан вала симматан ваолайка ҳуму алмуаатадуна
                Файн табу ваақаму ассалата ваатауу аззаката файхванукум фий аддийни вануфассилу алайати лиқаумин йаааламуна
                Вайн накасу айманаҳум мин бааади аааҳдиҳим ватаааану фий дийникум фақатилу айммата алкуфри иннаҳум ла аймана лаҳум лааааллааҳум йантаҳуна
                Ала туқатилуна қауман накасу айманаҳум ваҳамму бийхражи аррасули ваҳум бадаукум аувала марратин атахшаунаҳум фааллааҳу аҳаққу ан тахшауҳу ин кунтум муминийна
                Қатилуҳум йуааассибҳуму аллааҳу биайдийкум вайухзиҳим вайансуркум ааалайҳим вайашфи судура қаумин муминийна
                Вайусҳиб ғайса қулубиҳим вайатубу аллааҳу ааала ман йашао вааллааҳу ааалиймун ҳакиймун
                Ам ҳасибтум ан тутраку валамма йааалами аллааҳу аллазийна жаҳаду минкум валам йаттахису мин дуни аллааҳи вала расулиҳи вала алмуминийна валийжатан вааллааҳу хабийрун бима тааамалуна
                Ма кана лилмушрикийна ан йааамуру масажида аллааҳи шаҳидийна ааала анфусиҳим биалкуфри олайка ҳабитат ааамалуҳум вафий аннари ҳум халидуна
                Иннама йааамуру масажида аллааҳи ман амана биаллааҳи ваалйауми алахири ваақама ассалата ваата аззаката валам йахша илла аллааҳа фааааса олайка ан йакуну мина алмуҳтадийна
                Ажаааалтум сиқайата алҳажжи ваааймарата алмасжиди алҳарами каман амана биаллааҳи ваалйауми алахири важаҳада фий сабийли аллааҳи ла йастаууна ааинда аллааҳи вааллааҳу ла йаҳдий алқаума ассалимийна
                Аллазийна аману ваҳажару важаҳаду фий сабийли аллааҳи биамвалиҳим ваанфусиҳим ааасаму даражатан ааинда аллааҳи ваолайка ҳуму алфайзуна
                Йубашшируҳум роббуҳум бироҳматин минҳу варидванин важаннатин лаҳум фийҳа наааиймун муқиймун
                Халидийна фийҳа абадан инна аллааҳа ааиндаҳу ажрун ааасиймун
                Йа аййуҳа аллазийна аману ла таттахису абаакум вайхванакум аулийаа ини истаҳаббу алкуфра ааала алиймани ваман йатауаллааҳум минкум фаолайка ҳуму ассалимуна
                Қул ин кана абаокум ваабнаокум вайхванукум ваазважукум ваааашийратукум ваамвалун иқтарафтумуҳа ватижаратун тахшауна касадаҳа вамасакину тардаунаҳа аҳабба илайкум мина аллааҳи варасулиҳи важиҳадин фий сабийлиҳи фатароббасу ҳатта йатийа аллааҳу биамриҳи вааллааҳу ла йаҳдий алқаума алфасиқийна
                Лақад насаракуму аллааҳу фий мауатина касийратин вайаума ҳунайнин ис ааажабаткум касратукум фалам туғни ааанкум шайан вадақат ааалайкуму аларду бима роҳубат сумма валлайтум мудбирийна
                Сумма анзала аллааҳу сакийнатаҳу ааала расулиҳи ваааала алмуминийна ваанзала жунудан лам тарауҳа ваааассаба аллазийна кафару васалика жазао алкафирийна
                Сумма йатубу аллааҳу мин бааади салика ааала ман йашао вааллааҳу ғафурун роҳиймун
                Йа аййуҳа аллазийна аману иннама алмушрикуна нажасун фала йақробу алмасжида алҳарама бааада ааамиҳим ҳаса вайн хифтум ааайлатан фасауфа йуғнийкуму аллааҳу мин фадлиҳи ин шаа инна аллааҳа ааалиймун ҳакиймун
                Қатилу аллазийна ла йуминуна биаллааҳи вала биалйауми алахири вала йуҳарримуна ма ҳаррама аллааҳу варасулуҳу вала йадийнуна дийна алҳаққи мина аллазийна уту алкитаба ҳатта йуаату алжизйата ааан йадин ваҳум сағируна
                Вақалати алйаҳуду ааузайрун ибну аллааҳи вақалати аннасара алмасийҳу ибну аллааҳи салика қаулуҳум биафваҳиҳим йудаҳиуна қаула аллазийна кафару мин қаблу қаталаҳуму аллааҳу анна йуфакуна
                Иттахасу аҳбароҳум варуҳбанаҳум арбабан мин дуни аллааҳи ваалмасийҳа ибна марйама вама омиру илла лийааабуду илаҳан ваҳидан ла илаҳа илла ҳува субҳанаҳу ааамма йушрикуна
                Йурийдуна ан йутфиу нура аллааҳи биафваҳиҳим вайаба аллааҳу илла ан йутимма нуроҳу валау кариҳа алкафируна
                Ҳува аллазий арсала расулаҳу биалҳуда вадийни алҳаққи лийусҳироҳу ааала аддийни куллиҳи валау кариҳа алмушрикуна
                Йа аййуҳа аллазийна аману инна касийран мина алаҳбари ваалрруҳбани лайакулуна амвала аннаси биалбатили вайасуддуна ааан сабийли аллааҳи вааллазийна йакнизуна ассаҳаба ваалфиддата вала йунфиқунаҳа фий сабийли аллааҳи фабашширҳум биааасабин алиймин
                Йаума йуҳма ааалайҳа фий нари жаҳаннама фатуква биҳа жибаҳуҳум важунубуҳум васуҳуруҳум ҳаса ма каназтум лианфусикум фасуқу ма кунтум такнизуна
                Инна ааиддата ашшуҳури ааинда аллааҳи исна ааашара шаҳран фий китаби аллааҳи йаума халақа ассамауати вааларда минҳа арбаааатун ҳурумун салика аддийну алқаййиму фала таслиму фийҳинна анфусакум вақатилу алмушрикийна каффатан кама йуқатилунакум каффатан вайааламу анна аллааҳа маааа алмуттақийна
                Иннама аннасийо зийадатун фий алкуфри йудаллу биҳи аллазийна кафару йуҳиллунаҳу аааман вайуҳарримунаҳу аааман лийуватиу ааиддата ма ҳаррама аллааҳу файуҳиллу ма ҳаррама аллааҳу зуййина лаҳум суо ааамалиҳим вааллааҳу ла йаҳдий алқаума алкафирийна
                Йа аййуҳа аллазийна аману ма лакум иса қийла лакуму инфиру фий сабийли аллааҳи иссақалтум ила аларди арадийтум биалҳайати аддунйа мина алахирати фама матааау алҳайати аддунйа фий алахирати илла қалийлун
                Илла танфиру йуааассибкум ааасабан алийман вайастабдил қауман ғайракум вала тадурруҳу шайан вааллааҳу ааала кулли шайин қадийрун
                Илла тансуруҳу фақад насароҳу аллааҳу ис ахражаҳу аллазийна кафару санийа иснайни ис ҳума фий алғари ис йақулу лисаҳибиҳи ла таҳзан инна аллааҳа маааана фаанзала аллааҳу сакийнатаҳу ааалайҳи вааййадаҳу бижунудин лам тарауҳа важаааала калимата аллазийна кафару ассуфла вакалимату аллааҳи ҳийа алааулйа вааллааҳу ааазийзун ҳакиймун
                Инфиру хифафан васиқалан важаҳиду биамваликум ваанфусикум фий сабийли аллааҳи саликум хайрун лакум ин кунтум таааламуна
                Лау кана ааарадан қарийбан васафаран қасидан лайттабаааука валакин баааудат ааалайҳиму ашшуққату васайаҳлифуна биаллааҳи лауи истатааана лахаражна маааакум йуҳликуна анфусаҳум вааллааҳу йаааламу иннаҳум лакасибуна
                Ааафа аллааҳу ааанка лима асинта лаҳум ҳатта йатабаййана лака аллазийна садақу ватааалама алкасибийна
                Ла йастасинука аллазийна йуминуна биаллааҳи ваалйауми алахири ан йужаҳиду биамвалиҳим ваанфусиҳим вааллааҳу ааалиймун биалмуттақийна
                Иннама йастасинука аллазийна ла йуминуна биаллааҳи ваалйауми алахири вайртабат қулубуҳум фаҳум фий райбиҳим йатараддадуна
                Валау араду алхуружа лааааадду лаҳу аауддатан валакин кариҳа аллааҳу инбиааасаҳум фасаббатаҳум вақийла оқаауду маааа алқааайдийна
                Лау харажу фийкум ма задукум илла хабалан валаавдааау хилалакум йабғунакуму алфитната вафийкум саммааауна лаҳум вааллааҳу ааалиймун биалссалимийна
                Лақади ибтағауу алфитната мин қаблу вақаллабу лака аломура ҳатта жаа алҳаққу васаҳара амру аллааҳи ваҳум кариҳуна
                Ваминҳум ман йақулу исан лий вала тафтинний ала фий алфитнати сақату вайнна жаҳаннама ламуҳийтатун биалкафирийна
                Ин тусибка ҳасанатун тасуҳум вайн тусибка мусийбатун йақулу қад ахасна амрана мин қаблу вайатауаллау ваҳум фариҳуна
                Қул лан йусийбана илла ма катаба аллааҳу лана ҳува маулана ваааала аллааҳи фалйатауаккали алмуминуна
                Қул ҳал тароббасуна бина илла иҳда алҳуснайайни ванаҳну натароббасу бикум ан йусийбакуму аллааҳу биааасабин мин ааиндиҳи ау биайдийна фатароббасу инна маааакум мутароббисуна
                Қул анфиқу тауааан ау карҳан лан йутақаббала минкум иннакум кунтум қауман фасиқийна
                Вама манааааҳум ан туқбала минҳум нафақатуҳум илла аннаҳум кафару биаллааҳи вабирасулиҳи вала йатуна ассалата илла ваҳум кусала вала йунфиқуна илла ваҳум кариҳуна
                Фала туаажибка амвалуҳум вала ауладуҳум иннама йурийду аллааҳу лийуааассибаҳум биҳа фий алҳайати аддунйа ватазҳақа анфусуҳум ваҳум кафируна
                Вайаҳлифуна биаллааҳи иннаҳум ламинкум вама ҳум минкум валакиннаҳум қаумун йафрақуна
                Лау йажидуна малжаан ау мағаратин ау муддахалан лауаллау илайҳи ваҳум йажмаҳуна
                Ваминҳум ман йалмизука фий ассадақати файн оаату минҳа раду вайн лам йуаатау минҳа иса ҳум йасхатуна
                Валау аннаҳум раду ма атаҳуму аллааҳу варасулуҳу вақалу ҳасбуна аллааҳу сайутийна аллааҳу мин фадлиҳи варасулуҳу инна ила аллааҳи рағибуна
                Иннама ассадақату лилфуқарай ваалмасакийни ваалааамилийна ааалайҳа ваалмуаллафати қулубуҳум вафий арриқаби ваалғаримийна вафий сабийли аллааҳи вайбни ассабийли фарийдатан мина аллааҳи вааллааҳу ааалиймун ҳакиймун
                Ваминҳуму аллазийна йусуна аннабиййа вайақулуна ҳува осунун қул осуну хайрин лакум йумину биаллааҳи вайумину лилмуминийна вароҳматун лиллазийна аману минкум вааллазийна йусуна расула аллааҳи лаҳум ааасабун алиймун
                Йаҳлифуна биаллааҳи лакум лийурдукум вааллааҳу варасулуҳу аҳаққу ан йурдуҳу ин кану муминийна
                Алам йаааламу аннаҳу ман йуҳадиди аллааҳа варасулаҳу фаанна лаҳу нара жаҳаннама халидан фийҳа салика алхизйу алааасийму
                Йаҳсару алмунафиқуна ан туназзала ааалайҳим суратун тунаббиоҳум бима фий қулубиҳим қули истаҳзиу инна аллааҳа мухрижун ма таҳсаруна
                Валайн саалтаҳум лайақулунна иннама кунна нахуду ваналааабу қул абиаллааҳи ваайатиҳи варасулиҳи кунтум тастаҳзиуна
                Ла тааатасиру қад кафартум бааада ийманикум ин нааафу ааан тайфатин минкум нуааассиб тайфатан бианнаҳум кану мужримийна
                Алмунафиқуна ваалмунафиқату бааадуҳум мин бааадин йамуруна биалмункари вайанҳауна ааани алмаааруфи вайақбидуна айдийаҳум насу аллааҳа фанасийаҳум инна алмунафиқийна ҳуму алфасиқуна
                Ваааада аллааҳу алмунафиқийна ваалмунафиқати ваалкуффара нара жаҳаннама халидийна фийҳа ҳийа ҳасбуҳум валаааанаҳуму аллааҳу валаҳум ааасабун муқиймун
                Кааллазийна мин қабликум кану ашадда минкум қувватан вааксара амвалан ваавладан файстамтааау бихалақиҳим файстамтааатум бихалақикум кама истамтаааа аллазийна мин қабликум бихалақиҳим вахудтум кааллазий хаду олайка ҳабитат ааамалуҳум фий аддунйа ваалахирати ваолайка ҳуму алхасируна
                Алам йатиҳим набао аллазийна мин қаблиҳим қауми нуҳин ваааадин васамуда вақауми иброҳийма ваашаби мадйана ваалмутафикати атасум русулуҳум биалбаййинати фама кана аллааҳу лийаслимаҳум валакин кану анфусаҳум йаслимуна
                Ваалмуминуна ваалмуминату бааадуҳум аулийао бааадин йамуруна биалмаааруфи вайанҳауна ааани алмункари вайуқиймуна ассалата вайутуна аззаката вайутийаауна аллааҳа варасулаҳу олайка сайарҳамуҳуму аллааҳу инна аллааҳа ааазийзун ҳакиймун
                Ваааада аллааҳу алмуминийна ваалмуминати жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа вамасакина таййибатан фий жаннати аааднин варидванун мина аллааҳи акбару салика ҳува алфаузу алааасийму
                Йа аййуҳа аннабиййу жаҳиди алкуффара ваалмунафиқийна ваоғлус ааалайҳим вамауаҳум жаҳаннаму вабиса алмасийру
                Йаҳлифуна биаллааҳи ма қалу валақад қалу калимата алкуфри вакафару бааада исламиҳим ваҳамму бима лам йаналу вама нақаму илла ан ағнаҳуму аллааҳу варасулуҳу мин фадлиҳи файн йатубу йаку хайран лаҳум вайн йатауаллау йуааассибҳуму аллааҳу ааасабан алийман фий аддунйа ваалахирати вама лаҳум фий аларди мин валиййин вала насийрин
                Ваминҳум ман аааҳада аллааҳа лайн атана мин фадлиҳи ланассаддақанна валанакунанна мина ассалиҳийна
                Фаламма атаҳум мин фадлиҳи бахилу биҳи ватауаллау ваҳум муааридуна
                Фаааақабаҳум нифақан фий қулубиҳим ила йауми йалқаунаҳу бима ахлафу аллааҳа ма ваааадуҳу вабима кану йаксибуна
                Алам йаааламу анна аллааҳа йаааламу сирроҳум ванажваҳум ваанна аллааҳа ааалламу алғуйуби
                Аллазийна йалмизуна алмуттаувиааийна мина алмуминийна фий ассадақати вааллазийна ла йажидуна илла жуҳдаҳум файасхаруна минҳум сахира аллааҳу минҳум валаҳум ааасабун алиймун
                Истағфир лаҳум ау ла тастағфир лаҳум ин тастағфир лаҳум сабааийна марратан фалан йағфира аллааҳу лаҳум салика бианнаҳум кафару биаллааҳи варасулиҳи вааллааҳу ла йаҳдий алқаума алфасиқийна
                Фариҳа алмухаллафуна бимақааадиҳим хилафа расули аллааҳи вакариҳу ан йужаҳиду биамвалиҳим ваанфусиҳим фий сабийли аллааҳи вақалу ла танфиру фий алҳарри қул нару жаҳаннама ашадду ҳарран лау кану йафқаҳуна
                Фалйазаку қалийлан валйабку касийран жазаан бима кану йаксибуна
                Файн ражаааака аллааҳу ила тайфатин минҳум файстасанука лилхуружи фақул лан тахружу маааййа абадан валан туқатилу маааййа ааадувван иннакум радийтум биалқуаауди аувала марратин фаоқаауду маааа алхалифийна
                Вала тусалли ааала аҳадин минҳум мата абадан вала тақум ааала қабриҳи иннаҳум кафару биаллааҳи варасулиҳи вамату ваҳум фасиқуна
                Вала туаажибка амвалуҳум ваавладуҳум иннама йурийду аллааҳу ан йуааассибаҳум биҳа фий аддунйа ватазҳақа анфусуҳум ваҳум кафируна
                Вайса онзилат суратун ан амину биаллааҳи важаҳиду маааа расулиҳи истасанака олу аттаули минҳум вақалу сарна накун маааа алқааайдийна
                Раду биан йакуну маааа алхауалифи ватубиааа ааала қулубиҳим фаҳум ла йафқаҳуна
                Лакини аррасулу вааллазийна аману мааааҳу жаҳаду биамвалиҳим ваанфусиҳим ваолайка лаҳуму алхайрату ваолайка ҳуму алмуфлиҳуна
                Аааадда аллааҳу лаҳум жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа салика алфаузу алааасийму
                Важаа алмуааассируна мина алааароби лийусана лаҳум вақаааада аллазийна касабу аллааҳа варасулаҳу сайусийбу аллазийна кафару минҳум ааасабун алиймун
                Лайса ааала аддуааафай вала ааала алмарда вала ааала аллазийна ла йажидуна ма йунфиқуна ҳаражун иса насаҳу лиллаҳи варасулиҳи ма ааала алмуҳсинийна мин сабийлин вааллааҳу ғафурун роҳиймун
                Вала ааала аллазийна иса ма атаука литаҳмилаҳум қулта ла ажиду ма аҳмилукум ааалайҳи тауаллау ваааайунуҳум тафийду мина аддамааи ҳазанан алла йажиду ма йунфиқуна
                Иннама ассабийлу ааала аллазийна йастасинунака ваҳум ағнийао раду биан йакуну маааа алхауалифи ватабаааа аллааҳу ааала қулубиҳим фаҳум ла йаааламуна
                Йааатасируна илайкум иса ражааатум илайҳим қул ла тааатасиру лан нумина лакум қад наббаана аллааҳу мин ахбарикум васайара аллааҳу ааамалакум варасулуҳу сумма тураддуна ила ааалими алғайби ваалшшаҳадати файунаббиокум бима кунтум тааамалуна
                Сайаҳлифуна биаллааҳи лакум иса инқалабтум илайҳим литуаариду ааанҳум фаааариду ааанҳум иннаҳум рижсун вамауаҳум жаҳаннаму жазаан бима кану йаксибуна
                Йаҳлифуна лакум литардау ааанҳум файн тардау ааанҳум файнна аллааҳа ла йарда ааани алқауми алфасиқийна
                Алаааробу ашадду куфран ванифақан вааждару алла йаааламу ҳудуда ма анзала аллааҳу ааала расулиҳи вааллааҳу ааалиймун ҳакиймун
                Вамина алааароби ман йаттахису ма йунфиқу мағраман вайатароббасу бикуму аддауайра ааалайҳим дайрату ассауи вааллааҳу самийааун ааалиймун
                Вамина алааароби ман йумину биаллааҳи ваалйауми алахири вайаттахису ма йунфиқу қурубатин ааинда аллааҳи васалауати аррасули ала иннаҳа қурбатун лаҳум сайудхилуҳуму аллааҳу фий роҳматиҳи инна аллааҳа ғафурун роҳиймун
                Ваалссабиқуна алаувалуна мина алмуҳажирийна ваалансари вааллазийна иттабааауҳум бийҳсанин радийа аллааҳу ааанҳум вараду ааанҳу вааааадда лаҳум жаннатин тажрий таҳтаҳа аланҳару халидийна фийҳа абадан салика алфаузу алааасийму
                Вамимман ҳаулакум мина алааароби мунафиқуна вамин аҳли алмадийнати мараду ааала аннифақи ла таааламуҳум наҳну наааламуҳум сануааассибуҳум марратайни сумма йураддуна ила ааасабин ааасиймин
                Ваахаруна иаатарафу бисунубиҳим халату ааамалан салиҳан ваахара саййиан аааса аллааҳу ан йатуба ааалайҳим инна аллааҳа ғафурун роҳиймун
                Хус мин амвалиҳим садақатан тутаҳҳируҳум ватузаккийҳим биҳа васалли ааалайҳим инна салатака саканун лаҳум вааллааҳу самийааун ааалиймун
                Алам йаааламу анна аллааҳа ҳува йақбалу аттаубата ааан ааибадиҳи вайахусу ассадақати ваанна аллааҳа ҳува аттаувабу арроҳийму
                Вақули иаамалу фасайара аллааҳу ааамалакум варасулуҳу ваалмуминуна васатураддуна ила ааалими алғайби ваалшшаҳадати файунаббиокум бима кунтум тааамалуна
                Ваахаруна муржауна лиамри аллааҳи имма йуааассибуҳум ваймма йатубу ааалайҳим вааллааҳу ааалиймун ҳакиймун
                Вааллазийна иттахасу масжидан дираран вакуфран ватафрийқан байна алмуминийна вайрсадан лиман ҳароба аллааҳа варасулаҳу мин қаблу валайаҳлифунна ин арадна илла алҳусна вааллааҳу йашҳаду иннаҳум лакасибуна
                Ла тақум фийҳи абадан ламасжидун оссиса ааала аттақва мин аували йаумин аҳаққу ан тақума фийҳи фийҳи рижалун йуҳиббуна ан йататаҳҳару вааллааҳу йуҳиббу алмуттаҳҳирийна
                Афаман ассаса бунйанаҳу ааала тақва мина аллааҳи варидванин хайрун ам ман ассаса бунйанаҳу ааала шафа журуфин ҳарин файнҳара биҳи фий нари жаҳаннама вааллааҳу ла йаҳдий алқаума ассалимийна
                Ла йазалу бунйануҳуму аллазий банау рийбатан фий қулубиҳим илла ан тақаттаааа қулубуҳум вааллааҳу ааалиймун ҳакиймун
                Инна аллааҳа иштара мина алмуминийна анфусаҳум ваамвалаҳум бианна лаҳуму алжанната йуқатилуна фий сабийли аллааҳи файақтулуна вайуқталуна вааадан ааалайҳи ҳаққан фий аттаурати ваалинжийли ваалқурани ваман ауфа биаааҳдиҳи мина аллааҳи файстабширу бибайааикуму аллазий байааатум биҳи васалика ҳува алфаузу алааасийму
                Аттайбуна алааабидуна алҳамидуна ассайҳуна арракиаауна ассажидуна аламируна биалмаааруфи ваалннаҳуна ааани алмункари ваалҳафисуна лиҳудуди аллааҳи вабашшири алмуминийна
                Ма кана лилннабиййи вааллазийна аману ан йастағфиру лилмушрикийна валау кану олий қурба мин бааади ма табаййана лаҳум аннаҳум ашабу алжаҳийми
                Вама кана истиғфару иброҳийма лиабийҳи илла ааан мауааидатин ваааадаҳа иййаҳу фаламма табаййана лаҳу аннаҳу ааадуввун лиллаҳи табарраа минҳу инна иброҳийма лаавваҳун ҳалиймун
                Вама кана аллааҳу лийудилла қауман бааада ис ҳадаҳум ҳатта йубаййина лаҳум ма йаттақуна инна аллааҳа бикулли шайин ааалиймун
                Инна аллааҳа лаҳу мулку ассамауати вааларди йуҳйий вайумийту вама лакум мин дуни аллааҳи мин валиййин вала насийрин
                Лақад таба аллааҳу ааала аннабиййи ваалмуҳажирийна ваалансари аллазийна иттабааауҳу фий саааати алааусрати мин бааади ма када йазийғу қулубу фарийқин минҳум сумма таба ааалайҳим иннаҳу биҳим рауфун роҳиймун
                Ваааала ассаласати аллазийна хуллифу ҳатта иса дақат ааалайҳиму аларду бима роҳубат вадақат ааалайҳим анфусуҳум васанну ан ла малжаа мина аллааҳи илла илайҳи сумма таба ааалайҳим лийатубу инна аллааҳа ҳува аттаувабу арроҳийму
                Йа аййуҳа аллазийна аману иттақу аллааҳа вакуну маааа ассадиқийна
                Ма кана лиаҳли алмадийнати ваман ҳаулаҳум мина алааароби ан йатахаллафу ааан расули аллааҳи вала йарғабу бианфусиҳим ааан нафсиҳи салика бианнаҳум ла йусийбуҳум самаон вала насабун вала махмасатун фий сабийли аллааҳи вала йатауна маутиан йағийсу алкуффара вала йаналуна мин ааадуввин найлан илла кутиба лаҳум биҳи ааамалун салиҳун инна аллааҳа ла йудийаау ажра алмуҳсинийна
                Вала йунфиқуна нафақатан сағийратан вала кабийратан вала йақтааауна вадийан илла кутиба лаҳум лийажзийаҳуму аллааҳу аҳсана ма кану йааамалуна
                Вама кана алмуминуна лийанфиру каффатан фалаула нафара мин кулли фирқатин минҳум тайфатун лийатафаққаҳу фий аддийни валийунсиру қаумаҳум иса ражааау илайҳим лааааллааҳум йаҳсаруна
                Йа аййуҳа аллазийна аману қатилу аллазийна йалунакум мина алкуффари валйажиду фийкум ғилсатан вайааламу анна аллааҳа маааа алмуттақийна
                Вайса ма онзилат суратун фаминҳум ман йақулу аййукум задасу ҳасиҳи ийманан фаамма аллазийна аману фазадасум ийманан ваҳум йастабшируна
                Ваамма аллазийна фий қулубиҳим марадун фазадасум рижсан ила рижсиҳим вамату ваҳум кафируна
                Ауала йарауна аннаҳум йуфтануна фий кулли ааамин марратан ау марратайни сумма ла йатубуна вала ҳум йассаккаруна
                Вайса ма онзилат суратун насара бааадуҳум ила бааадин ҳал йаракум мин аҳадин сумма инсарафу сарафа аллааҳу қулубаҳум бианнаҳум қаумун ла йафқаҳуна
                Лақад жаакум расулун мин анфусикум ааазийзун ааалайҳи ма аааниттум ҳарийсун ааалайкум биалмуминийна рауфун роҳиймун
                Файн тауаллау фақул ҳасбийа аллааҳу ла илаҳа илла ҳува ааалайҳи тауаккалту ваҳува роббу алааарши алааасийми
            """.trimIndent(),
        ),
        Surah(
            id = 10,
            arabicName = "يونس",
            latinName = "Yunus",
            transliteration = """
                Алифламра тилка айату алкитаби алҳакийми
                Акана лилннаси ааажабан ан ауҳайна ила ражулин минҳум ан ансири аннаса вабашшири аллазийна аману анна лаҳум қадама сидқин ааинда роббиҳим қала алкафируна инна ҳаса ласаҳирун мубийнун
                Инна роббакуму аллааҳу аллазий халақа ассамауати вааларда фий ситтати аййамин сумма истауа ааала алааарши йудаббиру аламра ма мин шафийааин илла мин бааади исниҳи саликуму аллааҳу роббукум фаоаабудуҳу афала тасаккаруна
                Илайҳи маржиааукум жамийааан вааада аллааҳи ҳаққан иннаҳу йабдао алхалқа сумма йуааийдуҳу лийажзийа аллазийна аману ваааамилу ассалиҳати биалқисти вааллазийна кафару лаҳум шаробун мин ҳамиймин ваааасабун алиймун бима кану йакфуруна
                Ҳува аллазий жаааала ашшамса дийаан ваалқамара нуран вақаддароҳу маназила литаааламу ааадада ассинийна ваалҳисаба ма халақа аллааҳу салика илла биалҳаққи йуфассилу алайати лиқаумин йаааламуна
                Инна фий ихтилафи аллайли ваалннаҳари вама халақа аллааҳу фий ассамауати вааларди лаайатин лиқаумин йаттақуна
                Инна аллазийна ла йаржуна лиқаана вараду биалҳайати аддунйа вайтмаанну биҳа вааллазийна ҳум ааан айатина ғафилуна
                Олайка мауаҳуму аннару бима кану йаксибуна
                Инна аллазийна аману ваааамилу ассалиҳати йаҳдийҳим роббуҳум биийманиҳим тажрий мин таҳтиҳиму аланҳару фий жаннати аннаааийми
                Дааауаҳум фийҳа субҳанака аллааҳумма ватаҳиййатуҳум фийҳа саламун ваахиру дааауаҳум ани алҳамду лиллаҳи робби алаааламийна
                Валау йуааажжилу аллааҳу лилннаси ашшарра истиаажалаҳум биалхайри лақудийа илайҳим ажалуҳум фанасару аллазийна ла йаржуна лиқаана фий туғйаниҳим йааамаҳуна
                Вайса масса алинсана аддурру даааана лижанбиҳи ау қааайдан ау қайман фаламма кашафна ааанҳу дурроҳу марра каан лам йадаауна ила дуррин массаҳу касалика зуййина лилмусрифийна ма кану йааамалуна
                Валақад аҳлакна алқуруна мин қабликум ламма саламу важаасум русулуҳум биалбаййинати вама кану лийумину касалика нажзий алқаума алмужримийна
                Сумма жаааалнакум халайфа фий аларди мин бааадиҳим линансура кайфа тааамалуна
                Вайса тутла ааалайҳим айатуна баййинатин қала аллазийна ла йаржуна лиқаана ити биқуранин ғайри ҳаса ау баддилҳу қул ма йакуну лий ан обаддилаҳу мин тилқай нафсий ин аттабиаау илла ма йуҳа илаййа инний ахафу ин ааасайту роббий ааасаба йаумин ааасиймин
                Қул лау шаа аллааҳу ма талаутуҳу ааалайкум вала адракум биҳи фақад лабисту фийкум ааумуран мин қаблиҳи афала тааақилуна
                Фаман асламу миммани ифтара ааала аллааҳи касибан ау кассаба биайатиҳи иннаҳу ла йуфлиҳу алмужримуна
                Вайааабудуна мин дуни аллааҳи ма ла йадурруҳум вала йанфааауҳум вайақулуна ҳаолай шуфааааона ааинда аллааҳи қул атунаббиуна аллааҳа бима ла йаааламу фий ассамауати вала фий аларди субҳанаҳу ватаааала ааамма йушрикуна
                Вама кана аннасу илла омматан ваҳидатан файхталафу валаула калиматун сабақат мин роббика лақудийа байнаҳум фийма фийҳи йахталифуна
                Вайақулуна лаула онзила ааалайҳи айатун мин роббиҳи фақул иннама алғайбу лиллаҳи файнтасиру инний маааакум мина алмунтасирийна
                Вайса асақна аннаса роҳматан мин бааади дарраа массасум иса лаҳум макрун фий айатина қули аллааҳу асрааау макран инна русулана йактубуна ма тамкуруна
                Ҳува аллазий йусаййирукум фий албарри ваалбаҳри ҳатта иса кунтум фий алфулки важарайна биҳим бирийҳин таййибатин вафариҳу биҳа жааса рийҳун ааасифун важааҳуму алмаужу мин кулли маканин васанну аннаҳум оҳийта биҳим дааааву аллааҳа мухлисийна лаҳу аддийна лайн анжайтана мин ҳасиҳи ланакунанна мина ашшакирийна
                Фаламма анжаҳум иса ҳум йабғуна фий аларди биғайри алҳаққи йа аййуҳа аннасу иннама бағйукум ааала анфусикум матаааа алҳайати аддунйа сумма илайна маржиааукум фанунаббиокум бима кунтум тааамалуна
                Иннама масалу алҳайати аддунйа камайн анзалнаҳу мина ассамай файхталата биҳи набату аларди мимма йакулу аннасу вааланаааму ҳатта иса ахасати аларду зухруфаҳа вайззаййанат васанна аҳлуҳа аннаҳум қадируна ааалайҳа атаҳа амруна лайлан ау наҳаран фажаааалнаҳа ҳасийдан каан лам тағна биаламси касалика нуфассилу алайати лиқаумин йатафаккаруна
                Вааллааҳу йадаау ила дари ассалами вайаҳдий ман йашао ила сиратин мустақиймин
                Лиллазийна аҳсану алҳусна вазийадатун вала йарҳақу вужуҳаҳум қатарун вала силлатун олайка ашабу алжаннати ҳум фийҳа халидуна
                Вааллазийна касабу ассаййиати жазао саййиатин бимислиҳа ватарҳақуҳум силлатун ма лаҳум мина аллааҳи мин ааасимин кааннама оғшийат вужуҳуҳум қитаааан мина аллайли муслиман олайка ашабу аннари ҳум фийҳа халидуна
                Вайаума наҳшуруҳум жамийааан сумма нақулу лиллазийна ашраку маканакум антум вашуракаокум фазаййална байнаҳум вақала шуракаоҳум ма кунтум иййана тааабудуна
                Факафа биаллааҳи шаҳийдан байнана вабайнакум ин кунна ааан ааибадатикум лағафилийна
                Ҳуналика таблу куллу нафсин ма аслафат варудду ила аллааҳи маулаҳуму алҳаққи вадалла ааанҳум ма кану йафтаруна
                Қул ман йарзуқукум мина ассамай вааларди амман йамлику ассамааа ваалабсара ваман йухрижу алҳаййа мина алмаййити вайухрижу алмаййита мина алҳаййи ваман йудаббиру аламра фасайақулуна аллааҳу фақул афала таттақуна
                Фасаликуму аллааҳу роббукуму алҳаққу фамаса бааада алҳаққи илла аддалалу фаанна тусрафуна
                Касалика ҳаққат калимату роббика ааала аллазийна фасақу аннаҳум ла йуминуна
                Қул ҳал мин шуракайкум ман йабдао алхалқа сумма йуааийдуҳу қули аллааҳу йабдао алхалқа сумма йуааийдуҳу фаанна туфакуна
                Қул ҳал мин шуракайкум ман йаҳдий ила алҳаққи қули аллааҳу йаҳдий лилҳаққи афаман йаҳдий ила алҳаққи аҳаққу ан йуттабаааа амман ла йаҳиддий илла ан йуҳда фама лакум кайфа таҳкумуна
                Вама йаттабиаау аксаруҳум илла саннан инна ассанна ла йуғний мина алҳаққи шайан инна аллааҳа ааалиймун бима йафааалуна
                Вама кана ҳаса алқурану ан йуфтара мин дуни аллааҳи валакин тасдийқа аллазий байна йадайҳи ватафсийла алкитаби ла райба фийҳи мин робби алаааламийна
                Ам йақулуна ифтароҳу қул фату бисуратин мислиҳи ваодаау мани истатааатум мин дуни аллааҳи ин кунтум садиқийна
                Бал кассабу бима лам йуҳийту биааилмиҳи валамма йатиҳим тауийлуҳу касалика кассаба аллазийна мин қаблиҳим фаонсур кайфа кана ааақибату ассалимийна
                Ваминҳум ман йумину биҳи ваминҳум ман ла йумину биҳи вароббука аааламу биалмуфсидийна
                Вайн кассабука фақул лий ааамалий валакум ааамалукум антум барийуна мимма ааамалу ваана барийон мимма тааамалуна
                Ваминҳум ман йастамиаауна илайка афаанта тусмиаау ассумма валау кану ла йааақилуна
                Ваминҳум ман йансуру илайка афаанта таҳдий алааумйа валау кану ла йубсируна
                Инна аллааҳа ла йаслиму аннаса шайан валакинна аннаса анфусаҳум йаслимуна
                Вайаума йаҳшуруҳум каан лам йалбасу илла саааатан мина аннаҳари йатаааарафуна байнаҳум қад хасира аллазийна кассабу билиқай аллааҳи вама кану муҳтадийна
                Ваймма нурийаннака бааада аллазий нааайдуҳум ау натауаффайаннака файлайна маржиаауҳум сумма аллааҳу шаҳийдун ааала ма йафааалуна
                Валикулли омматин расулун файса жаа расулуҳум қудийа байнаҳум биалқисти ваҳум ла йусламуна
                Вайақулуна мата ҳаса алваааду ин кунтум садиқийна
                Қул ла амлику линафсий дарран вала нафааан илла ма шаа аллааҳу ликулли омматин ажалун иса жаа ажалуҳум фала йастахируна саааатан вала йастақдимуна
                Қул араайтум ин атакум ааасабуҳу байатан ау наҳаран маса йастааажилу минҳу алмужримуна
                Асумма иса ма вақаааа амантум биҳи алана вақад кунтум биҳи тастааажилуна
                Сумма қийла лиллазийна саламу суқу ааасаба алхулди ҳал тужзауна илла бима кунтум таксибуна
                Вайастанбиунака аҳаққун ҳува қул ий вароббий иннаҳу лаҳаққун вама антум бимуаажизийна
                Валау анна ликулли нафсин саламат ма фий аларди лайфтадат биҳи ваасарру аннадамата ламма рааву алааасаба вақудийа байнаҳум биалқисти ваҳум ла йусламуна
                Ала инна лиллаҳи ма фий ассамауати вааларди ала инна вааада аллааҳи ҳаққун валакинна аксароҳум ла йаааламуна
                Ҳува йуҳйий вайумийту вайлайҳи туржааауна
                Йа аййуҳа аннасу қад жааткум мауааисатун мин роббикум вашифаон лима фий ассудури ваҳудан вароҳматун лилмуминийна
                Қул бифадли аллааҳи вабироҳматиҳи фабисалика фалйафроҳу ҳува хайрун мимма йажмааауна
                Қул араайтум ма анзала аллааҳу лакум мин ризқин фажаааалтум минҳу ҳараман ваҳалалан қул аллааҳу асина лакум ам ааала аллааҳи тафтаруна
                Вама санну аллазийна йафтаруна ааала аллааҳи алкасиба йаума алқийамати инна аллааҳа ласу фадлин ааала аннаси валакинна аксароҳум ла йашкуруна
                Вама такуну фий шанин вама татлу минҳу мин қуранин вала тааамалуна мин ааамалин илла кунна ааалайкум шуҳудан ис туфийдуна фийҳи вама йааазубу ааан роббика мин мисқали сарратин фий аларди вала фий ассамай вала асғара мин салика вала акбара илла фий китабин мубийнун
                Ала инна аулийаа аллааҳи ла хауфун ааалайҳим вала ҳум йаҳзануна
                Аллазийна аману вакану йаттақуна
                Лаҳуму албушра фий алҳайати аддунйа вафий алахирати ла табдийла ликалимати аллааҳи салика ҳува алфаузу алааасийму
                Вала йаҳзунка қаулуҳум инна алааиззата лиллаҳи жамийааан ҳува ассамийаау алааалийму
                Ала инна лиллаҳи ман фий ассамауати ваман фий аларди вама йаттабиаау аллазийна йадаауна мин дуни аллааҳи шуракаа ин йаттабиаауна илла ассанна вайн ҳум илла йахрусуна
                Ҳува аллазий жаааала лакуму аллайла литаскуну фийҳи ваалннаҳара мубсиран инна фий салика лаайатин лиқаумин йасмааауна
                Қалу иттахаса аллааҳу валадан субҳанаҳу ҳува алғаниййу лаҳу ма фий ассамауати вама фий аларди ин ааиндакум мин султанин биҳаса атақулуна ааала аллааҳи ма ла таааламуна
                Қул инна аллазийна йафтаруна ааала аллааҳи алкасиба ла йуфлиҳуна
                Матаааун фий аддунйа сумма илайна маржиаауҳум сумма нусийқуҳуму алааасаба ашшадийда бима кану йакфуруна
                Ваотлу ааалайҳим набаа нуҳин ис қала лиқаумиҳи йа қауми ин кана кабура ааалайкум мақамий ватаскийрий биайати аллааҳи фаааала аллааҳи тауаккалту фаажмиаау амракум вашуракаакум сумма ла йакун амрукум ааалайкум ғумматан сумма иқду илаййа вала тунсируни
                Файн тауаллайтум фама саалтукум мин ажрин ин ажрийа илла ааала аллааҳи ваомирту ан акуна мина алмуслимийна
                Факассабуҳу фанажжайнаҳу ваман мааааҳу фий алфулки важаааалнаҳум халайфа ваағрақна аллазийна кассабу биайатина фаонсур кайфа кана ааақибату алмунсарийна
                Сумма баааасна мин бааадиҳи русулан ила қаумиҳим фажауҳум биалбаййинати фама кану лийумину бима кассабу биҳи мин қаблу касалика натбааау ааала қулуби алмуаатадийна
                Сумма баааасна мин бааадиҳим муса ваҳаруна ила фирааауна вамалайҳи биайатина файстакбару вакану қауман мужримийна
                Фаламма жааҳуму алҳаққу мин ааиндина қалу инна ҳаса ласиҳрун мубийнун
                Қала муса атақулуна лилҳаққи ламма жаакум асиҳрун ҳаса вала йуфлиҳу ассаҳируна
                Қалу ажитана литалфитана ааамма важадна ааалайҳи абаана ватакуна лакума алкибрийао фий аларди вама наҳну лакума бимуминийна
                Вақала фирааауну итуний бикулли саҳирин ааалиймин
                Фаламма жаа ассаҳарату қала лаҳум муса алқу ма антум мулқуна
                Фаламма алқау қала муса ма житум биҳи ассиҳру инна аллааҳа сайубтилуҳу инна аллааҳа ла йуслиҳу ааамала алмуфсидийна
                Вайуҳиққу аллааҳу алҳаққа бикалиматиҳи валау кариҳа алмужримуна
                Фама амана лимуса илла сурриййатун мин қаумиҳи ааала хауфин мин фирааауна вамалайҳим ан йафтинаҳум вайнна фирааауна лаааалин фий аларди вайннаҳу ламина алмусрифийна
                Вақала муса йа қауми ин кунтум амантум биаллааҳи фаааалайҳи тауаккалу ин кунтум муслимийна
                Фақалу ааала аллааҳи тауаккална роббана ла тажааална фитнатан лилқауми ассалимийна
                Ванажжина бироҳматика мина алқауми алкафирийна
                Ваавҳайна ила муса ваахийҳи ан табауваа лиқаумикума бимисра буйутан вайжааалу буйутакум қиблатан ваақийму ассалата вабашшири алмуминийна
                Вақала муса роббана иннака атайта фирааауна вамалааҳу зийнатан ваамвалан фий алҳайати аддунйа роббана лийудиллу ааан сабийлика роббана итмис ааала амвалиҳим ваошдуд ааала қулубиҳим фала йумину ҳатта йарауу алааасаба алалийма
                Қала қад ожийбат дааауатукума файстақийма вала таттабиааанни сабийла аллазийна ла йаааламуна
                Важауазна бибаний исраийла албаҳра фаатбааааҳум фирааауну важунудуҳу бағйан ваааадван ҳатта иса адракаҳу алғарақу қала аманту аннаҳу ла илаҳа илла аллазий аманат биҳи бану исраийла ваана мина алмуслимийна
                Алана вақад ааасайта қаблу вакунта мина алмуфсидийна
                Фаалйаума нунажжийка бибаданика литакуна лиман халфака айатан вайнна касийран мина аннаси ааан айатина лағафилуна
                Валақад баувана баний исраийла мубауваа сидқин варазақнаҳум мина аттаййибати фама ихталафу ҳатта жааҳуму алааилму инна роббака йақдий байнаҳум йаума алқийамати фийма кану фийҳи йахталифуна
                Файн кунта фий шаккин мимма анзалнна илайка файсали аллазийна йақрауна алкитаба мин қаблика лақад жаака алҳаққу мин роббика фала такунанна мина алмумтарийна
                Вала такунанна мина аллазийна кассабу биайати аллааҳи фатакуна мина алхасирийна
                Инна аллазийна ҳаққат ааалайҳим калимату роббика ла йуминуна
                Валау жаасум куллу айатин ҳатта йарауу алааасаба алалийма
                Фалаула канат қарйатун аманат фанафааааҳа иймануҳа илла қаума йунуса ламма аману кашафна ааанҳум ааасаба алхизйи фий алҳайати аддунйа ваматтааанаҳум ила ҳийнин
                Валау шаа роббука лаамана ман фий аларди куллуҳум жамийааан афаанта тукриҳу аннаса ҳатта йакуну муминийна
                Вама кана линафсин ан тумина илла бийсни аллааҳи вайажааалу аррижса ааала аллазийна ла йааақилуна
                Қули онсуру маса фий ассамауати вааларди вама туғний алайату ваалннусуру ааан қаумин ла йуминуна
                Фаҳал йантасируна илла мисла аййами аллазийна халау мин қаблиҳим қул файнтасиру инний маааакум мина алмунтасирийна
                Сумма нунажжий русулана вааллазийна аману касалика ҳаққан ааалайна нунжий алмуминийна
                Қул йа аййуҳа аннасу ин кунтум фий шаккин мин дийний фала ааабуду аллазийна тааабудуна мин дуни аллааҳи валакин ааабуду аллааҳа аллазий йатауаффакум ваомирту ан акуна мина алмуминийна
                Ваан ақим важҳака лилддийни ҳанийфан вала такунанна мина алмушрикийна
                Вала тадаау мин дуни аллааҳи ма ла йанфаааука вала йадуррука файн фаааалта файннака исан мина ассалимийна
                Вайн йамсаска аллааҳу бидуррин фала кашифа лаҳу илла ҳува вайн йуридка бихайрин фала радда лифадлиҳи йусийбу биҳи ман йашао мин ааибадиҳи ваҳува алғафуру арроҳийму
                Қул йа аййуҳа аннасу қад жаакуму алҳаққу мин роббикум фамани иҳтада файннама йаҳтадий линафсиҳи ваман далла файннама йадиллу ааалайҳа вама ана ааалайкум бивакийлин
                Вайттабиаа ма йуҳа илайка вайсбир ҳатта йаҳкума аллааҳу ваҳува хайру алҳакимийна
            """.trimIndent(),
        ),
        Surah(
            id = 11,
            arabicName = "هود",
            latinName = "Hud",
            transliteration = """
                Алифламра китабун оҳкимат айатуҳу сумма фуссилат мин ладун ҳакиймин хабийрин
                Алла тааабуду илла аллааҳа иннаний лакум минҳу насийрун вабашийрун
                Ваани истағфиру роббакум сумма тубу илайҳи йуматтиаакум матаааан ҳасанан ила ажалин мусамман вайути кулла сий фадлин фадлаҳу вайн тауаллау файний ахафу ааалайкум ааасаба йаумин кабийрин
                Ила аллааҳи маржиааукум ваҳува ааала кулли шайин қадийрун
                Ала иннаҳум йаснуна судуроҳум лийастахфу минҳу ала ҳийна йастағшуна сийабаҳум йаааламу ма йусирруна вама йуаалинуна иннаҳу ааалиймун бисати ассудури
                Вама мин даббатин фий аларди илла ааала аллааҳи ризқуҳа вайаааламу мустақарроҳа вамустаудааааҳа куллун фий китабин мубийнин
                Ваҳува аллазий халақа ассамауати вааларда фий ситтати аййамин вакана аааршуҳу ааала алмай лийаблувакум аййукум аҳсану ааамалан валайн қулта иннакум мабааусуна мин бааади алмаути лайақуланна аллазийна кафару ин ҳаса илла сиҳрун мубийнун
                Валайн аххарна ааанҳуму алааасаба ила омматин мааадудатин лайақулунна ма йаҳбисуҳу ала йаума йатийҳим лайса масруфан ааанҳум ваҳақа биҳим ма кану биҳи йастаҳзиуна
                Валайн асақна алинсана минна роҳматан сумма назааанаҳа минҳу иннаҳу лайаусун кафурун
                Валайн асақнаҳу нааамаа бааада дарраа массасу лайақуланна саҳаба ассаййиату ааанний иннаҳу лафариҳун фахурун
                Илла аллазийна сабару ваааамилу ассалиҳати олайка лаҳум мағфиратун ваажрун кабийрун
                Фалааааллака тарикун бааада ма йуҳа илайка вадайқун биҳи садрука ан йақулу лаула онзила ааалайҳи канзун ау жаа мааааҳу малакун иннама анта насийрун вааллааҳу ааала кулли шайин вакийлун
                Ам йақулуна ифтароҳу қул фату биааашри суварин мислиҳи муфтарайатин ваодаау мани истатааатум мин дуни аллааҳи ин кунтум садиқийна
                Фай ллам йастажийбу лакум файааламу аннама онзила биааилми аллааҳи ваан ла илаҳа илла ҳува фаҳал антум муслимуна
                Ман кана йурийду алҳайата аддунйа вазийнатаҳа нуваффи илайҳим ааамалаҳум фийҳа ваҳум фийҳа ла йубхасуна
                Олайка аллазийна лайса лаҳум фий алахирати илла аннару ваҳабита ма санааау фийҳа вабатилун ма кану йааамалуна
                Афаман кана ааала баййинатин мин роббиҳи вайатлуҳу шаҳидун минҳу вамин қаблиҳи китабу муса имаман вароҳматан олайка йуминуна биҳи ваман йакфур биҳи мина алаҳзаби фаалннару мауааидуҳу фала таку фий мирйатин минҳу иннаҳу алҳаққу мин роббика валакинна аксара аннаси ла йуминуна
                Ваман асламу миммани ифтара ааала аллааҳи касибан олайка йуаарадуна ааала роббиҳим вайақулу алашҳаду ҳаолай аллазийна касабу ааала роббиҳим ала лааанату аллааҳи ааала ассалимийна
                Аллазийна йасуддуна ааан сабийли аллааҳи вайабғунаҳа ааиважан ваҳум биалахирати ҳум кафируна
                Олайка лам йакуну муаажизийна фий аларди вама кана лаҳум мин дуни аллааҳи мин аулийаа йудаааафу лаҳуму алааасабу ма кану йастатийаауна ассамааа вама кану йубсируна
                Олайка аллазийна хасиру анфусаҳум вадалла ааанҳум ма кану йафтаруна
                Ла жарама аннаҳум фий алахирати ҳуму алахсаруна
                Инна аллазийна аману ваааамилу алсалиҳати ваахбату ила роббиҳим олайка ашабу алжаннати ҳум фийҳа халидуна
                Масалу алфарийқайни каалааама вааласамми ваалбасийри ваалссамийааи ҳал йастауийани масалан афала тасаккаруна
                Валақад арсална нуҳан ила қаумиҳи инний лакум насийрун мубийнун
                Ан ла тааабуду илла аллааҳа инний ахафу ааалайкум ааасаба йаумин алиймин
                Фақала алмалао аллазийна кафару мин қаумиҳи ма нарака илла башаран мислана вама нарака иттабаааака илла аллазийна ҳум арасилуна бадийа аррайи вама нара лакум ааалайна мин фадлин бал насуннукум касибийна
                Қала йа қауми араайтум ин кунту ааала баййинатин мин роббий ваатаний роҳматан мин ааиндиҳи фааауммийат ааалайкум анулзимукумуҳа ваантум лаҳа кариҳуна
                Вайа қауми ла асалукум ааалайҳи малан ин ажрийа илла ааала аллааҳи вама ана битариди аллазийна аману иннаҳум мулақу роббиҳим валакинний аракум қауман тажҳалуна
                Вайа қауми ман йансуруний мина аллааҳи ин тарадтуҳум афала тасаккаруна
                Вала ақулу лакум ааиндий хазайну аллааҳи вала аааламу алғайба вала ақулу инний малакун вала ақулу лиллазийна таздарий ааайунукум лан йутийаҳуму аллааҳу хайран аллааҳу аааламу бима фий анфусиҳим инний исан ламина ассалимийна
                Қалу йа нуҳу қад жадалтана фааксарта жидалана фатина бима тааайдуна ин кунта мина ассадиқийна
                Қала иннама йатийкум биҳи аллааҳу ин шаа вама антум бимуаажизийна
                Вала йанфаааукум нуший ин арадту ан ансаҳа лакум ин кана аллааҳу йурийду ан йуғвийакум ҳува роббукум вайлайҳи туржааауна
                Ам йақулуна ифтароҳу қул ини ифтарайтуҳу фаааалаййа ижрамий ваана барийон мимма тужримуна
                Вауҳийа ила нуҳин аннаҳу лан йумина мин қаумика илла ман қад амана фала табтайс бима кану йафааалуна
                Вайснааай алфулка биааайунина вауаҳйина вала тухатибний фий аллазийна саламу иннаҳум муғрақуна
                Вайаснааау алфулка вакуллама марра ааалайҳи малаон мин қаумиҳи сахиру минҳу қала ин тасхару минна файнна насхару минкум кама тасхаруна
                Фасауфа таааламуна ман йатийҳи ааасабун йухзийҳи вайаҳиллу ааалайҳи ааасабун муқиймун
                Ҳатта иса жаа амруна вафара аттаннуру қулна иҳмил фийҳа мин куллин заужайни иснайни вааҳлака илла ман сабақа ааалайҳи алқаулу ваман амана вама амана мааааҳу илла қалийлун
                Вақала иркабу фийҳа бисми аллааҳи мажроҳа вамурсаҳа инна роббий лағафурун роҳиймун
                Ваҳийа тажрий биҳим фий маужин каалжибали ванада нуҳуну ибнаҳу вакана фий мааазилин йа бунаййа иркаб маааана вала такун маааа алкафирийна
                Қала саавий ила жабалин йааасимуний мина алмай қала ла ааасима алйаума мин амри аллааҳи илла ман роҳима ваҳала байнаҳума алмаужу факана мина алмуғрақийна
                Вақийла йа арду иблаааий мааки вайа самао ақлиааий вағийда алмао вақудийа аламру вайстауат ааала алжудиййи вақийла буаадан лилқауми ассалимийна
                Ванада нуҳун роббаҳу фақала робби инна ибний мин аҳлий вайнна вааадака алҳаққу ваанта аҳкаму алҳакимийна
                Қала йа нуҳу иннаҳу лайса мин аҳлика иннаҳу ааамалун ғайру салиҳин фала тасални ма лайса лака биҳи ааилмун инний ааайсука ан такуна мина алжаҳилийна
                Қала робби инний аааусу бика ан асалака ма лайса лий биҳи ааилмун вайлла тағфир лий ватарҳамний акун мина алхасирийна
                Қийла йа нуҳу иҳбит бисаламин минна вабаракатин ааалайка ваааала омамин мимман маааака ваомамун сануматтиаауҳум сумма йамассуҳум минна ааасабун алиймун
                Тилка мин анбай алғайби нуҳийҳа илайка ма кунта таааламуҳа анта вала қаумука мин қабли ҳаса файсбир инна алааақибата лилмуттақийна
                Вайла ааадин ахаҳум ҳудан қала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу ин антум илла муфтаруна
                Йа қауми ла асалукум ааалайҳи ажран ин ажрийа илла ааала аллазий фатараний афала тааақилуна
                Вайа қауми истағфиру роббакум сумма тубу илайҳи йурсили ассамаа ааалайкум мидраран вайазидкум қувватан ила қувватикум вала татауаллау мужримийна
                Қалу йа ҳуду ма житана бибаййинатин вама наҳну битарикий алиҳатина ааан қаулика вама наҳну лака бимуминийна
                Ин нақулу илла иаатарака баааду алиҳатина бисуин қала инний ошҳиду аллааҳа вайшҳаду анний барийон мимма тушрикуна
                Мин дуниҳи факийдуний жамийааан сумма ла тунсируни
                Инний тауаккалту ааала аллааҳи роббий вароббикум ма мин даббатин илла ҳува ахисун бинасийатиҳа инна роббий ааала сиратин мустақиймин
                Файн тауаллау фақад аблағтукум ма орсилту биҳи илайкум вайастахлифу роббий қауман ғайракум вала тадуррунаҳу шайан инна роббий ааала кулли шайин ҳафийсун
                Валамма жаа амруна нажжайна ҳудан вааллазийна аману мааааҳу бироҳматин минна ванажжайнаҳум мин ааасабин ғалийсин
                Ватилка ааадун жаҳаду биайати роббиҳим ваааасау русулаҳу вайттабааау амра кулли жаббарин ааанийдин
                Ваотбиаау фий ҳасиҳи аддунйа лааанатан вайаума алқийамати ала инна ааадан кафару роббаҳум ала буаадан лиааадин қауми ҳудин
                Вайла самуда ахаҳум салиҳан қала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу ҳува аншаакум мина аларди вайстааамаракум фийҳа файстағфируҳу сумма тубу илайҳи инна роббий қарийбун мужийбун
                Қалу йа салиҳу қад кунта фийна маржувван қабла ҳаса атанҳана ан нааабуда ма йааабуду абаона вайннана лафий шаккин мимма тадаауна илайҳи мурийбун
                Қала йа қауми араайтум ин кунту ааала баййинатин мин роббий ваатаний минҳу роҳматан фаман йансуруний мина аллааҳи ин ааасайтуҳу фама тазийдунаний ғайра тахсийрин
                Вайа қауми ҳасиҳи нақату аллааҳи лакум айатан фасаруҳа такул фий арди аллааҳи вала тамассуҳа бисуин файахусакум ааасабун қарийбун
                Фаааақаруҳа фақала таматтааау фий дарикум саласата аййамин салика вааадун ғайру максубин
                Фаламма жаа амруна нажжайна салиҳан вааллазийна аману мааааҳу бироҳматин минна вамин хизйи йаумийсин инна роббака ҳува алқауиййу алааазийзу
                Ваахаса аллазийна саламу ассайҳату фаасбаҳу фий дийариҳим жасимийна
                Каан лам йағнау фийҳа ала инна самуда кафару роббаҳум ала буаадан лисамуда
                Валақад жаат русулуна иброҳийма биалбушра қалу саламан қала саламун фама лабиса ан жаа биааижлин ҳанийсин
                Фаламма раа айдийаҳум ла тасилу илайҳи накироҳум ваавжаса минҳум хийфатан қалу ла тахаф инна орсилна ила қауми лутин
                Ваймраатуҳу қайматун фадаҳикат фабашшарнаҳа бийшақа вамин варай ишақа йааақуба
                Қалат йа вайлата аалиду ваана ааажузун ваҳаса бааалий шайхан инна ҳаса лашайон ааажийбун
                Қалу атааажабийна мин амри аллааҳи роҳмату аллааҳи вабаракатуҳу ааалайкум аҳла албайти иннаҳу ҳамийдун мажийдун
                Фаламма саҳаба ааан иброҳийма аррауаау важаасу албушра йужадилуна фий қауми лутин
                Инна иброҳийма лаҳалиймун ауваҳун мунийбун
                Йа иброҳийму ааарид ааан ҳаса иннаҳу қад жаа амру роббика вайннаҳум атийҳим ааасабун ғайру мардудин
                Валамма жаат русулуна лутан сийа биҳим вадақа биҳим сарааан вақала ҳаса йаумун ааасийбун
                Важааҳу қаумуҳу йуҳрааауна илайҳи вамин қаблу кану йааамалуна ассаййиати қала йа қауми ҳаолай банатий ҳунна асару лакум файттақу аллааҳа вала тухзуни фий дайфий алайса минкум ражулун рашийдун
                Қалу лақад ааалимта ма лана фий банатика мин ҳаққин вайннака латаааламу ма нурийду
                Қала лау анна лий бикум қувватан ау ауий ила рукнин шадийдин
                Қалу йа луту инна русулу роббика лан йасилу илайка фаасри биаҳлика биқитааин мина аллайли вала йалтафит минкум аҳадун илла имраатака иннаҳу мусийбуҳа ма асабаҳум инна мауааидаҳуму ассубҳу алайса ассубҳу биқарийбин
                Фаламма жаа амруна жаааална ааалийаҳа сафилаҳа ваамтарна ааалайҳа ҳижаратан мин сижжийлин мандудин
                Мусауваматан ааинда роббика вама ҳийа мина ассалимийна бибаааийдин
                Вайла мадйана ахаҳум шуааайбан қала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу вала танқусу алмикйала ваалмийзана инний аракум бихайрин вайнний ахафу ааалайкум ааасаба йаумин муҳийтин
                Вайа қауми ауфу алмикйала ваалмийзана биалқисти вала табхасу аннаса ашйааҳум вала тааасау фий аларди муфсидийна
                Бақиййату аллааҳи хайрун лакум ин кунтум муминийна вама ана ааалайкум биҳафийсин
                Қалу йа шуааайбу асалатука тамурука ан натрука ма йааабуду абаона ау ан нафааала фий амвалина ма нашао иннака лаанта алҳалийму аррашийду
                Қала йа қауми араайтум ин кунту ааала баййинатин мин роббий варазақаний минҳу ризқан ҳасанан вама орийду ан охалифакум ила ма анҳакум ааанҳу ин орийду илла алислаҳа ма истатааату вама тауфийқий илла биаллааҳи ааалайҳи тауаккалту вайлайҳи онийбу
                Вайа қауми ла йажриманнакум шиқақий ан йусийбакум мислу ма асаба қаума нуҳин ау қаума ҳудин ау қаума салиҳин вама қауму лутин минкум бибаааийдин
                Вайстағфиру роббакум сумма тубу илайҳи инна роббий роҳиймун вадудун
                Қалу йа шуааайбу ма нафқаҳу касийран мимма тақулу вайнна ланарака фийна даааийфан валаула роҳтука ларажамнака вама анта ааалайна биааазийзин
                Қала йа қауми ароҳтий ааааззу ааалайкум мина аллааҳи вайттахастумуҳу вараакум сиҳриййан инна роббий бима тааамалуна муҳийтун
                Вайа қауми иаамалу ааала маканатикум инний ааамилун сауфа таааламуна ман йатийҳи ааасабун йухзийҳи ваман ҳува касибун вайртақибу инне маааакум рақийбун
                Валамма жаа амруна нажжайна шуааайбан вааллазийна аману мааааҳу бироҳматин минна ваахасати аллазийна саламу ассайҳату фаасбаҳу фий дийариҳим жасимийна
                Каан лам йағнау фийҳа ала буаадан лимадйана кама бааайдат самуду
                Валақад арсална муса биайатина васултанин мубийнин
                Ила фирааауна вамалайҳи файттабааау амра фирааауна вама амру фирааауна бирашийдин
                Йақдуму қаумаҳу йаума алқийамати фааврадаҳуму аннара вабиса алвирду алмауруду
                Ваотбиаау фий ҳасиҳи лааанатан вайаума алқийамати биса аррифду алмарфуду
                Салика мин анбай алқура нақуссуҳу ааалайка минҳа қаймун ваҳасийдун
                Вама саламнаҳум валакин саламу анфусаҳум фама ағнат ааанҳум алиҳатуҳуму аллатий йадаауна мин дуни аллааҳи мин шайин ламма жаа амру роббика вама задуҳум ғайра татбийбин
                Вакасалика ахсу роббика иса ахаса алқура ваҳийа салиматун инна ахсаҳу алиймун шадийдун
                Инна фий салика лаайатан лиман хафа ааасаба алахирати салика йаумун мажмуааун лаҳу аннасу васалика йаумун машҳудун
                Вама нуаххируҳу илла лиажалин мааадудин
                Йаума йати ла такалламу нафсун илла бийсниҳи фаминҳум шақиййун васаааийдин
                Фаамма аллазийна шақу фафий аннари лаҳум фийҳа зафийрун вашаҳийқун
                Халидийна фийҳа ма дамати ассамауату вааларду илла ма шаа роббука инна роббака фаааааалун лима йурийду
                Ваамма аллазийна суааиду фафий алжаннати халидийна фийҳа ма дамати ассамауату вааларду илла ма шаа роббука ааатаан ғайра мажсусин
                Фала таку фий мирйатин мимма йааабуду ҳаолай ма йааабудуна илла кама йааабуду абаоҳум мин қаблу вайнна ламуваффуҳум насийбаҳум ғайра манқусин
                Валақад атайна муса алкитаба файхтулифа фийҳи валаула калиматун сабақат мин роббика лақудийа байнаҳум вайннаҳум лафий шаккин минҳу мурийбун
                Вайнна куллан ламма лайуваффийаннаҳум роббука ааамалаҳум иннаҳу бима йааамалуна хабийрун
                Файстақим кама омирта ваман таба маааака вала татғау иннаҳу бима тааамалуна басийрун
                Вала таркану ила аллазийна саламу фатамассакуму аннару вама лакум мин дуни аллааҳи мин аулийаа сумма ла тунсаруна
                Ваақими ассалата тарафайи аннаҳари вазулафан мина аллайли инна алҳасанати йусҳибна ассаййиати салика сикра лилссакирийна
                Вайсбир файнна аллааҳа ла йудийаау ажра алмуҳсинийна
                Фалаула кана мина алқуруни мин қабликум олу бақиййатин йанҳауна ааани алфасади фий аларди илла қалийлан мимман анжайна минҳум вайттабаааа аллазийна саламу ма отрифу фийҳи вакану мужримийна
                Вама кана роббука лийуҳлика алқура бисулмин вааҳлуҳа муслиҳуна
                Валау шаа роббука лажаааала аннаса омматан ваҳидатан вала йазалуна мухталифийна
                Илла ман роҳима роббука валисалика халақаҳум ватаммат калимату роббика лаамлаанна жаҳаннама мина алжиннати ваалннаси ажмаааийна
                Вакуллан нақуссу ааалайка мин анбай аррусули ма нусаббиту биҳи фуадака важаака фий ҳасиҳи алҳаққу вамауааисатун васикра лилмуминийна
                Вақул лиллазийна ла йуминуна иаамалу ааала маканатикум инна ааамилуна
                Вайнтасиру инна мунтасируна
                Валиллаҳи ғайбу ассамауати вааларди вайлайҳи йуржааау аламру куллуҳу фаоаабузу ватауаккал ааалайҳи вама роббука биғафилин ааамма тааамалуна
            """.trimIndent(),
        ),
        Surah(
            id = 12,
            arabicName = "يوسف",
            latinName = "Yusuf",
            transliteration = """
                Алифламра тилка айату алкитаби алмубийну
                Инна анзалнаҳу қуранан аааробиййан лааааллакум тааақилуна
                Наҳну нақуссу ааалайка аҳсана алқасаси бима ауҳайна илайка ҳаса алқурана вайн кунта мин қаблиҳи ламина алғафилийна
                Ис қала йусуфу лиабийҳи йа абати инний раайту аҳада ааашара каукабан ваалшшамса ваалқамара раайтуҳум лий сажидийна
                Қала йа бунаййа ла тақсус руйака ааала ихватика файакийду лака кайдан инна ашшайтана лилинсани ааадуввун мубийнун
                Вакасалика йажтабийка роббука вайуаааллимука мин тауийли алаҳадийси вайутимму ниааматаҳу ааалайка ваааала али йааақуба кама атаммаҳа ааала абауайка мин қаблу иброҳийма вайшақа инна роббака ааалиймун ҳакиймун
                Лақад кана фий йусуфа вайхватиҳи айатун лилссайлийна
                Ис қалу лайусуфу ваахуҳу аҳаббу ила абийна минна ванаҳну ааусбатун инна абана лафий далалин мубийнин
                Оқтулу йусуфа ауи итроҳуҳу ардан йахлу лакум важҳу абийкум ватакуну мин бааадиҳи қауман салиҳийна
                Қала қайлун минҳум ла тақтулу йусуфа ваалқуҳу фий ғайабати алжубби йалтақису баааду ассаййарати ин кунтум фааайлийна
                Қалу йа абана ма лака ла таманна ааала йусуфа вайнна лаҳу ланасиҳуна
                Арсилҳу маааана ғадан йартааа вайалаааб вайнна лаҳу лаҳафисуна
                Қала инний лайаҳзунуний ан сасҳабу биҳи ваахафу ан йакулаҳу ассибу ваантум ааанҳу ғафилуна
                Қалу лайн акалаҳу ассибу ванаҳну ааусбатун инна исан лахасируна
                Фаламма саҳабу биҳи ваажмааау ан йажааалуҳу фий ғайабати алжубби ваавҳайна илайҳи латунабианнаҳум биамриҳим ҳаса ваҳум ла йашаауруна
                Важау абаҳум ааишаан йабкуна
                Қалу йа абана инна саҳабна настабиқу ватаракна йусуфа ааинда матааайна фаакалаҳу ассибу вама анта бимуминин лана валау кунна садиқийна
                Важау ааала қамийсиҳи бидамин касибин қала бал саувалат лакум анфусукум амран фасабрун жамийлун вааллааҳу алмустаааану ааала ма тасифуна
                Важаат саййаратун фаарсалу варидаҳум фаадла далваҳу қала йа бушра ҳаса ғуламун ваасарруҳу бидаааатан вааллааҳу ааалиймун бима йааамалуна
                Вашарауҳу бисаманин бахсин дароҳима мааадудатин вакану фийҳи мина аззаҳидийна
                Вақала аллазий иштароҳу мин мисра лиймраатиҳи акримий масваҳу аааса ан йанфаааана ау наттахисаҳу валадан вакасалика макканна лийусуфа фий аларди валинуаааллимаҳу мин тауийли алаҳадийси вааллааҳу ғалибун ааала амриҳи валакинна аксара аннаси ла йаааламуна
                Валамма балаға ашуддаҳу атайнаҳу ҳукман вааайлман вакасалика нажзий алмуҳсинийна
                Варауадасу аллатий ҳува фий байтиҳа ааан нафсиҳи вағаллақати алабваба вақалат ҳайта лака қала мааааса аллааҳи иннаҳу роббий аҳсана масвайа иннаҳу ла йуфлиҳу ассалимуна
                Валақад ҳаммат биҳи ваҳамма биҳа лаула ан раа бурҳана роббиҳи касалика линасрифа ааанҳу ассуа ваалфаҳшаа иннаҳу мин ааибадина алмухласийна
                Вайстабақа албаба вақаддат қамийсаҳу мин дубурин ваалфайа саййидаҳа лада албаби қалат ма жазао ман арада биаҳлика суан илла ан йусжана ау ааасабун алиймун
                Қала ҳийа рауадатний ааан нафсий вашаҳида шаҳидун мин аҳлиҳа ин кана қамийсуҳу қудда мин қубулин фасадақат ваҳува мина алкасибийна
                Вайн кана қамийсуҳу қудда мин дубурин факасабат ваҳува мина ассадиқийна
                Фаламма раа қамийсаҳу қудда мин дубурин қала иннаҳу мин кайдикунна инна кайдакунна ааасиймун
                Йусуфу ааарид ааан ҳаса вайстағфирий лисанбики иннаки кунти мина алхатиийна
                Вақала нисватун фий алмадийнати имраату алааазийзи турауиду фатаҳа ааан нафсиҳи қад шағафаҳа ҳуббан инна ланароҳа фий далалин мубийнин
                Фаламма самиааат бимакриҳинна арсалат илайҳинна ваааатадат лаҳунна муттакаан ваатат кулла ваҳидатин минҳунна сиккийнан вақалати охруж ааалайҳинна фаламма раайнаҳу акбарнаҳу вақаттааана айдийаҳунна вақулна ҳаша лиллаҳи ма ҳаса башаран ин ҳаса илла малакун кариймун
                Қалат фасаликунна аллазий лумтуннаний фийҳи валақад рауадтуҳу ааан нафсиҳи файстаасама валайн лам йафааал ма амуруҳу лайусжананна валайакунан мина ассағирийна
                Қала робби ассижну аҳаббу илаййа мимма йадааунаний илайҳи вайлла тасриф ааанний кайдаҳунна асбу илайҳинна ваакун мина алжаҳилийна
                Файстажаба лаҳу роббуҳу фасарафа ааанҳу кайдаҳунна иннаҳу ҳува ассамийаау алааалийму
                Сумма бада лаҳум мин бааади ма рааву алайати лайасжунуннаҳу ҳатта ҳийнин
                Вадахала мааааҳу ассижна фатайани қала аҳадуҳума инний араний ааасиру хамран вақала алахару инний араний аҳмилу фауқа расий хубзан такулу аттайру минҳу наббина битауийлиҳи инна нарака мина алмуҳсинийна
                Қала ла йатийкума таааамун турзақаниҳи илла наббатукума битауийлиҳи қабла ан йатийакума саликума мимма ааалламаний роббий инний таракту миллата қаумин ла йуминуна биаллааҳи ваҳум биалахирати ҳум кафируна
                Вайттабааату миллата абаий иброҳийма вайшақа вайааақуба ма кана лана ан нушрика биаллааҳи мин шайин салика мин фадли аллааҳи ааалайна ваааала аннаси валакинна аксара аннаси ла йашкуруна
                Йа саҳибайи ассижни аарбабун мутафарриқуна хайрун ами аллааҳу алваҳиду алқаҳҳару
                Ма тааабудуна мин дуниҳи илла асмаан саммайтумуҳа антум ваабаокум ма анзала аллааҳу биҳа мин султанин ини алҳукму илла лиллаҳи амара алла тааабуду илла иййаҳу салика аддийну алқаййиму валакинна аксара аннаси ла йаааламуна
                Йа саҳибайи ассижни амма аҳадукума файасқий роббаҳу хамран ваамма алахару файуслабу фатакулу аттайру мин расиҳи қудийа аламру аллазий фийҳи тастафтийани
                Вақала лиллазий санна аннаҳу нажин минҳума оскурний ааинда роббика фаансаҳу ашшайтану сикра роббиҳи фалабиса фий ассижни бидааа синийна
                Вақала алмалику инний ара сабааа бақаратин симанин йакулуҳунна сабааун ааижафун васабааа сунбулатин худрин ваохара йабисатин йа аййуҳа алмалао афтуний фий руйайа ин кунтум лилрруйа тааабуруна
                Қалу адғасу аҳламин вама наҳну битауийли алаҳлами биааалимийна
                Вақала аллазий нажа минҳума вайддакара бааада омматин ана онаббиокум битауийлиҳи фаарсилуни
                Йусуфу аййуҳа ассиддийқу афтина фий сабааи бақаратин симанин йакулуҳунна сабааун ааижафун васабааи сунбулатин худрин ваохара йабисатин лааааллий аржиаау ила аннаси лааааллааҳум йаааламуна
                Қала тазрааауна сабааа синийна даабан фама ҳасадтум фасаруҳу фий сунбулиҳи илла қалийлан мимма такулуна
                Сумма йатий мин бааади салика сабааун шидадун йакулна ма қаддамтум лаҳунна илла қалийлан мимма туҳсинуна
                Сумма йатий мин бааади салика ааамун фийҳи йуғасу аннасу вафийҳи йааасируна
                Вақала алмалику итуний биҳи фаламма жааҳу аррасулу қала иржиаа ила роббика файсалҳу ма балу аннисвати аллатий қаттааана айдийаҳунна инна роббий бикайдиҳинна ааалиймун
                Қала ма хатбукунна ис рауадтунна йусуфа ааан нафсиҳи қулна ҳаша лиллаҳи ма ааалимна ааалайҳи мин суин қалати имраату алааазийзи алана ҳашаса алҳаққу ана рауадтуҳу ааан нафсиҳи вайннаҳу ламина ассадиқийна
                Салика лийааалама анний лам ахунҳу биалғайби ваанна аллааҳа ла йаҳдий кайда алхайнийна
                Вама обаррио нафсий инна аннафса лааммаратун биалссуи илла ма роҳима роббий инна роббий ғафурун роҳиймун
                Вақала алмалику итуний биҳи астахлишу линафсий фаламма калламаҳу қала иннака алйаума ладайна макийнун амийнун
                Қала ижааалний ааала хазайни аларди инний ҳафийсун ааалиймун
                Вакасалика маканна лийусуфа фий аларди йатабаувао минҳа ҳайсу йашао нусийбу бироҳматина ман нашао вала нудийаау ажра алмуҳсинийна
                Валаажру алахирати хайрун лиллазийна аману вакану йаттақуна
                Важаа ихвату йусуфа фадахалу ааалайҳи фаааарафаҳум ваҳум лаҳу мункируна
                Валамма жаҳҳазаҳум бижаҳазиҳим қала итуний биахин лакум мин абийкум ала тарауна анний уфий алкайла ваана хайру алмунзилийна
                Файн лам татуний биҳи фала кайла лакум ааиндий вала тақробуни
                Қалу санурауиду ааанҳу абаҳу вайнна лафааайлуна
                Вақала лифитйаниҳи ижааалу бидаааатаҳум фий риҳалиҳим лааааллааҳум йааарифунаҳа иса инқалабу ила аҳлиҳим лааааллааҳум йаржиаауна
                Фаламма ражааау ила абийҳим қалу йа абана муниааа минна алкайлу фаарсил маааана ахана нактал вайнна лаҳу лаҳафисуна
                Қала ҳал аманукум ааалайҳи илла кама аминтукум ааала ахийҳи мин қаблу фааллааҳу хайрун ҳафисан ваҳува арҳаму арроҳимийна
                Валамма фатаҳу матааааҳум важаду бидаааатаҳум руддат илайҳим қалу йа абана ма набғий ҳасиҳи бидаааатуна руддат илайна ванамийру аҳлана ванаҳфасу ахана ваназдаду кайла баааийрин салика кайлун йасийрун
                Қала лан орсилаҳу маааакум ҳатта тутуни маусиқан мина аллааҳи лататуннаний биҳи илла ан йуҳата бикум фаламма атауҳу маусиқаҳум қала аллааҳу ааала ма нақулу вакийлун
                Вақала йа баниййа ла тадхулу мин бабин ваҳидин ваодхулу мин абвабин мутафарриқатин вама оғний ааанкум мина аллааҳи мин шайин ини алҳукму илла лиллаҳи ааалайҳи тауаккалту ваааалайҳи фалйатауаккали алмутауаккилуна
                Валамма дахалу мин ҳайсу амароҳум абуҳум ма кана йуғний ааанҳум мина аллааҳи мин шайин илла ҳажатан фий нафси йааақуба қадаҳа вайннаҳу ласу ааилмин лима ааалламнаҳу валакинна аксара аннаси ла йаааламуна
                Валамма дахалу ааала йусуфа ауа илайҳи ахаҳу қала инний ана ахука фала табтайс бима кану йааамалуна
                Фаламма жаҳҳазаҳум бижаҳазиҳим жаааала ассиқайата фий роҳли ахийҳи сумма ассана муассинун аййатуҳа алааийру иннакум ласариқуна
                Қалу ваақбалу ааалайҳим маса тафқидуна
                Қалу нафқиду суваааа алмалики валиман жаа биҳи ҳимлу баааийрин ваана биҳи заааиймун
                Қалу тааллааҳи лақад ааалимтум ма жина линуфсида фий аларди вама кунна сариқийна
                Қалу фама жазаоҳу ин кунтум касибийна
                Қалу жазаоҳу ман вужида фий роҳлиҳи фаҳува жазаоҳу касалика нажзий ассалимийна
                Фабадаа биауааийатиҳим қабла виааай ахийҳи сумма истахражаҳа мин виааай ахийҳи касалика кидна лийусуфа ма кана лийахуса ахаҳу фий дийни алмалики илла ан йашаа аллааҳу нарфааау даражатин ман нашао вафауқа кулли сий ааилмин ааалиймун
                Қалу ин йасриқ фақад сарақа ахун лаҳу мин қаблу фаасарроҳа йусуфу фий нафсиҳи валам йубдиҳа лаҳум қала антум шаррун маканан вааллааҳу аааламу бима тасифуна
                Қалу йа аййуҳа алааазийзу инна лаҳу абан шайхан кабийран фахус аҳадана маканаҳу инна нарака мина алмуҳсинийна
                Қала мааааса аллааҳи ан нахуса илла ман важадна матаааана ааиндаҳу инна исан ласалимуна
                Фаламма истайасу минҳу халасу нажиййан қала кабийруҳум алам таааламу анна абакум қад ахаса ааалайкум маусиқан мина аллааҳи вамин қаблу ма фарраттум фий йусуфа фалан аброҳа аларда ҳатта йасана лий абий ау йаҳкума аллааҳу лий ваҳува хайру алҳакимийна
                Иржиаау ила абийкум фақулу йа абана инна ибнака сарақа вама шаҳидна илла бима ааалимна вама кунна лилғайби ҳафисийна
                Вайсали алқарйата аллатий кунна фийҳа ваалааийра аллатий ақбална фийҳа вайнна ласадиқуна
                Қала бал саувалат лакум анфусукум амран фасабрун жамийлун аааса аллааҳу ан йатийаний биҳим жамийааан иннаҳу ҳува алааалийму алҳакийму
                Ватауалла ааанҳум вақала йа асафа ааала йусуфа вайбйаддат ааайнаҳу мина алҳузни фаҳува касиймун
                Қалу тааллааҳи тафтао таскуру йусуфа ҳатта такуна ҳарадан ау такуна мина алҳаликийна
                Қала иннама ашку бассий ваҳузний ила аллааҳи вааааламу мина аллааҳи ма ла таааламуна
                Йа баниййа исҳабу фатаҳассасу мин йусуфа ваахийҳи вала тайасу мин рауҳи аллааҳи иннаҳу ла йайасу мин рауҳи аллааҳи илла алқауму алкафируна
                Фаламма дахалу ааалайҳи қалу йа аййуҳа алааазийзу массана вааҳлана аддурру важина бибидаааатин музжатин фаавфи лана алкайла ватасаддақ ааалайна инна аллааҳа йажзий алмутасаддиқийна
                Қала ҳал ааалимтум ма фаааалтум бийусуфа ваахийҳи ис антум жаҳилуна
                Қалу айннака лаанта йусуфа қала ана йусуфу ваҳаса ахий қад манна аллааҳу ааалайна иннаҳу ман йаттақи вайасбир файнна аллааҳа ла йудийаау ажра алмуҳсинийна
                Қалу тааллааҳи лақад асарака аллааҳу ааалайна вайн кунна лахатиийна
                Қала ла тасрийба ааалайкуму алйаума йағфиру аллааҳу лакум ваҳува арҳаму арроҳимийна
                Исҳабу биқамийсий ҳаса фаалқуҳу ааала важҳи абий йати басийран ватуний биаҳликум ажмаааийна
                Валамма фасалати алааийру қала абуҳум инний лаажиду рийҳа йусуфа лаула ан туфаннидуни
                Қалу тааллааҳи иннака лафий далалика алқадийми
                Фаламма ан жаа албашийру алқаҳу ааала важҳиҳи файртадда басийран қала алам ақул лакум инний аааламу мина аллааҳи ма ла таааламуна
                Қалу йа абана истағфир лана сунубана инна кунна хатиийна
                Қала сауфа астағфиру лакум роббий иннаҳу ҳува алғафуру арроҳийму
                Фаламма дахалу ааала йусуфа ауа илайҳи абауайҳи вақала одхулу мисра ин шаа аллааҳу аминийна
                Варафаааа абауайҳи ааала алааарши вахарру лаҳу сужжадан вақала йа абати ҳаса тауийлу руйайа мин қаблу қад жаааалаҳа роббий ҳаққан вақад аҳсана бий ис ахражаний мина ассижни важаа бикум мина албадви мин бааади ан назаға ашшайтану байний вабайна ихватий инна роббий латийфун лима йашао иннаҳу ҳува алааалийму алҳакийму
                Робби қад атайтаний мина алмулки ваааалламтаний мин тауийли алаҳадийси фатира ассамауати вааларди анта валиййий фий аддунйа ваалахирати тауаффаний муслиман ваалҳиқний биалссалиҳийна
                Салика мин анбай алғайби нуҳийҳи илайка вама кунта ладайҳим ис ажмааау амроҳум ваҳум йамкуруна
                Вама аксару аннаси валау ҳараста бимуминийна
                Вама тасалуҳум ааалайҳи мин ажрин ин ҳува илла сикрун лилаааламийна
                Вакааййин мин айатин фий ассамауати вааларди йамурруна ааалайҳа ваҳум ааанҳа муааридуна
                Вама йумину аксаруҳум биаллааҳи илла ваҳум мушрикуна
                Афаамину ан татийаҳум ғашийатун мин ааасаби аллааҳи ау татийаҳуму ассаааату бағтатан ваҳум ла йашаауруна
                Қул ҳасиҳи сабийлий адаау ила аллааҳи ааала басийратин ана вамани иттабааааний васубҳана аллааҳи вама ана мина алмушрикийна
                Вама арсална мин қаблика илла рижалан нуҳий илайҳим мин аҳли алқура афалам йасийру фий аларди файансуру кайфа кана ааақибату аллазийна мин қаблиҳим валадару алахирати хайрун лиллазийна иттақау афала тааақилуна
                Ҳатта иса истайаса аррусулу васанну аннаҳум қад кусибу жааҳум насруна фанужжийа ман нашао вала йурадду басуна ааани алқауми алмужримийна
                Лақад кана фий қасасиҳим ааибратун лиолий алалбаби ма кана ҳадийсан йуфтара валакин тасдийқа аллазий байна йадайҳи ватафсийла кулли шайин ваҳудан вароҳматан лиқаумин йуминуна
            """.trimIndent(),
        ),
        Surah(
            id = 13,
            arabicName = "الرعد",
            latinName = "Ar-Ra'd",
            transliteration = """
                Алифламмиймра тилка айату алкитаби вааллазий онзила илайка мин роббика алҳаққу валакинна аксара аннаси ла йуминуна
                Аллааҳу аллазий рафаааа ассамауати биғайри ааамадин тараунаҳа сумма истауа ааала алааарши васаххара ашшамса ваалқамара куллун йажрий лиажалин мусамман йудаббиру аламра йуфассилу алайати лааааллакум билиқай роббикум туқинуна
                Ваҳува аллазий мадда аларда важаааала фийҳа рауасийа ваанҳаран вамин кулли ассамарати жаааала фийҳа заужайни иснайни йуғший аллайла аннаҳара инна фий салика лаайатин лиқаумин йатафаккаруна
                Вафий аларди қитаааун мутажауиратун важаннатун мин ааанабин вазарааун ванахийлун синванун вағайру синванин йусқа бимайн ваҳидин вануфаддилу бааадаҳа ааала бааадин фий алокули инна фий салика лаайатин лиқаумин йааақилуна
                Вайн тааажаб фаааажабун қаулуҳум айса кунна туробан айнна лафий халқин жадийдин олайка аллазийна кафару бироббиҳим ваолайка алағлалу фий ааанақиҳим ваолайка ашабу аннари ҳум фийҳа халидуна
                Вайастааажилунака биалссаййиати қабла алҳасанати вақад халат мин қаблиҳиму алмасулату вайнна роббака ласу мағфиратин лилннаси ааала сулмиҳим вайнна роббака лашадийду алааиқаби
                Вайақулу аллазийна кафару лаула онзила ааалайҳи айатун мин роббиҳи иннама анта мунсирун валикулли қаумин ҳадин
                Аллааҳу йаааламу ма таҳмилу куллу онса вама тағийду аларҳаму вама таздаду вакуллу шайин ааиндаҳу бимиқдарин
                Ааалиму алғайби ваалшшаҳадати алкабийру алмутаааали
                Сауаон минкум ман асарра алқаула ваман жаҳара биҳи ваман ҳува мустахфин биаллайли васарибун биалннаҳари
                Лаҳу муаааққибатун мин байни йадайҳи вамин халфиҳи йаҳфасунаҳу мин амри аллааҳи инна аллааҳа ла йуғаййиру ма биқаумин ҳатта йуғаййиру ма бианфусиҳим вайса арада аллааҳу биқаумин суан фала марадда лаҳу вама лаҳум мин дуниҳи мин валин
                Ҳува аллазий йурийкуму албарқа хауфан ватамаааан вайуншио ассаҳаба ассиқала
                Вайусаббиҳу арраааду биҳамдиҳи ваалмалайкату мин хийфатиҳи вайурсилу ассауааайқа файусийбу биҳа ман йашао ваҳум йужадилуна фий аллааҳи ваҳува шадийду алмиҳали
                Лаҳу дааауату алҳаққи вааллазийна йадаауна мин дуниҳи ла йастажийбуна лаҳум бишайин илла кабасити каффайҳи ила алмай лийаблуға фаҳу вама ҳува бибалиғиҳи вама дуааао алкафирийна илла фий далалин
                Валиллаҳи йасжуду ман фий ассамауати вааларди тауааан вакарҳан василалуҳум биалғудувви вааласали
                Қул ман роббу ассамауати вааларди қули аллааҳу қул афайттахастум мин дуниҳи аулийаа ла йамликуна лианфусиҳим нафааан вала дарран қул ҳал йастауий алааама ваалбасийру ам ҳал тастауий ассулумату ваалннуру ам жаааалу лиллаҳи шуракаа халақу кахалқиҳи фаташабаҳа алхалқу ааалайҳим қули аллааҳу халиқу кулли шайин ваҳува алваҳиду алқаҳҳару
                Анзала мина ассамай маан фасалат аудийатун биқадариҳа файҳтамала ассайлу забадан робийан вамимма йуқидуна ааалайҳи фий аннари ибтиғаа ҳилйатин ау матааайн забадун мислуҳу касалика йадрибу аллааҳу алҳаққа ваалбатила фаамма аззабаду файасҳабу жуфаан ваамма ма йанфааау аннаса файамкусу фий аларди касалика йадрибу аллааҳу аламсала
                Лиллазийна истажабу лироббиҳиму алҳусна вааллазийна лам йастажийбу лаҳу лау анна лаҳум ма фий аларди жамийааан вамислаҳу мааааҳу лайфтадау биҳи олайка лаҳум суо алҳисаби вамауаҳум жаҳаннаму вабиса алмиҳаду
                Афаман йаааламу аннама онзила илайка мин роббика алҳаққу каман ҳува ааама иннама йатасаккару олу алалбаби
                Аллазийна йуфуна биаааҳди аллааҳи вала йанқудуна алмийсақа
                Вааллазийна йасилуна ма амара аллааҳу биҳи ан йусала вайахшауна роббаҳум вайахафуна суа алҳисаби
                Вааллазийна сабару ибтиғаа важҳи роббиҳим ваақаму ассалата ваанфақу мимма разақнаҳум сирран вааааланийатан вайадрауна биалҳасанати ассаййиата олайка лаҳум аауқба аддари
                Жаннату аааднин йадхулунаҳа ваман салаҳа мин абайҳим ваазважиҳим васурриййатиҳим ваалмалайкату йадхулуна ааалайҳим мин кулли бабин
                Саламун ааалайкум бима сабартум фаниаама аауқба аддари
                Вааллазийна йанқудуна аааҳда аллааҳи мин бааади мийсақиҳи вайақтааауна ма амара аллааҳу биҳи ан йусала вайуфсидуна фий аларди олайка лаҳуму аллааанату валаҳум суо аддари
                Аллааҳу йабсуту арризқа лиман йашао вайақдиру вафариҳу биалҳайати аддунйа вама алҳайату аддунйа фий алахирати илла матаааун
                Вайақулу аллазийна кафару лаула онзила ааалайҳи айатун мин роббиҳи қул инна аллааҳа йудиллу ман йашао вайаҳдий илайҳи ман анаба
                Аллазийна аману вататмайнну қулубуҳум бисикри аллааҳи ала бисикри аллааҳи татмайнну алқулубу
                Аллазийна аману ваааамилу ассалиҳати туба лаҳум ваҳусну маабин
                Касалика арсалнака фий омматин қад халат мин қаблиҳа омамун литатлува ааалайҳиму аллазий ауҳайна илайка ваҳум йакфуруна биалрроҳмани қул ҳува роббий ла илаҳа илла ҳува ааалайҳи тауаккалту вайлайҳи матаби
                Валау анна қуранан суййират биҳи алжибалу ау қуттиааат биҳи аларду ау куллима биҳи алмаута бал лиллаҳи аламру жамийааан афалам йайаси аллазийна аману ан лау йашао аллааҳу лаҳада аннаса жамийааан вала йазалу аллазийна кафару тусийбуҳум бима санааау қариааатун ау таҳуллу қарийбан мин дариҳим ҳатта йатийа ваааду аллааҳи инна аллааҳа ла йухлифу алмийааада
                Валақади истуҳзиа бирусулин мин қаблика фаамлайту лиллазийна кафару сумма ахастуҳум факайфа кана ааиқаби
                Афаман ҳува қаймун ааала кулли нафсин бима касабат важаааалу лиллаҳи шуракаа қул саммуҳум ам тунаббиунаҳу бима ла йаааламу фий аларди ам бисаҳирин мина алқаули бал зуййина лиллазийна кафару макруҳум васудду ааани ассабийли ваман йудлили аллааҳу фама лаҳу мин ҳадин
                Лаҳум ааасабун фий алҳайати аддунйа валаааасабу алахирати ашаққу вама лаҳум мина аллааҳи мин вақин
                Масалу алжаннати аллатий вуааида алмуттақуна тажрий мин таҳтиҳа аланҳару окулуҳа даймун василлуҳа тилка аауқба аллазийна иттақау вааауқба алкафирийна аннару
                Вааллазийна атайнаҳуму алкитаба йафроҳуна бима онзила илайка вамина алаҳзаби ман йункиру бааадаҳу қул иннама омирту ан ааабуда аллааҳа вала ошрика биҳи илайҳи адаау вайлайҳи мааби
                Вакасалика анзалнаҳу ҳукман аааробиййан валайни иттабааата аҳвааҳум бааада ма жаака мина алааилми ма лака мина аллааҳи мин валиййин вала вақин
                Валақад арсална русулан мин қаблика важаааална лаҳум азважан васурриййатан вама кана лирасулин ан йатийа биайатин илла бийсни аллааҳи ликулли ажалин китабун
                Йамҳу аллааҳу ма йашао вайусбиту вааайндаҳу омму алкитаби
                Вайн ма нурийаннака бааада аллазий нааайдуҳум ау натауаффайаннака файннама ааалайка албалағу ваааалайна алҳисабу
                Ауалам йарау анна натий аларда нанқусуҳа мин атрафиҳа вааллааҳу йаҳкуму ла муаааққиба лиҳукмиҳи ваҳува сарийаау алҳисаби
                Вақад макара аллазийна мин қаблиҳим фалиллаҳи алмакру жамийааан йаааламу ма таксибу куллу нафсин васайаааламу алкуффару лиман аауқба аддари
                Вайақулу аллазийна кафару ласта мурсалан қул кафа биаллааҳи шаҳийдан байний вабайнакум ваман ааиндаҳу ааилму алкитаби
            """.trimIndent(),
        ),
        Surah(
            id = 14,
            arabicName = "ابراهيم",
            latinName = "Ibrahim",
            transliteration = """
                Алифламра китабун анзалнаҳу илайка литухрижа аннаса мина ассулумати ила аннури бийсни роббиҳим ила сирати алааазийзи алҳамийди
                Аллааҳи аллазий лаҳу ма фий ассамауати вама фий аларди вауайлун лилкафирийна мин ааасабин шадийдин
                Аллазийна йастаҳиббуна алҳайата аддунйа ааала алахирати вайасуддуна ааан сабийли аллааҳи вайабғунаҳа ааиважан олайка фий далалин баааийдин
                Вама арсална мин расулин илла билисани қаумиҳи лийубаййина лаҳум файудиллу аллааҳу ман йашао вайаҳдий ман йашао ваҳува алааазийзу алҳакийму
                Валақад арсална муса биайатина ан ахриж қаумака мина ассулумати ила аннури васаккирҳум биаййами аллааҳи инна фий салика лаайатин ликулли саббарин шакурин
                Вайс қала муса лиқаумиҳи оскуру ниаамата аллааҳи ааалайкум ис анжакум мин али фирааауна йасумунакум суа алааасаби вайусаббиҳуна абнаакум вайастаҳйуна нисаакум вафий саликум балаон мин роббикум ааасиймун
                Вайс таассана роббукум лайн шакартум лаазийданнакум валайн кафартум инна ааасабий лашадийдун
                Вақала муса ин такфуру антум ваман фий аларди жамийааан файнна аллааҳа лағаниййун ҳамийдун
                Алам йатикум набао аллазийна мин қабликум қауми нуҳин ваааадин васамуда вааллазийна мин бааадиҳим ла йаааламуҳум илла аллааҳу жаасум русулуҳум биалбаййинати фарадду айдийаҳум фий афваҳиҳим вақалу инна кафарна бима орсилтум биҳи вайнна лафий шаккин мимма тадааунана илайҳи мурийбун
                Қалат русулуҳум афий аллааҳи шаккун фатири ассамауати вааларди йадааукум лийағфира лакум мин сунубикум вайуаххиракум ила ажалин мусамман қалу ин антум илла башарун мислуна турийдуна ан тасуддуна ааамма кана йааабуду абаона фатуна бисултанин мубийнин
                Қалат лаҳум русулуҳум ин наҳну илла башарун мислукум валакинна аллааҳа йамунну ааала ман йашао мин ааибадиҳи вама кана лана ан натийакум бисултанин илла бийсни аллааҳи ваааала аллааҳи фалйатауаккали алмуминуна
                Вама лана алла натауаккала ааала аллааҳи вақад ҳадана субулана валанасбиранна ааала ма асайтумуна ваааала аллааҳи фалйатауаккали алмутауаккилуна
                Вақала аллазийна кафару лирусулиҳим ланухрижаннакум мин ардина ау латаааудунна фий миллатина фаавҳа илайҳим роббуҳум лануҳликанна ассалимийна
                Валанускинаннакуму аларда мин бааадиҳим салика лиман хафа мақамий вахафа ваааийди
                Вайстафтаҳу вахаба куллу жаббарин ааанийдин
                Мин варайҳи жаҳаннаму вайусқа мин майн садийдин
                Йатажаррааауҳу вала йакаду йусийғуҳу вайатийҳи алмауту мин кулли маканин вама ҳува бимаййитин вамин варайҳи ааасабун ғалийсун
                Масалу аллазийна кафару бироббиҳим ааамалуҳум карамадин иштаддат биҳи аррийҳу фий йаумин ааасифин ла йақдируна мимма касабу ааала шайин салика ҳува аддалалу албаааийду
                Алам тара анна аллааҳа халақа ассамауати вааларда биалҳаққи ин йаша йусҳибкум вайати бихалқин жадийдин
                Вама салика ааала аллааҳи биааазийзин
                Вабаразу лиллаҳи жамийааан фақала аддуааафао лиллазийна истакбару инна кунна лакум табаааан фаҳал антум муғнуна ааанна мин ааасаби аллааҳи мин шайин қалу лау ҳадана аллааҳу лаҳадайнакум сауаон ааалайна ажазиаана ам сабарна ма лана мин маҳийсин
                Вақала ашшайтану ламма қудийа аламру инна аллааҳа ваааадакум вааада алҳаққи вауаааадтукум фаахлафтукум вама кана лийа ааалайкум мин султанин илла ан даааавтукум файстажабтум лий фала талумуний валуму анфусакум ма ана бимусрихикум вама антум бимусрихиййа инний кафарту бима ашрактумуни мин қаблу инна ассалимийна лаҳум ааасабун алиймун
                Ваодхила аллазийна аману ваааамилу ассалиҳати жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа бийсни роббиҳим таҳиййатуҳум фийҳа саламун
                Алам тара кайфа дароба аллааҳу масалан калиматан таййибатан кашажаратин таййибатин аслуҳа сабитун вафараауҳа фий ассамай
                Тутий окулаҳа кулла ҳийнин бийсни роббиҳа вайадрибу аллааҳу аламсала лилннаси лааааллааҳум йатасаккаруна
                Вамасалу калиматин хабийсатин кашажаратин хабийсатин ижтуссат мин фауқи аларди ма лаҳа мин қарарин
                Йусаббиту аллааҳу аллазийна аману биалқаули ассабити фий алҳайати аддунйа вафий алахирати вайудиллу аллааҳу ассалимийна вайафааалу аллааҳу ма йашао
                Алам тара ила аллазийна баддалу ниаамата аллааҳи куфран вааҳаллу қаумаҳум дара албауари
                Жаҳаннама йаслаунаҳа вабиса алқарару
                Важаааалу лиллаҳи андадан лийудиллу ааан сабийлиҳи қул таматтааау файнна масийракум ила аннари
                Қул лиааибадийа аллазийна аману йуқийму ассалата вайунфиқу мимма разақнаҳум сирран вааааланийатан мин қабли ан йатийа йаумун ла байааун фийҳи вала хилалун
                Аллааҳу аллазий халақа ассамауати вааларда ваанзала мина ассамай маан фаахража биҳи мина ассамарати ризқан лакум васаххара лакуму алфулка литажрийа фий албаҳри биамриҳи васаххара лакуму аланҳара
                Васаххара лакуму ашшамса ваалқамара дайбайни васаххара лакуму аллайла ваалннаҳара
                Ваатакум мин кулли ма саалтумуҳу вайн таааудду ниаамата аллааҳи ла туҳсуҳа инна алинсана ласалумун каффарун
                Вайс қала иброҳийму робби ижааал ҳаса албалада аминан ваожнубний вабаниййа ан нааабуда аласнама
                Робби иннаҳунна адлална касийран мина аннаси фаман табиаааний файннаҳу минний ваман ааасаний файннака ғафурун роҳиймун
                Роббана инний асканту мин сурриййатий бивадин ғайри сий зарааин ааинда байтика алмуҳаррами роббана лийуқийму ассалата файжааал афидатан мина аннаси таҳвий илайҳим ваорзуқҳум мина ассамарати лааааллааҳум йашкуруна
                Роббана иннака таааламу ма нухфий вама нуаалину вама йахфа ааала аллааҳи мин шайин фий аларди вала фий ассамай
                Алҳамду лиллаҳи аллазий ваҳаба лий ааала алкибари исмаааийла вайшақа инна роббий ласамийаау аддуааай
                Робби ижааалний муқийма ассалати вамин сурриййатий роббана втақаббал дуааай
                Роббана иғфир лий валивалидаййа валилмуминийна йаума йақуму алҳисабу
                Вала таҳсабанна аллааҳа ғафилан ааамма йааамалу ассалимуна иннама йуаххируҳум лийаумин ташхасу фийҳи алабсару
                Муҳтиааийна муқниааий руусиҳим ла йартадду илайҳим тарфуҳум ваафидатуҳум ҳауаон
                Ваансири аннаса йаума йатийҳиму алааасабу файақулу аллазийна саламу роббана аххирна ила ажалин қарийбин нужиб дааауатака ванаттабиааи аррусула ауалам такуну ақсамтум мин қаблу ма лакум мин зауалин
                Васакантум фий масакини аллазийна саламу анфусаҳум ватабаййана лакум кайфа фаааална биҳим вадаробна лакуму аламсала
                Вақад макару макроҳум вааайнда аллааҳи макруҳум вайн кана макруҳум литазула минҳу алжибалу
                Фала таҳсабанна аллааҳа мухлифа вааадиҳи русулаҳу инна аллааҳа ааазийзун су интиқамин
                Йаума тубаддалу аларду ғайра аларди ваалссамауату вабаразу лиллаҳи алваҳиди алқаҳҳари
                Ватара алмужримийна йаумайсин муқарранийна фий аласфади
                Саробийлуҳум мин қатранин ватағша вужуҳаҳуму аннару
                Лийажзийа аллааҳу кулла нафсин ма касабат инна аллааҳа сарийаау алҳисаби
                Ҳаса балағун лилннаси валийунсару биҳи валийаааламу аннама ҳува илаҳун ваҳидун валийассаккара олу алалбаби
            """.trimIndent(),
        ),
        Surah(
            id = 15,
            arabicName = "الحجر",
            latinName = "Al-Hijr",
            transliteration = """
                Алифламра тилка айату алкитаби вақуранин мубийнин
                Рубама йауадду аллазийна кафару лау кану муслимийна
                Сарҳум йакулу вайатаматтааау вайулҳиҳиму аламалу фасауфа йаааламуна
                Вама аҳлакна мин қарйатин илла валаҳа китабун мааалумун
                Ма тасбиқу мин омматин ажалаҳа вама йастахируна
                Вақалу йа аййуҳа аллазий нуззила ааалайҳи ассикру иннака ламажнунун
                Лау ма татийна биалмалайкати ин кунта мина ассадиқийна
                Ма нуназзилу алмалайката илла биалҳаққи вама кану исан мунсарийна
                Инна наҳну наззална ассикра вайнна лаҳу лаҳафисуна
                Валақад арсална мин қаблика фий шийааай алаувалийна
                Вама йатийҳим мин расулин илла кану биҳи йастаҳзиуна
                Касалика наслукуҳу фий қулуби алмужримийна
                Ла йуминуна биҳи вақад халат суннату алаувалийна
                Валау фатаҳна ааалайҳим бабан мина ассамай фасаллу фийҳи йаааружуна
                Лақалу иннама суккират абсаруна бал наҳну қаумун машуруна
                Валақад жаааална фий ассамай буружан вазаййаннаҳа лилннасирийна
                Ваҳафиснаҳа мин кулли шайтанин ражиймин
                Илла мани истарақа ассамааа фаатбааааҳу шиҳабун мубийнун
                Вааларда мададнаҳа ваалқайна фийҳа рауасийа ваанбатна фийҳа мин кулли шайин маузунин
                Важаааална лакум фийҳа маааайиша ваман ластум лаҳу биразиқийна
                Вайн мин шайин илла ааиндана хазайнуҳу вама нуназзилуҳу илла биқадарин мааалумин
                Ваарсална аррийаҳа лауақиҳа фаанзална мина ассамай маан фаасқайнакумуҳу вама антум лаҳу бихазинийна
                Вайнна ланаҳну нуҳйий ванумийту ванаҳну алварисуна
                Валақад ааалимна алмустақдимийна минкум валақад ааалимна алмустахирийна
                Вайнна роббака ҳува йаҳшуруҳум иннаҳу ҳакиймун ааалиймун
                Валақад халақна алинсана мин салсалин мин ҳамайн маснунин
                Ваалжанна халақнаҳу мин қаблу мин нари ассамуми
                Вайс қала роббука лилмалайкати инний халиқун башаран мин салсалин мин ҳамайн маснунин
                Файса саувайтуҳу ванафахту фийҳи мин руҳий фақааау лаҳу сажидийна
                Фасажада алмалайкату куллуҳум ажмааауна
                Илла иблийса аба ан йакуна маааа ассажидийна
                Қала йа иблийсу ма лака алла такуна маааа ассажидийна
                Қала лам акун лиасжуда либашарин халақтаҳу мин салсалин мин ҳамайн маснунин
                Қала фаохруж минҳа файннака ражиймун
                Вайнна ааалайка аллаааната ила йауми аддийни
                Қала робби фаансирний ила йауми йубааасуна
                Қала файннака мина алмунсарийна
                Ила йауми алвақти алмааалуми
                Қала робби бима ағвайтаний лаозаййинанна лаҳум фий аларди валаоғвийаннаҳум ажмаааийна
                Илла ааибадака минҳуму алмухласийна
                Қала ҳаса сиратун ааалаййа мустақиймун
                Инна ааибадий лайса лака ааалайҳим султанун илла мани иттабаааака мина алғауийна
                Вайнна жаҳаннама ламауааидуҳум ажмаааийна
                Лаҳа сабааату абвабин ликулли бабин минҳум жузон мақсумун
                Инна алмуттақийна фий жаннатин вааауйунин
                Одхулуҳа бисаламин аминийна
                Ваназааана ма фий судуриҳим мин ғиллин ихванан ааала сурурин мутақабилийна
                Ла йамассуҳум фийҳа насабун вама ҳум минҳа бимухражийна
                Набби ааибадий анний ана алғафуру арроҳийму
                Ва анна ааасабий ҳува алааасабу алалийму
                Ванаббиҳум ааан дайфи иброҳийма
                Ис дахалу ааалайҳи фақалу саламан қала инна минкум важилуна
                Қалу ла таужал инна нубашширука биғуламин ааалиймин
                Қала абашшартумуний ааала ан массанийа алкибару фабима тубашшируни
                Қалу башшарнака биалҳаққи фала такун мина алқанитийна
                Қала ваман йақнату мин роҳмати роббиҳи илла аддаллуна
                Қала фама хатбукум аййуҳа алмурсалуна
                Қалу инна орсилна ила қаумин мужримийна
                Илла ала лутин инна ламунажжуҳум ажмаааийна
                Илла имраатаҳу қаддарна иннаҳа ламина алғабирийна
                Фаламма жаа ала лутин алмурсалуна
                Қала иннакум қаумун мункаруна
                Қалу бал жинака бима кану фийҳи йамтаруна
                Ваатайнака биалҳаққи вайнна ласадиқуна
                Фаасри биаҳлика биқитааин мина аллайли вайттабиаа адбароҳум вала йалтафит минкум аҳадун ваймду ҳайсу тумаруна
                Вақадайна илайҳи салика аламра анна дабира ҳаолай мақтуааун мусбиҳийна
                Важаа аҳлу алмадийнати йастабшируна
                Қала инна ҳаолай дайфий фала тафдаҳуни
                Вайттақу аллааҳа вала тухзуни
                Қалу ауалам нанҳака ааани алаааламийна
                Қала ҳаолай банатий ин кунтум фааайлийна
                Лаааамрука иннаҳум лафий сакратиҳим йааамаҳуна
                Фаахасасуму ассайҳату мушриқийна
                Фажаааална ааалийаҳа сафилаҳа ваамтарна ааалайҳим ҳижаратан мин сижжийлин
                Инна фий салика лаайатин лилмутауассимийна
                Вайннаҳа лабисабийлин муқиймин
                Инна фий салика лаайатан лилмуминийна
                Вайн кана ашабу алайкати ласалимийна
                Файнтақамна минҳум вайннаҳума лабиймамин мубийнин
                Валақад кассаба ашабу алҳижри алмурсалийна
                Ваатайнаҳум айатина факану ааанҳа муааридийна
                Вакану йанҳитуна мина алжибали буйутан аминийна
                Фаахасасуму ассайҳату мусбиҳийна
                Фама ағна ааанҳум ма кану йаксибуна
                Вама халақна ассамауати вааларда вама байнаҳума илла биалҳаққи вайнна ассаааата лаатийатун файсфаҳи ассафҳа алжамийла
                Инна роббака ҳува алхаллақу алааалийму
                Валақад атайнака сабааан мина алмасаний ваалқурана алааасийма
                Ла тамудданна ааайнайка ила ма маттааана биҳи азважан минҳум вала таҳзан ааалайҳим вайхфид жанаҳака лилмуминийна
                Вақул инний ана аннасийру алмубийну
                Кама анзална ааала алмуқтасимийна
                Аллазийна жаааалу алқурана ааидийна
                Фауароббика ланасаланнаҳум ажмаааийна
                Ааамма кану йааамалуна
                Файсдааа бима тумару ваааарид ааани алмушрикийна
                Инна кафайнака алмустаҳзиийна
                Аллазийна йажааалуна маааа аллааҳи илаҳан ахара фасауфа йаааламуна
                Валақад наааламу аннака йадийқу садрука бима йақулуна
                Фасаббиҳ биҳамди роббика вакун мина ассажидийна
                Ваоаабуд роббака ҳатта йатийака алйақийну
            """.trimIndent(),
        ),
        Surah(
            id = 16,
            arabicName = "النحل",
            latinName = "An-Nahl",
            transliteration = """
                Ата амру аллааҳи фала тастааажилуҳу субҳанаҳу ватаааала ааамма йушрикуна
                Йуназзилу алмалайката биалрруҳи мин амриҳи ааала ман йашао мин ааибадиҳи ан ансиру аннаҳу ла илаҳа илла ана файттақуни
                Халақа ассамауати вааларда биалҳаққи таааала ааамма йушрикуна
                Халақа алинсана мин нутфатин файса ҳува хасиймун мубийнун
                Вааланааама халақаҳа лакум фийҳа дифон ваманафиаау ваминҳа такулуна
                Валакум фийҳа жамалун ҳийна турийҳуна ваҳийна тасроҳуна
                Ватаҳмилу асқалакум ила баладин лам такуну балиғийҳи илла бишиққи аланфуси инна роббакум ларауфун роҳиймун
                Ваалхайла ваалбиғала ваалҳамийра литаркабуҳа вазийнатан вайахлуқу ма ла таааламуна
                Ваааала аллааҳи қасду ассабийли ваминҳа жайрун валау шаа лаҳадакум ажмаааийна
                Ҳува аллазий анзала мина ассамай маан лакум минҳу шаробун ваминҳу шажарун фийҳи тусиймуна
                Йунбиту лакум биҳи аззарааа ваалззайтуна ваалннахийла ваалааанаба вамин кулли ассамарати инна фий салика лаайатан лиқаумин йатафаккаруна
                Васаххара лакуму аллайла ваалннаҳара ваалшшамса ваалқамара ваалннужуму мусаххаратун биамриҳи инна фий салика лаайатин лиқаумин йааақилуна
                Вама сараа лакум фий аларди мухталифан алвануҳу инна фий салика лаайатан лиқаумин йассаккаруна
                Ваҳува аллазий саххара албаҳра литакулу минҳу лаҳман тариййан ватастахрижу минҳу ҳилйатан талбасунаҳа ватара алфулка мауахира фийҳи валитабтағу мин фадлиҳи валааааллакум ташкуруна
                Ваалқа фий аларди рауасийа ан тамийда бикум ваанҳаран васубулан лааааллакум таҳтадуна
                Вааааламатин вабиалннажми ҳум йаҳтадуна
                Афаман йахлуқу каман ла йахлуқу афала тасаккаруна
                Вайн таааудду ниаамата аллааҳи ла туҳсуҳа инна аллааҳа лағафурун роҳиймун
                Вааллааҳу йаааламу ма тусирруна вама туаалинуна
                Вааллазийна йадаауна мин дуни аллааҳи ла йахлуқуна шайан ваҳум йухлақуна
                Амватун ғайру аҳйайн вама йашаауруна аййана йубааасуна
                Илаҳукум илаҳун ваҳидун фааллазийна ла йуминуна биалахирати қулубуҳум мункиратун ваҳум мустакбируна
                Ла жарама анна аллааҳа йаааламу ма йусирруна вама йуаалинуна иннаҳу ла йуҳиббу алмустакбирийна
                Вайса қийла лаҳум маса анзала роббукум қалу асатийру алаувалийна
                Лийаҳмилу аузароҳум камилатан йаума алқийамати вамин аузари аллазийна йудиллунаҳум биғайри ааилмин ала саа ма йазируна
                Қад макара аллазийна мин қаблиҳим фаата аллааҳу бунйанаҳум мина алқауааайди фахарра ааалайҳиму ассақфу мин фауқиҳим ваатаҳуму алааасабу мин ҳайсу ла йашаауруна
                Сумма йаума алқийамати йухзийҳим вайақулу айна шуракаййа аллазийна кунтум тушаққуна фийҳим қала аллазийна уту алааилма инна алхизйа алйаума ваалссуа ааала алкафирийна
                Аллазийна татауаффаҳуму алмалайкату салимий анфусиҳим фаалқауу ассалама ма кунна нааамалу мин суин бала инна аллааҳа ааалиймун бима кунтум тааамалуна
                Фаодхулу абваба жаҳаннама халидийна фийҳа фалабиса масва алмутакаббирийна
                Вақийла лиллазийна иттақау маса анзала роббукум қалу хайран лиллазийна аҳсану фий ҳасиҳи аддунйа ҳасанатун валадару алахирати хайрун валаниаама дару алмуттақийна
                Жаннату аааднин йадхулунаҳа тажрий мин таҳтиҳа аланҳару лаҳум фийҳа ма йашауна касалика йажзий аллааҳу алмуттақийна
                Аллазийна татауаффаҳуму алмалайкату таййибийна йақулуна саламун ааалайкуму одхулу алжанната бима кунтум тааамалуна
                Ҳал йансуруна илла ан татийаҳуму алмалайкату ау йатийа амру роббика касалика фаааала аллазийна мин қаблиҳим вама саламаҳуму аллааҳу валакин кану анфусаҳум йаслимуна
                Фаасабаҳум саййиату ма ааамилу ваҳақа биҳим ма кану биҳи йастаҳзиуна
                Вақала аллазийна ашраку лау шаа аллааҳу ма ааабадна мин дуниҳи мин шайин наҳну вала абаона вала ҳаррамна мин дуниҳи мин шайин касалика фаааала аллазийна мин қаблиҳим фаҳал ааала аррусули илла албалағу алмубийну
                Валақад баааасна фий кулли омматин расулан ани оаабуду аллааҳа вайжтанибу аттағута фаминҳум ман ҳада аллааҳу ваминҳум ман ҳаққат ааалайҳи аддалалату фасийру фий аларди фаонсуру кайфа кана ааақибату алмукассибийна
                Ин таҳрис ааала ҳудаҳум файнна аллааҳа ла йаҳдий ман йудиллу вама лаҳум мин насирийна
                Ваақсаму биаллааҳи жаҳда айманиҳим ла йабааасу аллааҳу ман йамуту бала вааадан ааалайҳи ҳаққан валакинна аксара аннаси ла йаааламуна
                Лийубаййина лаҳуму аллазий йахталифуна фийҳи валийааалама аллазийна кафару аннаҳум кану касибийна
                Иннама қаулуна лишайин иса араднаҳу ан нақула лаҳу кун файакуну
                Вааллазийна ҳажару фий аллааҳи мин бааади ма сулиму ланубаувианнаҳум фий аддунйа ҳасанатан валаажру алахирати акбару лау кану йаааламуна
                Аллазийна сабару ваааала роббиҳим йатауаккалуна
                Вама арсална мин қаблика илла рижалан нуҳий илайҳим файсалу аҳла ассикри ин кунтум ла таааламуна
                Биалбаййинати ваалззубури ваанзална илайка ассикра литубаййина лилннаси ма нуззила илайҳим валааааллааҳум йатафаккаруна
                Афаамина аллазийна макару ассаййиати ан йахсифа аллааҳу биҳиму аларда ау йатийаҳуму алааасабу мин ҳайсу ла йашаауруна
                Ау йахусаҳум фий тақаллубиҳим фама ҳум бимуаажизийна
                Ау йахусаҳум ааала тахаувуфин файнна роббакум ларауфун роҳиймун
                Ауа лам йарау ила ма халақа аллааҳу мин шайин йатафаййао силалуҳу ааани алйамийни ваалшшамайли сужжадан лиллаҳи ваҳум дахируна
                Валиллаҳи йасжуду ма фий ассамауати вама фий аларди мин даббатин ваалмалайкату ваҳум ла йастакбируна
                Йахафуна роббаҳум мин фауқиҳим вайафааалуна ма йумаруна
                Вақала аллааҳу ла таттахису илаҳайни иснайни иннама ҳува илаҳун ваҳидун файййайа файрҳабуни
                Валаҳу ма фий ассамауати вааларди валаҳу аддийну васибан афағайра аллааҳи таттақуна
                Вама бикум мин ниааматин фамина аллааҳи сумма иса массакуму аддурру файлайҳи тажаруна
                Сумма иса кашафа аддурра ааанкум иса фарийқун минкум бироббиҳим йушрикуна
                Лийакфуру бима атайнаҳум фатаматтааау фасауфа таааламуна
                Вайажааалуна лима ла йаааламуна насийбан мимма разақнаҳум тааллааҳи латусалунна ааамма кунтум тафтаруна
                Вайажааалуна лиллаҳи албанати субҳанаҳу валаҳум ма йаштаҳуна
                Вайса бушшира аҳадуҳум биалонса салла важҳуҳу мусваддан ваҳува касиймун
                Йатауара мина алқауми мин суи ма бушшира биҳи айумсикуҳу ааала ҳунин ам йадуссуҳу фий аттуроби ала саа ма йаҳкумуна
                Лиллазийна ла йуминуна биалахирати масалу ассауи валиллаҳи алмасалу алааала ваҳува алааазийзу алҳакийму
                Валау йуахису аллааҳу аннаса бисулмиҳим ма тарака ааалайҳа мин даббатин валакин йуаххируҳум ила ажалин мусамман файса жаа ажалуҳум ла йастахируна саааатан вала йастақдимуна
                Вайажааалуна лиллаҳи ма йакроҳуна ватасифу алсинатуҳуму алкасиба анна лаҳуму алҳусна ла жарама анна лаҳуму аннара вааннаҳум муфратуна
                Тааллааҳи лақад арсална ила омамин мин қаблика фазаййана лаҳуму ашшайтану ааамалаҳум фаҳува валиййуҳуму алйаума валаҳум ааасабун алиймун
                Вама анзална ааалайка алкитаба илла литубаййина лаҳуму аллазий ихталафу фийҳи ваҳудан вароҳматан лиқаумин йуминуна
                Вааллааҳу анзала мина ассамай маан фааҳйа биҳи аларда бааада маутиҳа инна фий салика лаайатан лиқаумин йасмааауна
                Вайнна лакум фий аланааами лааайбратан нусқийкум мимма фий бутуниҳи мин байни фарсин вадамин лабанан халисан сайған лилшшарибийна
                Вамин самарати аннахийли ваалааанаби таттахисуна минҳу сакаран варизқан ҳасанан инна фий салика лаайатан лиқаумин йааақилуна
                Ваавҳа роббука ила аннаҳли ани иттахисий мина алжибали буйутан вамина ашшажари вамимма йаааришуна
                Сумма кулий мин кулли ассамарати фаослукий субула роббики сулулан йахружу мин бутуниҳа шаробун мухталифун алвануҳу фийҳи шифаон лилннаси инна фий салика лаайатан лиқаумин йатафаккаруна
                Вааллааҳу халақакум сумма йатауаффакум ваминкум ман йурадду ила арсали алааумури ликай ла йааалама бааада ааилмин шайан инна аллааҳа ааалиймун қадийрун
                Вааллааҳу фаддала бааадакум ааала бааадин фий арризқи фама аллазийна фуддилу бираддий ризқиҳим ааала ма малакат аймануҳум фаҳум фийҳи сауаон афабиниаамати аллааҳи йажҳадуна
                Вааллааҳу жаааала лакум мин анфусикум азважан важаааала лакум мин азважикум банийна ваҳафадатан варазақакум мина аттаййибати афабиалбатили йуминуна вабиниаамати аллааҳи ҳум йакфуруна
                Вайааабудуна мин дуни аллааҳи ма ла йамлику лаҳум ризқан мина ассамауати вааларди шайан вала йастатийаауна
                Фала тадрибу лиллаҳи аламсала инна аллааҳа йаааламу ваантум ла таааламуна
                Дароба аллааҳу масалан ааабдан мамлукан ла йақдиру ааала шайин ваман разақнаҳу минна ризқан ҳасанан фаҳува йунфиқу минҳу сирран важаҳран ҳал йастаууна алҳамду лиллаҳи бал аксаруҳум ла йаааламуна
                Вадароба аллааҳу масалан ражулайни аҳадуҳума абкаму ла йақдиру ааала шайин ваҳува каллун ааала маулаҳу айнама йуважжиҳҳу ла йати бихайрин ҳал йастауий ҳува ваман йамуру биалааадли ваҳува ааала сиратин мустақиймин
                Валиллаҳи ғайбу ассамауати вааларди вама амру ассаааати илла каламҳи албасари ау ҳува ақробу инна аллааҳа ааала кулли шайин қадийрун
                Вааллааҳу ахражакум мин бутуни оммаҳатикум ла таааламуна шайан важаааала лакуму ассамааа ваалабсара ваалафидата лааааллакум ташкуруна
                Алам йарау ила аттайри мусаххаратин фий жауви ассамай ма йумсикуҳунна илла аллааҳу инна фий салика лаайатин лиқаумин йуминуна
                Вааллааҳу жаааала лакум мин буйутикум саканан важаааала лакум мин жулуди аланааами буйутан тастахиффунаҳа йаума саааникум вайаума иқаматикум вамин асвафиҳа ваавбариҳа ваашааариҳа асасан ваматаааан ила ҳийнин
                Вааллааҳу жаааала лакум мимма халақа силалан важаааала лакум мина алжибали акнанан важаааала лакум саробийла тақийкуму алҳарра васаробийла тақийкум басакум касалика йутимму ниааматаҳу ааалайкум лааааллакум туслимуна
                Файн тауаллау файннама ааалайка албалағу алмубийну
                Йааарифуна ниаамата аллааҳи сумма йункирунаҳа вааксаруҳуму алкафируна
                Вайаума набааасу мин кулли омматин шаҳийдан сумма ла йусану лиллазийна кафару вала ҳум йустааатабуна
                Вайса раа аллазийна саламу алааасаба фала йухаффафу ааанҳум вала ҳум йунсаруна
                Вайса раа аллазийна ашраку шуракааҳум қалу роббана ҳаолай шуракаона аллазийна кунна надаау мин дуника фаалқау илайҳиму алқаула иннакум лакасибуна
                Ваалқау ила аллааҳи йаумайсин ассалама вадалла ааанҳум ма кану йафтаруна
                Аллазийна кафару васадду ааан сабийли аллааҳи зиднаҳум ааасабан фауқа алааасаби бима кану йуфсидуна
                Вайаума набааасу фий кулли омматин шаҳийдан ааалайҳим мин анфусиҳим важина бика шаҳийдан ааала ҳаолай ваназзална ааалайка алкитаба тибйанан ликулли шайин ваҳудан вароҳматан вабушра лилмуслимийна
                Инна аллааҳа йамуру биалааадли ваалиҳсани ваийтай сий алқурба вайанҳа ааани алфаҳшай ваалмункари ваалбағйи йааайсукум лааааллакум тасаккаруна
                Ваавфу биаааҳди аллааҳи иса аааҳадтум вала танқуду алаймана бааада таукийдиҳа вақад жаааалтуму аллааҳа ааалайкум кафийлан инна аллааҳа йаааламу ма тафааалуна
                Вала такуну кааллатий нақадат ғазлаҳа мин бааади қувватин анкасан таттахисуна айманакум дахалан байнакум ан такуна омматун ҳийа арба мин омматин иннама йаблукуму аллааҳу биҳи валайубаййинанна лакум йаума алқийамати ма кунтум фийҳи тахталифуна
                Валау шаа аллааҳу лажаааалакум омматан ваҳидатан валакин йудиллу ман йашао вайаҳдий ман йашао валатусалунна ааамма кунтум тааамалуна
                Вала таттахису айманакум дахалан байнакум фатазилла қадамун бааада субутиҳа ватасуқу ассуа бима сададтум ааан сабийли аллааҳи валакум ааасабун ааасиймун
                Вала таштару биаааҳди аллааҳи саманан қалийлан иннама ааинда аллааҳи ҳува хайрун лакум ин кунтум таааламуна
                Ма ааиндакум йанфаду вама ааинда аллааҳи бақин валанажзийанна аллазийна сабару ажроҳум биаҳсани ма кану йааамалуна
                Ман ааамила салиҳан мин сакарин ау онса ваҳува муминун фалануҳйийаннаҳу ҳайатан таййибатан валанажзийаннаҳум ажроҳум биаҳсани ма кану йааамалуна
                Файса қарата алқурана файстааайс биаллааҳи мина ашшайтани арражийми
                Иннаҳу лайса лаҳу султанун ааала аллазийна аману ваааала роббиҳим йатауаккалуна
                Иннама султануҳу ааала аллазийна йатауаллаунаҳу вааллазийна ҳум биҳи мушрикуна
                Вайса баддална айатан макана айатин вааллааҳу аааламу бима йуназзилу қалу иннама анта муфтарин бал аксаруҳум ла йаааламуна
                Қул наззалаҳу руҳу алқудуси мин роббика биалҳаққи лийусаббита аллазийна аману ваҳудан вабушра лилмуслимийна
                Валақад наааламу аннаҳум йақулуна иннама йуаааллимуҳу башарун лисану аллазий йулҳидуна илайҳи ааажамиййун ваҳаса лисанун аааробиййун мубийнун
                Инна аллазийна ла йуминуна биайати аллааҳи ла йаҳдийҳиму аллааҳу валаҳум ааасабун алиймун
                Иннама йафтарий алкасиба аллазийна ла йуминуна биайати аллааҳи ваолайка ҳуму алкасибуна
                Ман кафара биаллааҳи мин бааади ийманиҳи илла ман окриҳа вақалбуҳу мутмайннун биалиймани валакин ман шароҳа биалкуфри садран фаааалайҳим ғадабун мина аллааҳи валаҳум ааасабун ааасиймун
                Салика бианнаҳуму истаҳаббу алҳайата аддунйа ааала алахирати ваанна аллааҳа ла йаҳдий алқаума алкафирийна
                Олайка аллазийна табаааа аллааҳу ааала қулубиҳим васамааиҳим ваабсариҳим ваолайка ҳуму алғафилуна
                Ла жарама аннаҳум фий алахирати ҳуму алхасируна
                Сумма инна роббака лиллазийна ҳажару мин бааади ма футину сумма жаҳаду васабару инна роббака мин бааадиҳа лағафурун роҳиймун
                Йаума татий куллу нафсин тужадилу ааан нафсиҳа ватуваффа куллу нафсин ма ааамилат ваҳум ла йусламуна
                Вадароба аллааҳу масалан қарйатан канат аминатан мутмайннатан йатийҳа ризқуҳа рағадан мин кулли маканин факафарат бианаауми аллааҳи фаасақаҳа аллааҳу либаса алжуааи ваалхауфи бима кану йаснааауна
                Валақад жааҳум расулун минҳум факассабуҳу фаахасаҳуму алааасабу ваҳум салимуна
                Факулу мимма разақакуму аллааҳу ҳалалан таййибан ваошкуру ниаамата аллааҳи ин кунтум иййаҳу тааабудуна
                Иннама ҳаррама ааалайкуму алмайтата ваалддама валаҳма алхинзийри вама оҳилла лиғайри аллааҳи биҳи фамани идтурра ғайра бағин вала ааадин файнна аллааҳа ғафурун роҳиймун
                Вала тақулу лима тасифу алсинатукуму алкасиба ҳаса ҳалалун ваҳаса ҳарамун литафтару ааала аллааҳи алкасиба инна аллазийна йафтаруна ааала аллааҳи алкасиба ла йуфлиҳуна
                Матаааун қалийлун валаҳум ааасабун алиймун
                Ваааала аллазийна ҳаду ҳаррамна ма қасасна ааалайка мин қаблу вама саламнаҳум валакин кану анфусаҳум йаслимуна
                Сумма инна роббака лиллазийна ааамилу ассуа бижаҳалатин сумма табу мин бааади салика вааслаҳу инна роббака мин бааадиҳа лағафурун роҳиймун
                Инна иброҳийма кана омматан қанитан лиллаҳи ҳанийфан валам йаку мина алмушрикийна
                Шакиран лианааумиҳи ижтабаҳу ваҳадаҳу ила сиратин мустақиймин
                Ваатайнаҳу фий аддунйа ҳасанатан вайннаҳу фий алахирати ламина ассалиҳийна
                Сумма ауҳайна илайка ани иттабиаа миллата иброҳийма ҳанийфан вама кана мина алмушрикийна
                Иннама жуааила ассабту ааала аллазийна ихталафу фийҳи вайнна роббака лайаҳкуму байнаҳум йаума алқийамати фийма кану фийҳи йахталифуна
                Одаау ила сабийли роббика биалҳикмати ваалмауааисати алҳасанати важадилҳум биаллатий ҳийа аҳсану инна роббака ҳува аааламу биман далла ааан сабийлиҳи ваҳува аааламу биалмуҳтадийна
                Вайн ааақабтум фаааақибу бимисли ма аауқибтум биҳи валайн сабартум лаҳува хайрун лилссабирийна
                Вайсбир вама сабрука илла биаллааҳи вала таҳзан ааалайҳим вала таку фий дайқин мимма йамкуруна
                Инна аллааҳа маааа аллазийна иттақау вааллазийна ҳум муҳсинуна
            """.trimIndent(),
        ),
        Surah(
            id = 17,
            arabicName = "الإسراء",
            latinName = "Al-Isra",
            transliteration = """
                Субҳана аллазий асра биааабдиҳи лайлан мина алмасжиди алҳарами ила алмасжиди алақса аллазий баракна ҳаулаҳу линурийаҳу мин айатина иннаҳу ҳува ассамийаау албасийру
                Ваатайна муса алкитаба важаааалнаҳу ҳудан либаний исраийла алла таттахису мин дуний вакийлан
                Сурриййата ман ҳамална маааа нуҳин иннаҳу кана ааабдан шакуран
                Вақадайна ила баний исраийла фий алкитаби латуфсидунна фий аларди марратайни валатааалунна ааулувван кабийран
                Файса жаа ваааду улаҳума баааасна ааалайкум ааибадан лана олий басин шадийдин фажасу хилала аддийари вакана вааадан мафааулан
                Сумма рададна лакуму алкаррата ааалайҳим ваамдаднакум биамвалин вабанийна важаааалнакум аксара нафийран
                Ин аҳсантум аҳсантум лианфусикум вайн асатум фалаҳа файса жаа ваааду алахирати лийасуу вужуҳакум валийадхулу алмасжида кама дахалуҳу аувала марратин валийутаббиру ма ааалау татбийран
                Аааса роббукум ан йарҳамакум вайн ааудтум ааудна важаааална жаҳаннама лилкафирийна ҳасийран
                Инна ҳаса алқурана йаҳдий лиллатий ҳийа ақваму вайубашширу алмуминийна аллазийна йааамалуна ассалиҳати анна лаҳум ажран кабийран
                Ваанна аллазийна ла йуминуна биалахирати ааатадна лаҳум ааасабан алийман
                Вайадаау алинсану биалшшарри дуааааҳу биалхайри вакана алинсану ааажулан
                Важаааална аллайла ваалннаҳара айатайни фамаҳауна айата аллайли важаааална айата аннаҳари мубсиратан литабтағу фадлан мин роббикум валитаааламу ааадада ассинийна ваалҳисаба вакулла шайин фассалнаҳу тафсийлан
                Вакулла инсанин алзамнаҳу тайроҳу фий ааунуқиҳи ванухрижу лаҳу йаума алқийамати китабан йалқаҳу маншуран
                Иқра китабака кафа бинафсика алйаума ааалайка ҳасийбан
                Мани иҳтада файннама йаҳтадий линафсиҳи ваман далла файннама йадиллу ааалайҳа вала тазиру вазиратун визра охра вама кунна муааассибийна ҳатта набаааса расулан
                Вайса арадна ан нуҳлика қарйатан амарна мутрафийҳа фафасақу фийҳа фаҳаққа ааалайҳа алқаулу фадаммарнаҳа тадмийран
                Вакам аҳлакна мина алқуруни мин бааади нуҳин вакафа бироббика бисунуби ааибадиҳи хабийран басийран
                Ман кана йурийду алааажилата ааажжална лаҳу фийҳа ма нашао лиман нурийду сумма жаааална лаҳу жаҳаннама йаслаҳа масмуман мазуран
                Ваман арада алахирата васаааа лаҳа сааайаҳа ваҳува муминун фаолайка кана сааайуҳум машкуран
                Куллан нумидду ҳаолай ваҳаолай мин ааатай роббика вама кана ааатао роббика маҳсуран
                Онсур кайфа фаддална бааадаҳум ааала бааадин валалахирату акбару даражатин ваакбару тафдийлан
                Ла тажааал маааа аллааҳи илаҳан ахара фатақаауда масмуман махсулан
                Вақада роббука алла тааабуду илла иййаҳу вабиалвалидайни иҳсанан имма йаблуғанна ааиндака алкибара аҳадуҳума ау килаҳума фала тақул лаҳума оффин вала танҳарҳума вақул лаҳума қаулан карийман
                Вайхфид лаҳума жанаҳа ассулли мина арроҳмати вақул робби ирҳамҳума кама роббайаний сағийран
                Роббукум аааламу бима фий нуфусикум ин такуну салиҳийна файннаҳу кана лилаувабийна ғафуран
                Ваати са алқурба ҳаққаҳу ваалмискийна вайбна ассабийли вала тубассир табсийран
                Инна алмубассирийна кану ихвана ашшайатийни вакана ашшайтану лироббиҳи кафуран
                Ваймма туаариданна ааанҳуму ибтиғаа роҳматин мин роббика таржуҳа фақул лаҳум қаулан майсуран
                Вала тажааал йадака мағлулатан ила ааунуқика вала табсуса кулла албасти фатақаауда малуман маҳсуран
                Инна роббака йабсуту арризқа лиман йашао вайақдиру иннаҳу кана биааибадиҳи хабийран басийран
                Вала тақтулу ауладакум хашйата имлақин наҳну нарзуқуҳум вайййакум инна қатлаҳум кана хитан кабийран
                Вала тақробу аззина иннаҳу кана фаҳишатан васаа сабийлан
                Вала тақтулу аннафса аллатий ҳаррама аллааҳу илла биалҳаққи ваман қутила маслуман фақад жаааална ливалиййиҳи султанан фала йусриф фий алқатли иннаҳу кана мансуран
                Вала тақробу мала алйатийми илла биаллатий ҳийа аҳсану ҳатта йаблуға ашуддаҳу ваавфу биалаааҳди инна алаааҳда кана масулан
                Ваавфу алкайла иса килтум вазину биалқистаси алмустақийми салика хайрун вааҳсану тауийлан
                Вала тақфу ма лайса лака биҳи ааилмун инна ассамааа ваалбасара ваалфуада куллу олайка кана ааанҳу масулан
                Вала тамши фий аларди мароҳан иннака лан тахриқа аларда валан таблуға алжибала тулан
                Куллу салика кана саййиоҳу ааинда роббика макруҳан
                Салика мимма ауҳа илайка роббука мина алҳикмати вала тажааал маааа аллааҳи илаҳан ахара фатулқа фий жаҳаннама малуман мазуран
                Афаасфакум роббукум биалбанийна вайттахаса мина алмалайкати инасан иннакум латақулуна қаулан ааасийман
                Валақад саррафна фий ҳаса алқурани лийассаккару вама йазийдуҳум илла нуфуран
                Қул лау кана мааааҳу алиҳатун кама йақулуна исан лайбтағау ила сий алааарши сабийлан
                Субҳанаҳу ватаааала ааамма йақулуна ааулувван кабийран
                Тусаббиҳу лаҳу ассамауату ассабаау вааларду ваман фийҳинна вайн мин шайин илла йусаббиҳу биҳамдиҳи валакин ла тафқаҳуна тасбийҳаҳум иннаҳу кана ҳалийман ғафуран
                Вайса қарата алқурана жаааална байнака вабайна аллазийна ла йуминуна биалахирати ҳижабан мастуран
                Важаааална ааала қулубиҳим акиннатан ан йафқаҳуҳу вафий асаниҳим вақран вайса сакарта роббака фий алқурани ваҳдаҳу валлау ааала адбариҳим нуфуран
                Наҳну аааламу бима йастамиаауна биҳи ис йастамиаауна илайка вайс ҳум нажва ис йақулу ассалимуна ин таттабиаауна илла ражулан машуран
                Онсур кайфа даробу лака аламсала фадаллу фала йастатийаауна сабийлан
                Вақалу айса кунна ааисаман варуфатан айнна ламабааусуна халқан жадийдан
                Қул куну ҳижаратан ау ҳадийдан
                Ау халқан мимма йакбуру фий судурикум фасайақулуна ман йуааийдуна қули аллазий фатаракум аувала марратин фасайунғидуна илайка руусаҳум вайақулуна мата ҳува қул аааса ан йакуна қарийбан
                Йаума йадааукум фатастажийбуна биҳамдиҳи ватасуннуна ин лабистум илла қалийлан
                Вақул лиааибадий йақулу аллатий ҳийа аҳсану инна ашшайтана йанзағу байнаҳум инна ашшайтана кана лилинсани ааадувван мубийнан
                Роббукум аааламу бикум ин йаша йарҳамкум ау ин йаша йуааассибкум вама арсалнака ааалайҳим вакийлан
                Вароббука аааламу биман фий ассамауати вааларди валақад фаддална бааада аннабиййийна ааала бааадин ваатайна даууда забуран
                Қули одаау аллазийна заааамтум мин дуниҳи фала йамликуна кашфа аддурри ааанкум вала таҳвийлан
                Олайка аллазийна йадаауна йабтағуна ила роббиҳиму алвасийлата аййуҳум ақробу вайаржуна роҳматаҳу вайахафуна ааасабаҳу инна ааасаба роббика кана маҳсуран
                Вайн мин қарйатин илла наҳну муҳликуҳа қабла йауми алқийамати ау муааассибуҳа ааасабан шадийдан кана салика фий алкитаби мастуран
                Вама манаааана ан нурсила биалайати илла ан кассаба биҳа алаувалуна ваатайна самуда аннақата мубсиратан фасаламу биҳа вама нурсилу биалайати илла тахвийфан
                Вайс қулна лака инна роббака аҳата биалннаси вама жаааална арруйа аллатий арайнака илла фитнатан лилннаси ваалшшажарата алмалаауната фий алқурани ванухаувифуҳум фама йазийдуҳум илла туғйанан кабийран
                Вайс қулна лилмалайкати осжуду лиадама фасажаду илла иблийса қала аасжуду лиман халақта тийнан
                Қала араайтака ҳаса аллазий каррамта ааалаййа лайн аххартани ила йауми алқийамати лааҳтаниканна сурриййатаҳу илла қалийлан
                Қала исҳаб фаман табиааака минҳум файнна жаҳаннама жазаокум жазаан мауфуран
                Вайстафзиз мани истатааата минҳум бисаутика ваажлиб ааалайҳим бихайлика варажлика вашарихум фий аламвали ваалаулади вааайзум вама йааайдуҳуму ашшайтану илла ғуруран
                Инна ааибадий лайса лака ааалайҳим султанун вакафа бироббика вакийлан
                Роббукуму аллазий йузжий лакуму алфулка фий албаҳри литабтағу мин фадлиҳи иннаҳу кана бикум роҳийман
                Вайса массакуму аддурру фий албаҳри далла ман тадаауна илла иййаҳу фаламма нажжакум ила албарри ааарадтум вакана алинсану кафуран
                Афааминтум ан йахсифа бикум жаниба албарри ау йурсила ааалайкум ҳасибан сумма ла тажиду лакум вакийлан
                Ам аминтум ан йуааийдакум фийҳи таратан охра файурсила ааалайкум қасифан мина аррийҳи файуғриқакум бима кафартум сумма ла тажиду лакум ааалайна биҳи табийааан
                Валақад каррамна баний адама ваҳамалнаҳум фий албарри ваалбаҳри варазақнаҳум мина аттаййибати вафаддалнаҳум ааала касийрин мимман халақна тафдийлан
                Йаума надаау кулла онасин биймамиҳим фаман утийа китабаҳу бийамийниҳи фаолайка йақрауна китабаҳум вала йусламуна фатийлан
                Ваман кана фий ҳасиҳи ааама фаҳува фий алахирати ааама ваадаллу сабийлан
                Вайн каду лайафтинунака ааани аллазий ауҳайна илайка литафтарийа ааалайна ғайроҳу вайсан лайттахасука халийлан
                Валаула ан саббатнака лақад кидта таркану илайҳим шайан қалийлан
                Исан лаасақнака диаафа алҳайати вадиаафа алмамати сумма ла тажиду лака ааалайна насийран
                Вайн каду лайастафиззунака мина аларди лийухрижука минҳа вайсан ла йалбасуна хилафака илла қалийлан
                Сунната ман қад арсална қаблака мин русулина вала тажиду лисуннатина таҳвийлан
                Ақими ассалата лидулуки ашшамси ила ғасақи аллайли вақурана алфажри инна қурана алфажри кана машҳудан
                Вамина аллайли фатаҳажжад биҳи нафилатан лака аааса ан йабааасака роббука мақаман маҳмудан
                Вақул робби адхилний мудхала сидқин ваахрижний мухража сидқин вайжааал лий мин ладунка султанан насийран
                Вақул жаа алҳаққу вазаҳақа албатилу инна албатила кана заҳуқан
                Вануназзилу мина алқурани ма ҳува шифаон вароҳматун лилмуминийна вала йазийду ассалимийна илла хасаран
                Вайса анааамна ааала алинсани ааарада ванаа бижанибиҳи вайса массаҳу ашшарру кана йаусан
                Қул куллун йааамалу ааала шакилатиҳи фароббукум аааламу биман ҳува аҳда сабийлан
                Вайасалунака ааани арруҳи қули арруҳу мин амри роббий вама утийтум мина алааилми илла қалийлан
                Валайн шина ланасҳабанна биаллазий ауҳайна илайка сумма ла тажиду лака биҳи ааалайна вакийлан
                Илла роҳматан мин роббика инна фадлаҳу кана ааалайка кабийран
                Қул лайни ижтамаааати алинсу ваалжинну ааала ан йату бимисли ҳаса алқурани ла йатуна бимислиҳи валау кана бааадуҳум либааадин саҳийран
                Валақад саррафна лилннаси фий ҳаса алқурани мин кулли масалин фааба аксару аннаси илла куфуран
                Вақалу лан нумина лака ҳатта тафжура лана мина аларди йанбуааан
                Ау такуна лака жаннатун мин нахийлин вааайнабин фатуфажжира аланҳара хилалаҳа тафжийран
                Ау тусқита ассамаа кама заааамта ааалайна кисафан ау татийа биаллааҳи ваалмалайкати қабийлан
                Ау йакуна лака байтун мин зухруфин ау тарқа фий ассамай валан нумина лируқиййика ҳатта туназзила ааалайна китабан нақраоҳу қул субҳана роббий ҳал кунту илла башаран расулан
                Вама манаааа аннаса ан йумину ис жааҳуму алҳуда илла ан қалу абааааса аллааҳу башаран расулан
                Қул лау кана фий аларди малайкатун йамшуна мутмайннийна ланаззална ааалайҳим мина ассамай малакан расулан
                Қул кафа биаллааҳи шаҳийдан байний вабайнакум иннаҳу кана биааибадиҳи хабийран басийран
                Ваман йаҳди аллааҳу фаҳува алмуҳтади ваман йудлил фалан тажида лаҳум аулийаа мин дуниҳи ванаҳшуруҳум йаума алқийамати ааала вужуҳиҳим ааумйан вабукман васумман мауаҳум жаҳаннаму куллама хабат зиднаҳум саааийран
                Салика жазаоҳум бианнаҳум кафару биайатина вақалу айса кунна ааисаман варуфатан айнна ламабааусуна халқан жадийдан
                Ауалам йарау анна аллааҳа аллазий халақа ассамауати вааларда қадирун ааала ан йахлуқа мислаҳум важаааала лаҳум ажалан ла райба фийҳи фааба ассалимуна илла куфуран
                Қул лау антум тамликуна хазайна роҳмати роббий исан лаамсактум хашйата алинфақи вакана алинсану қатуран
                Валақад атайна муса тисааа айатин баййинатин файсал баний исраийла ис жааҳум фақала лаҳу фирааауну инний лаасуннука йа муса машуран
                Қала лақад ааалимта ма анзала ҳаолай илла роббу ассамауати вааларди басайра вайнний лаасуннука йа фирааауну масбуран
                Фаарада ан йастафиззаҳум мина аларди фаағрақнаҳу ваман мааааҳу жамийааан
                Вақулна мин бааадиҳи либаний исраийла оскуну аларда файса жаа ваааду алахирати жина бикум лафийфан
                Вабиалҳаққи анзалнаҳу вабиалҳаққи назала вама арсалнака илла мубашширан ванасийран
                Вақуранан фарақнаҳу литақрааҳу ааала аннаси ааала муксин ваназзалнаҳу танзийлан
                Қул амину биҳи ау ла тумину инна аллазийна уту алааилма мин қаблиҳи иса йутла ааалайҳим йахирруна лиласқани сужжадан
                Вайақулуна субҳана роббина ин кана ваааду роббина ламафааулан
                Вайахирруна лиласқани йабкуна вайазийдуҳум хушуааан
                Қули одаау аллааҳа ауи одаау арроҳмана аййан ма тадаау фалаҳу аласмао алҳусна вала тажҳар бисалатика вала тухафит биҳа вайбтағи байна салика сабийлан
                Вақули алҳамду лиллаҳи аллазий лам йаттахис валадан валам йакун лаҳу шарийкун фий алмулки валам йакун лаҳу валиййун мина ассулли вакаббирҳу такбийран
            """.trimIndent(),
        ),
        Surah(
            id = 18,
            arabicName = "الكهف",
            latinName = "Al-Kahf",
            transliteration = """
                Алҳамду лиллаҳи аллазий анзала ааала ааабдиҳи алкитаба валам йажааал лаҳу ааиважан
                Қаййиман лийунсира басан шадийдан мин ладунҳу вайубашшира алмуминийна аллазийна йааамалуна ассалиҳати анна лаҳум ажран ҳасанан
                Макисийна фийҳи абадан
                Вайунсира аллазийна қалу иттахаса аллааҳу валадан
                Ма лаҳум биҳи мин ааилмин вала лиабайҳим кабурат калиматан тахружу мин афваҳиҳим ин йақулуна илла касибан
                Фалааааллака бахиааун нафсака ааала асариҳим ин лам йумину биҳаса алҳадийси асафан
                Инна жаааална ма ааала аларди зийнатан лаҳа линаблуваҳум аййуҳум аҳсану ааамалан
                Вайнна лажааайлуна ма ааалайҳа саааийдан журузан
                Ам ҳасибта анна ашаба алкаҳфи ваалррақийми кану мин айатина ааажабан
                Ис ауа алфитйату ила алкаҳфи фақалу роббана атина мин ладунка роҳматан ваҳаййи лана мин амрина рашадан
                Фадаробна ааала асаниҳим фий алкаҳфи синийна ааададан
                Сумма бааааснаҳум линааалама аййу алҳизбайни аҳса лима лабису амадан
                Наҳну нақуссу ааалайка набааҳум биалҳаққи иннаҳум фитйатун аману бироббиҳим вазиднаҳум ҳудан
                Варобатна ааала қулубиҳим ис қаму фақалу роббуна роббу ассамауати вааларди лан надааува мин дуниҳи илаҳан лақад қулна исан шататан
                Ҳаолай қаумуна иттахасу мин дуниҳи алиҳатан лаула йатуна ааалайҳим бисултанин баййинин фаман асламу миммани ифтара ааала аллааҳи касибан
                Вайси иаатазалтумуҳум вама йааабудуна илла аллааҳа фауу ила алкаҳфи йаншур лакум роббукум мин роҳматиҳи вайуҳаййи лакум мин амрикум мирфақан
                Ватара ашшамса иса талаааат тазауару ааан каҳфиҳим сата алйамийни вайса ғаробат тақридуҳум сата ашшимали ваҳум фий фажватин минҳу салика мин айати аллааҳи ман йаҳди аллааҳу фаҳува алмуҳтади ваман йудлил фалан тажида лаҳу валиййан муршидан
                Ватаҳсабуҳум айқасан ваҳум руқудун вануқаллибуҳум сата алйамийни васата ашшимали вакалбуҳум баситун сираааайҳи биалвасийди лауи итталааата ааалайҳим лауаллайта минҳум фираран валамулита минҳум руаабан
                Вакасалика бааааснаҳум лийатасаалу байнаҳум қала қайлун минҳум кам лабистум қалу лабисна йауман ау бааада йаумин қалу роббукум аааламу бима лабистум файбааасу аҳадакум бивариқикум ҳасиҳи ила алмадийнати фалйансур аййуҳа азка тааааман фалйатикум биризқин минҳу валйаталаттаф вала йушааиранна бикум аҳадан
                Иннаҳум ин йасҳару ааалайкум йаржумукум ау йуааийдукум фий миллатиҳим валан туфлиҳу исан абадан
                Вакасалика ааасарна ааалайҳим лийаааламу анна вааада аллааҳи ҳаққун ваанна алсаааата ла райба фийҳа ис йатаназааауна байнаҳум амроҳум фақалу ибну ааалайҳим бунйанан роббуҳум аааламу биҳим қала аллазийна ғалабу ааала амриҳим ланаттахисанна ааалайҳим масжидан
                Сайақулуна саласатун робиаауҳум калбуҳум вайақулуна хамсатун садисуҳум калбуҳум ражман биалғайби вайақулуна сабааатун васаминуҳум калбуҳум қул роббий аааламу биааиддатиҳим ма йаааламуҳум илла қалийлун фала тумари фийҳим илла мираан саҳиран вала тастафти фийҳим минҳум аҳадан
                Вала тақуланна лишайин инний фааайлун салика ғадан
                Илла ан йашаа аллааҳу ваоскур роббака иса насийта вақул аааса ан йаҳдийани роббий лиақроба мин ҳаса рашадан
                Валабису фий каҳфиҳим саласа миатин синийна вайздаду тисааан
                Қули аллааҳу аааламу бима лабису лаҳу ғайбу ассамауати вааларди абсир биҳи ваасмиаа ма лаҳум мин дуниҳи мин валиййин вала йушрику фий ҳукмиҳи аҳадан
                Ваотлу ма уҳийа илайка мин китаби роббика ла мубаддила ликалиматиҳи валан тажида мин дуниҳи мултаҳадан
                Вайсбир нафсака маааа аллазийна йадаауна роббаҳум биалғадати ваалааашиййи йурийдуна важҳаҳу вала таааду ааайнака ааанҳум турийду зийната алҳайати аддунйа вала тутиаа ман ағфална қалбаҳу ааан сикрина вайттабаааа ҳауаҳу вакана амруҳу фурутан
                Вақули алҳаққу мин роббикум фаман шаа фалйумин ваман шаа фалйакфур инна ааатадна лилссалимийна наран аҳата биҳим сурадиқуҳа вайн йастағийсу йуғасу бимайн каалмуҳли йашвий алвужуҳа биса ашшаробу васаат муртафақан
                Инна аллазийна аману ваааамилу ассалиҳати инна ла нудийаау ажра ман аҳсана ааамалан
                Олайка лаҳум жаннату аааднин тажрий мин таҳтиҳиму аланҳару йуҳаллауна фийҳа мин асауира мин саҳабин вайалбасуна сийабан худран мин сундусин вайстабрақин муттакиийна фийҳа ааала аларайки ниаама ассауабу ваҳасунат муртафақан
                Вайдриб лаҳум масалан ражулайни жаааална лиаҳадиҳима жаннатайни мин ааанабин ваҳафафнаҳума бинахлин важаааална байнаҳума зарааан
                Килта алжаннатайни атат окулаҳа валам таслим минҳу шайан вафажжарна хилалаҳума наҳаран
                Вакана лаҳу самарун фақала лисаҳибиҳи ваҳува йуҳауируҳу ана аксару минка малан ваааааззу нафаран
                Вадахала жаннатаҳу ваҳува салимун линафсиҳи қала ма асунну ан табийда ҳасиҳи абадан
                Вама асунну ассаааата қайматан валайн рудидту ила роббий лаажиданна хайран минҳа мунқалабан
                Қала лаҳу саҳибуҳу ваҳува йуҳауируҳу акафарта биаллазий халақака мин туробин сумма мин нутфатин сумма саувака ражулан
                Лакинна ҳува аллааҳу роббий вала ошрику бироббий аҳадан
                Валаула ис дахалта жаннатака қулта ма шаа аллааҳу ла қуввата илла биаллааҳи ин тарани ана ақалла минка малан вауаладан
                Фааааса роббий ан йутийани хайран мин жаннатика вайурсила ааалайҳа ҳусбанан мина ассамай фатусбиҳа саааийдан залақан
                Ау йусбиҳа маоҳа ғауран фалан тастатийааа лаҳу талабан
                Ваоҳийта бисамариҳи фаасбаҳа йуқаллибу каффайҳи ааала ма анфақа фийҳа ваҳийа хауийатун ааала ааурушиҳа вайақулу йа лайтаний лам ошрик бироббий аҳадан
                Валам такун лаҳу фиатун йансурунаҳу мин дуни аллааҳи вама кана мунтасиран
                Ҳуналика алвалайату лиллаҳи алҳаққи ҳува хайрун сауабан вахайрун аауқбан
                Вайдриб лаҳум масала алҳайати аддунйа камайн анзалнаҳу мина ассамай файхталата биҳи набату аларди фаасбаҳа ҳашийман тасруҳу аррийаҳу вакана аллааҳу ааала кулли шайин муқтадиран
                Алмалу ваалбануна зийнату алҳайати аддунйа ваалбақийату ассалиҳату хайрун ааинда роббика сауабан вахайрун амалан
                Вайаума нусаййиру алжибала ватара аларда баризатан ваҳашарнаҳум фалам нуғадир минҳум аҳадан
                Вааауриду ааала роббика саффан лақад житумуна кама халақнакум аувала марратин бал заааамтум аллан нажааала лакум мауааидан
                Вауудиааа алкитабу фатара алмужримийна мушфиқийна мимма фийҳи вайақулуна йа вайлатана ма лиҳаса алкитаби ла йуғадиру сағийратан вала кабийратан илла аҳсаҳа вауажаду ма ааамилу ҳадиран вала йаслиму роббука аҳадан
                Вайс қулна лилмалайкати осжуду лиадама фасажаду илла иблийса кана мина алжинни фафасақа ааан амри роббиҳи афататтахисунаҳу васурриййатаҳу аулийаа мин дуний ваҳум лакум ааадуввун биса лилссалимийна бадалан
                Ма ашҳадтуҳум халқа ассамауати вааларди вала халқа анфусиҳим вама кунту муттахиса алмудиллийна ааадудан
                Вайаума йақулу наду шуракаййа аллазийна заааамтум фадаааавҳум фалам йастажийбу лаҳум важаааална байнаҳум маубиқан
                Вараа алмужримуна аннара фасанну аннаҳум мувақиаауҳа валам йажиду ааанҳа масрифан
                Валақад саррафна фий ҳаса алқурани лилннаси мин кулли масалин вакана алинсану аксара шайин жадалан
                Вама манаааа аннаса ан йумину ис жааҳуму алҳуда вайастағфиру роббаҳум илла ан татийаҳум суннату алаувалийна ау йатийаҳуму алааасабу қубулан
                Вама нурсилу алмурсалийна илла мубашширийна вамунсирийна вайужадилу аллазийна кафару биалбатили лийузиду биҳи алҳаққа вайттахасу айатий вама онсиру ҳузуван
                Ваман асламу мимман суккира биайати роббиҳи фаааарада ааанҳа ванасийа ма қаддамат йадаҳу инна жаааална ааала қулубиҳим акиннатан ан йафқаҳуҳу вафий асаниҳим вақран вайн тадаауҳум ила алҳуда фалан йаҳтаду исан абадан
                Вароббука алғафуру су арроҳмати лау йуахисуҳум бима касабу лаааажжала лаҳуму алааасаба бал лаҳум мауааидун лан йажиду мин дуниҳи мауилан
                Ватилка алқура аҳлакнаҳум ламма саламу важаааална лимаҳликиҳим мауааидан
                Вайс қала муса лифатаҳу ла аброҳу ҳатта аблуға мажмаааа албаҳрайни ау амдийа ҳуқубан
                Фаламма балаға мажмаааа байниҳима насийа ҳутаҳума файттахаса сабийлаҳу фий албаҳри саробан
                Фаламма жауаза қала лифатаҳу атина ғадаана лақад лақийна мин сафарина ҳаса насабан
                Қала араайта ис ауайна ила ассахрати файнний насийту алҳута вама ансанийҳу илла ашшайтану ан аскуроҳу вайттахаса сабийлаҳу фий албаҳри ааажабан
                Қала салика ма кунна набғи файртадда ааала асариҳима қасасан
                Фауажада ааабдан мин ааибадина атайнаҳу роҳматан мин ааиндина ваааалламнаҳу мин ладунна ааилман
                Қала лаҳу муса ҳал аттабиааука ааала ан туаааллимани мимма аауллимта рушдан
                Қала иннака лан тастатийааа маааййа сабран
                Вакайфа тасбиру ааала ма лам туҳит биҳи хубран
                Қала сатажидуний ин шаа аллааҳу сабиран вала ааасий лака амран
                Қала файни иттабааатаний фала тасалний ааан шайин ҳатта оҳдиса лака минҳу сикран
                Файнталақа ҳатта иса ракиба фий ассафийнати харақаҳа қала ахарақтаҳа литуғриқа аҳлаҳа лақад жита шайан имран
                Қала алам ақул иннака лан тастатийааа маааййа сабран
                Қала ла туахисний бима насийту вала турҳиқний мин амрий ааусран
                Файнталақа ҳатта иса лақийа ғуламан фақаталаҳу қала ақаталта нафсан закиййатан биғайри нафсин лақад жита шайан нукран
                Қала алам ақул лака иннака лан тастатийааа маааййа сабран
                Қала ин саалтука ааан шайин бааадаҳа фала тусаҳибний қад балағта мин ладунний ааусран
                Файнталақа ҳатта иса атайа аҳла қарйатин истатааама аҳлаҳа фаабау ан йудаййифуҳума фауажада фийҳа жидаран йурийду ан йанқадда фаақамаҳу қала лау шита лайттахаста ааалайҳи ажран
                Қала ҳаса фирақу байний вабайника саонаббиока битауийли ма лам тастатиаа ааалайҳи сабран
                Амма ассафийнату факанат лимасакийна йааамалуна фий албаҳри фаарадту ан аааийбаҳа вакана варааҳум маликун йахусу кулла сафийнатин ғасбан
                Ваамма алғуламу факана абауаҳу муминайни фахашийна ан йурҳиқаҳума туғйанан вакуфран
                Фаарадна ан йубдилаҳума роббуҳума хайран минҳу закатан ваақроба руҳман
                Ваамма алжидару факана лиғуламайни йатиймайни фий алмадийнати вакана таҳтаҳу канзун лаҳума вакана абуҳума салиҳан фаарада роббука ан йаблуға ашуддаҳума вайастахрижа канзаҳума роҳматан мин роббика вама фаааалтуҳу ааан амрий салика тауийлу ма лам тастиаа ааалайҳи сабран
                Вайасалунака ааан сий алқарнайни қул саатлу ааалайкум минҳу сикран
                Инна макканна лаҳу фий аларди ваатайнаҳу мин кулли шайин сабабан
                Фаатбаааа сабабан
                Ҳатта иса балаға мағриба ашшамси важадаҳа тағрубу фий ааайнин ҳамиатин вауажада ааиндаҳа қауман қулна йа са алқарнайни имма ан туааассиба ваймма ан таттахиса фийҳим ҳуснан
                Қала амма ман салама фасауфа нуааассибуҳу сумма йурадду ила роббиҳи файуааассибуҳу ааасабан нукран
                Ваамма ман амана ваааамила салиҳан фалаҳу жазаан алҳусна васанақулу лаҳу мин амрина йусран
                Сумма атбаааа сабабан
                Ҳатта иса балаға матлиааа ашшамси важадаҳа татлуаау ааала қаумин лам нажааал лаҳум мин дуниҳа ситран
                Касалика вақад аҳатна бима ладайҳи хубран
                Сумма атбаааа сабабан
                Ҳатта иса балаға байна ассаддайни важада мин дуниҳима қауман ла йакадуна йафқаҳуна қаулан
                Қалу йа са алқарнайни инна йажужа вамажужа муфсидуна фий аларди фаҳал нажааалу лака харжан ааала ан тажааала байнана вабайнаҳум саддан
                Қала ма макканний фийҳи роббий хайрун фааааийнуний биқувватин ажааал байнакум вабайнаҳум радман
                Атуний зубара алҳадийди ҳатта иса сауа байна алсадафайни қала онфуху ҳатта иса жаааалаҳу наран қала атуний офриғ ааалайҳи қитран
                Фама истааау ан йасҳаруҳу вама истатааау лаҳу нақбан
                Қала ҳаса роҳматун мин роббий файса жаа ваааду роббий жаааалаҳу даккаа вакана ваааду роббий ҳаққан
                Ватаракна бааадаҳум йаумайсин йамужу фий бааадин вануфиха фий ассури фажамааанаҳум жамааан
                Ваааарадна жаҳаннама йаумайсин лилкафирийна ааардан
                Аллазийна канат ааайунуҳум фий ғитайн ааан сикрий вакану ла йастатийаауна самааан
                Афаҳасиба аллазийна кафару ан йаттахису ааибадий мин дуний аулийаа инна ааатадна жаҳаннама лилкафирийна нузулан
                Қул ҳал нунаббиокум биалахсарийна ааамалан
                Аллазийна далла сааайуҳум фий алҳайати аддунйа ваҳум йаҳсабуна аннаҳум йуҳсинуна сунааан
                Олайка аллазийна кафару биайати роббиҳим валиқайҳи фаҳабитат ааамалуҳум фала нуқийму лаҳум йаума алқийамати вазнан
                Салика жазаоҳум жаҳаннаму бима кафару вайттахасу айатий варусулий ҳузуван
                Инна аллазийна аману ваааамилу ассалиҳати канат лаҳум жаннату алфирдауси нузулан
                Халидийна фийҳа ла йабғуна ааанҳа ҳивалан
                Қул лау кана албаҳру мидадан ликалимати роббий ланафида албаҳру қабла ан танфада калимату роббий валау жина бимислиҳи мададан
                Қул иннама ана башарун мислукум йуҳа илаййа аннама илаҳукум илаҳун ваҳидун фаман кана йаржу лиқаа роббиҳи фалйааамал ааамалан салиҳан вала йушрик биааибадати роббиҳи аҳадан
            """.trimIndent(),
        ),
        Surah(
            id = 19,
            arabicName = "مريم",
            latinName = "Maryam",
            transliteration = """
                Кафҳайаааайнсад
                Сикру роҳмати роббика ааабдаҳу закариййа
                Ис нада роббаҳу нидаан хафиййан
                Қала робби инний ваҳана алааасму минний вайштаааала аррасу шайбан валам акун бидуааайка робби шақиййан
                Вайнний хифту алмауалийа мин вараий ваканати имраатий ааақиран фаҳаб лий мин ладунка валиййан
                Йарисуний вайарису мин али йааақуба вайжааалҳу робби радиййан
                Йа закариййа инна нубашширука биғуламин исмуҳу йаҳйа лам нажааал лаҳу мин қаблу самиййан
                Қала робби анна йакуну лий ғуламун ваканати имраатий ааақиран вақад балағту мина алкибари ааитиййан
                Қала касалика қала роббука ҳува ааалаййа ҳаййинун вақад халақтука мин қаблу валам таку шайан
                Қала робби ижааал лий айатан қала айатука алла тукаллима аннаса саласа лайалин сауиййан
                Фахаража ааала қаумиҳи мина алмиҳроби фаавҳа илайҳим ан саббиҳу букратан ваааашиййан
                Йа йаҳйа хуси алкитаба биқувватин ваатайнаҳу алҳукма сабиййан
                Ваҳананан мин ладунна вазакатан вакана тақиййан
                Вабарран бивалидайҳи валам йакун жаббаран ааасиййан
                Васаламун ааалайҳи йаума вулида вайаума йамуту вайаума йубааасу ҳаййан
                Ваоскур фий алкитаби марйама иси интабасат мин аҳлиҳа маканан шарқиййан
                Файттахасат мин дуниҳим ҳижабан фаарсална илайҳа руҳана фатамассала лаҳа башаран сауиййан
                Қалат инний аааусу биалрроҳмани минка ин кунта тақиййан
                Қала иннама ана расулу роббики лиаҳаба лаки ғуламан закиййан
                Қалат анна йакуну лий ғуламун валам йамсасний башарун валам аку бағиййан
                Қала касалики қала роббуки ҳува ааалаййа ҳаййинун валинажааалаҳу айатан лилннаси вароҳматан минна вакана амран мақдиййан
                Фаҳамаласу файнтабасат биҳи маканан қасиййан
                Фаажааҳа алмахаду ила жисааи аннахлати қалат йа лайтаний митту қабла ҳаса вакунту насйан мансиййан
                Фанадаҳа мин таҳтиҳа алла таҳзаний қад жаааала роббуки таҳтаки сариййан
                Ваҳуззий илайки бижисааи аннахлати тусақит ааалайки рутабан жаниййан
                Факулий вайшробий вақаррий ааайнан файмма тарайинна мина албашари аҳадан фақулий инний насарту лилрроҳмани сауман фалан окаллима алйаума инсиййан
                Фаатат биҳи қаумаҳа таҳмилуҳу қалу йа марйаму лақад жити шайан фариййан
                Йа охта ҳаруна ма кана абуки имраа сауин вама канат оммуки бағиййан
                Фаашарат илайҳи қалу кайфа нукаллиму ман кана фий алмаҳди сабиййан
                Қала инний ааабду аллааҳи атанийа алкитаба важааааланий набиййан
                Важааааланий мубаракан айна ма кунту ваавсаний биалссалати ваалззакати ма думту ҳаййан
                Вабарран бивалидатий валам йажааалний жаббаран шақиййан
                Ваалссаламу ааалаййа йаума вулидту вайаума амуту вайаума обааасу ҳаййан
                Салика ааийса ибну марйама қаула алҳаққи аллазий фийҳи йамтаруна
                Ма кана лиллаҳи ан йаттахиса мин валадин субҳанаҳу иса қада амран файннама йақулу лаҳу кун файакуну
                Вайнна аллааҳа роббий вароббукум фаоаабудуҳу ҳаса сиратун мустақиймун
                Файхталафа алаҳзабу мин байниҳим фауайлун лиллазийна кафару мин машҳади йаумин ааасиймин
                Асмиаа биҳим ваабсир йаума йатунана лакини ассалимуна алйаума фий далалин мубийнин
                Ваансирҳум йаума алҳасрати ис қудийа аламру ваҳум фий ғафлатин ваҳум ла йуминуна
                Инна наҳну нарису аларда ваман ааалайҳа вайлайна йуржааауна
                Ваоскур фий алкитаби иброҳийма иннаҳу кана сиддийқан набиййан
                Ис қала лиабийҳи йа абати лима тааабуду ма ла йасмааау вала йубсиру вала йуғний ааанка шайан
                Йа абати инний қад жааний мина алааилми ма лам йатика файттабиааний аҳдика сиратан сауиййан
                Йа абати ла тааабуди ашшайтана инна ашшайтана кана лилрроҳмани ааасиййан
                Йа абати инний ахафу ан йамассака ааасабун мина арроҳмани фатакуна лилшшйатани валиййан
                Қала арағибун анта ааан алиҳатий йа иброҳийму лайн лам тантаҳи лааржуманнака ваоҳжурний малиййан
                Қала саламун ааалайка саастағфиру лака роббий иннаҳу кана бий ҳафиййан
                Ваааатазилукум вама тадаауна мин дуни аллааҳи ваадаау роббий аааса алла акуна бидуааай роббий шақиййан
                Фаламма иаатазалаҳум вама йааабудуна мин дуни аллааҳи ваҳабна лаҳу ишақа вайааақуба вакуллан жаааална набиййан
                Вауаҳабна лаҳум мин роҳматина важаааална лаҳум лисана сидқин ааалиййан
                Ваоскур фий алкитаби муса иннаҳу кана мухласан вакана расулан набиййан
                Ванадайнаҳу мин жаниби аттури алаймани вақарробнаҳу нажиййан
                Вауаҳабна лаҳу мин роҳматина ахаҳу ҳаруна набиййан
                Ваоскур фий алкитаби исмаааийла иннаҳу кана садиқа алвааади вакана расулан набиййан
                Вакана йамуру аҳлаҳу биалссалати ваалззакати вакана ааинда роббиҳи мардиййан
                Ваоскур фий алкитаби идрийса иннаҳу кана сиддийқан набиййан
                Варафааанаҳу маканан ааалиййан
                Олайка аллазийна анааама аллааҳу ааалайҳим мина аннабиййийна мин сурриййати адама вамимман ҳамална маааа нуҳин вамин сурриййати иброҳийма вайсраийла вамимман ҳадайна вайжтабайна иса тутла ааалайҳим айату арроҳмани харру сужжадан вабукиййан
                Фахалафа мин бааадиҳим халфун адааау ассалата вайттабааау ашшаҳауати фасауфа йалқауна ғаййан
                Илла ман таба ваамана ваааамила салиҳан фаолайка йадхулуна алжанната вала йусламуна шайан
                Жаннати аааднин аллатий ваааада арроҳману ааибадаҳу биалғайби иннаҳу кана вааадуҳу матиййан
                Ла йасмааауна фийҳа лағван илла саламан валаҳум ризқуҳум фийҳа букратан ваааашиййан
                Тилка алжаннату аллатий нурису мин ааибадина ман кана тақиййан
                Вама натаназзалу илла биамри роббика лаҳу ма байна айдийна вама халфана вама байна салика вама кана роббука насиййан
                Роббу ассамауати вааларди вама байнаҳума фаоаабузу вайстабир лиааибадатиҳи ҳал таааламу лаҳу самиййан
                Вайақулу алинсану айса ма митту ласауфа охражу ҳаййан
                Ауала йаскуру алинсану анна халақнаҳу мин қаблу валам йаку шайан
                Фауароббика ланаҳшураннаҳум ваалшшайатийна сумма лануҳдираннаҳум ҳаула жаҳаннама жисиййан
                Сумма лананзиааанна мин кулли шийааатин аййуҳум ашадду ааала арроҳмани ааитиййан
                Сумма ланаҳну аааламу биаллазийна ҳум аула биҳа силиййан
                Вайн минкум илла варидуҳа кана ааала роббика ҳатман мақдиййан
                Сумма нунажжий аллазийна иттақау ванасару ассалимийна фийҳа жисиййан
                Вайса тутла ааалайҳим айатуна баййинатин қала аллазийна кафару лиллазийна аману аййу алфарийқайни хайрун мақаман вааҳсану надиййан
                Вакам аҳлакна қаблаҳум мин қарнин ҳум аҳсану асасан варийан
                Қул ман кана фий аддалалати фалйамдуд лаҳу арроҳману маддан ҳатта иса раав ма йуааадуна имма алааасаба ваймма ассаааата фасайаааламуна ман ҳува шаррун маканан ваадааафу жундан
                Вайазийду аллааҳу аллазийна иҳтадау ҳудан ваалбақийату ассалиҳату хайрун ааинда роббика сауабан вахайрун мараддан
                Афараайта аллазий кафара биайатина вақала лаутайанна малан вауаладан
                Атталаааа алғайба ами иттахаса ааинда арроҳмани аааҳдан
                Калла санактубу ма йақулу ванамудду лаҳу мина алааасаби маддан
                Ванарисуҳу ма йақулу вайатийна фардан
                Вайттахасу мин дуни аллааҳи алиҳатан лийакуну лаҳум ааиззан
                Калла сайакфуруна биааибадатиҳим вайакунуна ааалайҳим диддан
                Алам тара анна арсална ашшайатийна ааала алкафирийна таоззуҳум аззан
                Фала тааажал ааалайҳим иннама наааудду лаҳум аааддан
                Йаума наҳшуру алмуттақийна ила арроҳмани вафдан
                Ванасуқу алмужримийна ила жаҳаннама вирдан
                Ла йамликуна ашшафаааата илла мани иттахаса ааинда арроҳмани аааҳдан
                Вақалу иттахаса арроҳману валадан
                Лақад житум шайан иддан
                Такаду ассамауату йатафаттарна минҳу ватаншаққу аларду ватахирру алжибалу ҳаддан
                Ан даааав лилрроҳмани валадан
                Вама йанбағий лилрроҳмани ан йаттахиса валадан
                Ин куллу ман фий ассамауати вааларди илла атий арроҳмани ааабдан
                Лақад аҳсаҳум вааааддаҳум аааддан
                Вакуллуҳум атийҳи йаума алқийамати фардан
                Инна аллазийна аману ваааамилу ассалиҳати сайажааалу лаҳуму арроҳману вуддан
                Файннама йассарнаҳу билисаника литубашшира биҳи алмуттақийна ватунсира биҳи қауман луддан
                Вакам аҳлакна қаблаҳум мин қарнин ҳал туҳиссу минҳум мин аҳадин ау тасмааау лаҳум рикзан
            """.trimIndent(),
        ),
        Surah(
            id = 20,
            arabicName = "طه",
            latinName = "Taha",
            transliteration = """
                Таҳа
                Ма анзална ааалайка алқурана литашқа
                Илла таскиратан лиман йахша
                Танзийлан мимман халақа аларда ваалссамауати алааула
                Арроҳману ааала алааарши истауа
                Лаҳу ма фий ассамауати вама фий аларди вама байнаҳума вама таҳта ассара
                Вайн тажҳар биалқаули файннаҳу йаааламу ассирра ваахфа
                Аллааҳу ла илаҳа илла ҳува лаҳу аласмао алҳусна
                Ваҳал атака ҳадийсу муса
                Ис раа наран фақала лиаҳлиҳи омкусу инний анасту наран лааааллий атийкум минҳа биқабасин ау ажиду ааала аннари ҳудан
                Фаламма атаҳа нудийа йа муса
                Инний ана роббука файхлааа нааалайка иннака биалвади алмуқаддаси туван
                Ваана ихтартука файстамиаа лима йуҳа
                Иннаний ана аллааҳу ла илаҳа илла ана фаоаабудний ваақими ассалата лисикрий
                Инна ассаааата атийатун акаду охфийҳа литужза куллу нафсин бима тасааа
                Фала йасудданнака ааанҳа ман ла йумину биҳа вайттабаааа ҳауаҳу фатарда
                Вама тилка бийамийника йа муса
                Қала ҳийа ааасайа атауаккао ааалайҳа вааҳушшу биҳа ааала ғанамий валийа фийҳа маарибу охра
                Қала алқиҳа йа муса
                Фаалқаҳа файса ҳийа ҳаййатун тасааа
                Қала хусҳа вала тахаф сануааийдуҳа сийратаҳа алула
                Ваодмум йадака ила жанаҳика тахруж байдаа мин ғайри суин айатан охра
                Линурийака мин айатина алкубра
                Исҳаб ила фирааауна иннаҳу таға
                Қала робби ишроҳ лий садрий
                Вайассир лий амрий
                Ваоҳлул аауқдатан мин лисаний
                Йафқаҳу қаулий
                Вайжааал лий вазийран мин аҳлий
                Ҳаруна ахий
                Ошдуд биҳи азрий
                Ваашриху фий амрий
                Кай нусаббиҳака касийран
                Ванаскурака касийран
                Иннака кунта бина басийран
                Қала қад утийта сулака йа муса
                Валақад мананна ааалайка марратан охра
                Ис ауҳайна ила оммика ма йуҳа
                Ани иқсифийҳи фий аттабути файқсифийҳи фий алйамми фалйулқиҳи алйамму биалссаҳили йахусҳу ааадуввун лий ваааадуввун лаҳу ваалқайту ааалайка маҳаббатан минний валитуснаааа ааала ааайний
                Ис тамший охтука фатақулу ҳал адуллукум ааала ман йакфулуҳу фаражааанака ила оммика кай тақарра ааайнуҳа вала таҳзана вақаталта нафсан фанажжайнака мина алғамми вафатаннака футунан фалабиста синийна фий аҳли мадйана сумма жита ааала қадарин йа муса
                Вайстанааатука линафсий
                Исҳаб анта ваахука биайатий вала танийа фий сикрий
                Исҳаба ила фирааауна иннаҳу таға
                Фақула лаҳу қаулан лаййинан лааааллааҳу йатасаккару ау йахша
                Қала роббана иннана нахафу ан йафрута ааалайна ау ан йатға
                Қала ла тахафа иннаний маааакума асмааау ваара
                Фатийаҳу фақула инна расула роббика фаарсил маааана баний исраийла вала туааассибҳум қад жинака биайатин мин роббика ваалссаламу ааала мани иттабаааа алҳуда
                Инна қад уҳийа илайна анна алааасаба ааала ман кассаба ватауалла
                Қала фаман роббукума йа муса
                Қала роббуна аллазий ааата кулла шайин халқаҳу сумма ҳада
                Қала фама балу алқуруни алула
                Қала ааилмуҳа ааинда роббий фий китабин ла йадиллу роббий вала йанса
                Аллазий жаааала лакуму аларда маҳдан васалака лакум фийҳа субулан ваанзала мина ассамай маан фаахражна биҳи азважан мин набатин шатта
                Кулу вайрааау анааамакум инна фий салика лаайатин лиолий аннуҳа
                Минҳа халақнакум вафийҳа нуааийдукум ваминҳа нухрижукум таратан охра
                Валақад арайнаҳу айатина куллаҳа факассаба вааба
                Қала ажитана литухрижана мин ардина бисиҳрика йа муса
                Фаланатийаннака бисиҳрин мислиҳи файжааал байнана вабайнака мауааидан ла нухлифуҳу наҳну вала анта маканан суван
                Қала мауааидукум йауму аззийнати ваан йуҳшара аннасу дуҳан
                Фатауалла фирааауну фажамаааа кайдаҳу сумма ата
                Қала лаҳум муса вайлакум ла тафтару ааала аллааҳи касибан файушитакум биааасабин вақад хаба мани ифтара
                Фатаназааау амроҳум байнаҳум ваасарру аннажва
                Қалу ин ҳасани ласаҳирани йурийдани ан йухрижакум мин ардикум бисиҳриҳима вайасҳаба битарийқатикуму алмусла
                Фаажмиаау кайдакум сумма иту саффан вақад афлаҳа алйаума мани истааала
                Қалу йа муса имма ан тулқийа ваймма ан накуна аувала ман алқа
                Қала бал алқу файса ҳибалуҳум вааайсиййуҳум йухаййалу илайҳи мин сиҳриҳим аннаҳа тасааа
                Фаавжаса фий нафсиҳи хийфатан муса
                Қулна ла тахаф иннака анта алааала
                Ваалқи ма фий йамийника талқаф ма санааау иннама санааау кайду саҳирин вала йуфлиҳу ассаҳиру ҳайсу ата
                Фаолқийа ассаҳарату сужжадан қалу аманна биробби ҳаруна вамуса
                Қала амантум лаҳу қабла ан асана лакум иннаҳу лакабийрукуму аллазий ааалламакуму ассиҳра фалаоқаттиааанна айдийакум вааржулакум мин хилафин валаосаллибаннакум фий жусуааи аннахли валатаааламунна аййуна ашадду ааасабан ваабқа
                Қалу лан нусирака ааала ма жаана мина албаййинати вааллазий фатарана файқди ма анта қадин иннама тақдий ҳасиҳи алҳайата аддунйа
                Инна аманна бироббина лийағфира лана хатайана вама акроҳтана ааалайҳи мина ассиҳри вааллааҳу хайрун ваабқа
                Иннаҳу ман йати роббаҳу мужриман файнна лаҳу жаҳаннама ла йамуту фийҳа вала йаҳйа
                Ваман йатиҳи муминан қад ааамила ассалиҳати фаолайка лаҳуму аддаражату алааула
                Жаннату аааднин тажрий мин таҳтиҳа аланҳару халидийна фийҳа васалика жазао ман тазакка
                Валақад ауҳайна ила муса ан асри биааибадий файдриб лаҳум тарийқан фий албаҳри йабасан ла тахафу даракан вала тахша
                Фаатбааааҳум фирааауну бижунудиҳи фағашийаҳум мина алйамми ма ғашийаҳум
                Ваадалла фирааауну қаумаҳу вама ҳада
                Йа баний исраийла қад анжайнакум мин ааадуввикум вауааааднакум жаниба аттури алаймана ваназзална ааалайкуму алманна ваалссалва
                Кулу мин таййибати ма разақнакум вала татғау фийҳи файаҳилла ааалайкум ғадабий ваман йаҳлил ааалайҳи ғадабий фақад ҳауа
                Вайнний лағаффарун лиман таба ваамана ваааамила салиҳан сумма иҳтада
                Вама ааажалака ааан қаумика йа муса
                Қала ҳум олай ааала асарий ваааажилту илайка робби литарда
                Қала файнна қад фатанна қаумака мин бааадика ваадаллааҳуму ассамириййу
                Фаражаааа муса ила қаумиҳи ғадбана асифан қала йа қауми алам йааайдкум роббукум вааадан ҳасанан афатала ааалайкуму алаааҳду ам арадтум ан йаҳилла ааалайкум ғадабун мин роббикум фаахлафтум мауааидий
                Қалу ма ахлафна мауааидака бималкина валакинна ҳуммилна аузаран мин зийнати алқауми фақасафнаҳа факасалика алқа ассамириййу
                Фаахража лаҳум ааижлан жасадан лаҳу хуварун фақалу ҳаса илаҳукум вайлаҳу муса фанасийа
                Афала йарауна алла йаржиаау илайҳим қаулан вала йамлику лаҳум дарран вала нафааан
                Валақад қала лаҳум ҳаруну мин қаблу йа қауми иннама футинтум биҳи вайнна роббакуму арроҳману файттабиаауний ваатийаау амрий
                Қалу лан наброҳа ааалайҳи ааакифийна ҳатта йаржиааа илайна муса
                Қала йа ҳаруну ма манаааака ис раайтаҳум даллу
                Алла таттабиааани афаааасайта амрий
                Қала йа бна омма ла тахус билиҳйатий вала бирасий инний хашийту ан тақула фаррақта байна баний исраийла валам тарқуб қаулий
                Қала фама хатбука йа самириййу
                Қала басурту бима лам йабсуру биҳи фақабадту қабдатан мин асари аррасули фанабастуҳа вакасалика саувалат лий нафсий
                Қала файсҳаб файнна лака фий алҳайати ан тақула ла мисаса вайнна лака мауааидан лан тухлафаҳу ваонсур ила илаҳика аллазий салта ааалайҳи ааакифан лануҳарриқаннаҳу сумма ланансифаннаҳу фий алйамми насфан
                Иннама илаҳукуму аллааҳу аллазий ла илаҳа илла ҳува васиааа кулла шайин ааилман
                Касалика нақуссу ааалайка мин анбай ма қад сабақа вақад атайнака мин ладунна сикран
                Ман ааарада ааанҳу файннаҳу йаҳмилу йаума алқийамати визран
                Халидийна фийҳи васаа лаҳум йаума алқийамати ҳимлан
                Йаума йунфаху фий ассури ванаҳшуру алмужримийна йаумайсин зурқан
                Йатахафатуна байнаҳум ин лабистум илла ааашран
                Наҳну аааламу бима йақулуна ис йақулу амсалуҳум тарийқатан ин лабистум илла йауман
                Вайасалунака ааани алжибали фақул йансифуҳа роббий насфан
                Файасаруҳа қаааан сафсафан
                Ла тара фийҳа ааиважан вала амтан
                Йаумайсин йаттабиаауна аддаааййа ла ааиважа лаҳу вахашаааати аласвату лилрроҳмани фала тасмааау илла ҳамсан
                Йаумайсин ла танфааау ашшафаааату илла ман асина лаҳу арроҳману варадийа лаҳу қаулан
                Йаааламу ма байна айдийҳим вама халфаҳум вала йуҳийтуна биҳи ааилман
                Ваааанати алвужуҳу лилҳаййи алқаййуми вақад хаба ман ҳамала сулман
                Ваман йааамал мина ассалиҳати ваҳува муминун фала йахафу сулман вала ҳадман
                Вакасалика анзалнаҳу қуранан аааробиййан васаррафна фийҳи мина алваааийди лааааллааҳум йаттақуна ау йуҳдису лаҳум сикран
                Фатаааала аллааҳу алмалику алҳаққу вала тааажал биалқурани мин қабли ан йуқда илайка ваҳйуҳу вақул робби зидний ааилман
                Валақад аааҳидна ила адама мин қаблу фанасийа валам нажид лаҳу ааазман
                Вайс қулна лилмалайкати осжуду лиадама фасажаду илла иблийса аба
                Фақулна йа адаму инна ҳаса ааадуввун лака вализаужика фала йухрижаннакума мина алжаннати фаташқа
                Инна лака алла тажуааа фийҳа вала тааара
                Вааннака ла тасмао фийҳа вала таза
                Фауасваса илайҳи ашшайтану қала йа адаму ҳал адуллука ааала шажарати алхулди вамулкин ла йабла
                Фаакала минҳа фабадат лаҳума сауатуҳума ватафиқа йахсифани ааалайҳима мин варақи алжаннати вааааса адаму роббаҳу фағауа
                Сумма ижтабаҳу роббуҳу фатаба ааалайҳи ваҳада
                Қала иҳбита минҳа жамийааан бааадукум либааадин ааадуввун файмма йатийаннакум минний ҳудан фамани иттабаааа ҳудайа фала йадиллу вала йашқа
                Ваман ааарада ааан сикрий файнна лаҳу маааийшатан данкан ванаҳшуруҳу йаума алқийамати аааман
                Қала робби лима ҳашартаний ааама вақад кунту басийран
                Қала касалика ататка айатуна фанасийтаҳа вакасалика алйаума тунса
                Вакасалика нажзий ман асрафа валам йумин биайати роббиҳи валаааасабу алахирати ашадду ваабқа
                Афалам йаҳди лаҳум кам аҳлакна қаблаҳум мина алқуруни йамшуна фий масакиниҳим инна фий салика лаайатин лиолий аннуҳа
                Валаула калиматун сабақат мин роббика лакана лизаман ваажалун мусамман
                Файсбир ааала ма йақулуна васаббиҳ биҳамди роббика қабла тулуааи ашшамси вақабла ғурубиҳа вамин анай аллайли фасаббиҳ ваатрафа аннаҳари лааааллака тарда
                Вала тамудданна ааайнайка ила ма маттааана биҳи азважан минҳум заҳрата алҳайати аддунйа линафтинаҳум фийҳи варизқу роббика хайрун ваабқа
                Вамур аҳлака биалссалати вайстабир ааалайҳа ла насалука ризқан наҳну нарзуқука ваалааақибату лилттақва
                Вақалу лаула йатийна биайатин мин роббиҳи ауалам татиҳим баййинату ма фий ассуҳуфи алула
                Валау анна аҳлакнаҳум биааасабин мин қаблиҳи лақалу роббана лаула арсалта илайна расулан фанаттабиааа айатика мин қабли ан насилла ванахза
                Қул куллун мутароббисун фатароббасу фасатаааламуна ман ашабу ассирати ассауиййи вамани иҳтада
            """.trimIndent(),
        ),
        Surah(
            id = 21,
            arabicName = "الأنبياء",
            latinName = "Al-Anbya",
            transliteration = """
                Иқтароба лилннаси ҳисабуҳум ваҳум фий ғафлатин муааридуна
                Ма йатийҳим мин сикрин мин роббиҳим муҳдасин илла истамааауҳу ваҳум йалааабуна
                Лаҳийатан қулубуҳум ваасарру аннажва аллазийна саламу ҳал ҳаса илла башарун мислукум афататуна ассиҳра ваантум тубсируна
                Қала роббий йаааламу алқаула фий ассамай вааларди ваҳува ассамийаау алааалийму
                Бал қалу адғасу аҳламин бали ифтароҳу бал ҳува шааайрун фалйатина биайатин кама орсила алаувалуна
                Ма аманат қаблаҳум мин қарйатин аҳлакнаҳа афаҳум йуминуна
                Вама арсална қаблака илла рижалан нуҳий илайҳим файсалу аҳла ассикри ин кунтум ла таааламуна
                Вама жаааалнаҳум жасадан ла йакулуна аттаааама вама кану халидийна
                Сумма садақнаҳуму алвааада фаанжайнаҳум ваман нашао вааҳлакна алмусрифийна
                Лақад анзална илайкум китабан фийҳи сикрукум афала тааақилуна
                Вакам қасамна мин қарйатин канат салиматан вааншана бааадаҳа қауман ахарийна
                Фаламма аҳассу басана иса ҳум минҳа йаркудуна
                Ла таркуду вайржиаау ила ма отрифтум фийҳи вамасакиникум лааааллакум тусалуна
                Қалу йа вайлана инна кунна салимийна
                Фама залат тилка дааауаҳум ҳатта жаааалнаҳум ҳасийдан хамидийна
                Вама халақна ассамаа вааларда вама байнаҳума лааайбийна
                Лау арадна ан наттахиса лаҳван лайттахаснаҳу мин ладунна ин кунна фааайлийна
                Бал нақсифу биалҳаққи ааала албатили файадмағуҳу файса ҳува заҳиқун валакуму алвайлу мимма тасифуна
                Валаҳу ман фий ассамауати вааларди ваман ааиндаҳу ла йастакбируна ааан ааибадатиҳи вала йастаҳсируна
                Йусаббиҳуна аллайла ваалннаҳара ла йафтуруна
                Ами иттахасу алиҳатан мина аларди ҳум йуншируна
                Лау кана фийҳима алиҳатун илла аллааҳу лафасадата фасубҳана аллааҳи робби алааарши ааамма йасифуна
                Ла йусалу ааамма йафааалу ваҳум йусалуна
                Ами иттахасу мин дуниҳи алиҳатан қул ҳату бурҳанакум ҳаса сикру ман маааййа васикру ман қаблий бал аксаруҳум ла йаааламуна алҳаққа фаҳум муааридуна
                Вама арсална мин қаблика мин расулин илла нуҳий илайҳи аннаҳу ла илаҳа илла ана фаоаабудуни
                Вақалу иттахаса арроҳману валадан субҳанаҳу бал ааибадун мукрамуна
                Ла йасбиқунаҳу биалқаули ваҳум биамриҳи йааамалуна
                Йаааламу ма байна айдийҳим вама халфаҳум вала йашфааауна илла лимани иртада ваҳум мин хашйатиҳи мушфиқуна
                Ваман йақул минҳум инний илаҳун мин дуниҳи фасалика нажзийҳи жаҳаннама касалика нажзий ассалимийна
                Ауалам йара аллазийна кафару анна ассамауати вааларда каната ратқан фафатақнаҳума важаааална мина алмай кулла шайин ҳаййин афала йуминуна
                Важаааална фий аларди рауасийа ан тамийда биҳим важаааална фийҳа фижажан субулан лааааллааҳум йаҳтадуна
                Важаааална ассамаа сақфан маҳфусан ваҳум ааан айатиҳа муааридуна
                Ваҳува аллазий халақа аллайла ваалннаҳара ваалшшамса ваалқамара куллун фий фалакин йасбаҳуна
                Вама жаааална либашарин мин қаблика алхулда афайн митта фаҳуму алхалидуна
                Куллу нафсин сайқату алмаути ванаблукум биалшшарри ваалхайри фитнатан вайлайна туржааауна
                Вайса раака аллазийна кафару ин йаттахисунака илла ҳузуван аҳаса аллазий йаскуру алиҳатакум ваҳум бисикри арроҳмани ҳум кафируна
                Хулиқа алинсану мин ааажалин саорийкум айатий фала тастааажилуна
                Вайақулуна мата ҳаса алваааду ин кунтум садиқийна
                Лау йаааламу аллазийна кафару ҳийна ла йакуффуна ааан вужуҳиҳиму аннара вала ааан суҳуриҳим вала ҳум йунсаруна
                Бал татийҳим бағтатан фатабҳатуҳум фала йастатийаауна раддаҳа вала ҳум йунсаруна
                Валақади истуҳзиа бирусулин мин қаблика фаҳақа биаллазийна сахиру минҳум ма кану биҳи йастаҳзиуна
                Қул ман йаклаокум биаллайли ваалннаҳари мина арроҳмани бал ҳум ааан сикри роббиҳим муааридуна
                Ам лаҳум алиҳатун тамнааауҳум мин дунина ла йастатийаауна насра анфусиҳим вала ҳум минна йушабуна
                Бал маттааана ҳаолай ваабааҳум ҳатта тала ааалайҳиму алааумуру афала йарауна анна натий аларда нанқусуҳа мин атрафиҳа афаҳуму алғалибуна
                Қул иннама онсирукум биалваҳйи вала йасмааау ассумму аддуаааа иса ма йунсаруна
                Валайн массасум нафҳатун мин ааасаби роббика лайақулунна йа вайлана инна кунна салимийна
                Ванадааау алмауазийна алқиста лийауми алқийамати фала тусламу нафсун шайан вайн кана мисқала ҳаббатин мин хардалин атайна биҳа вакафа бина ҳасибийна
                Валақад атайна муса ваҳаруна алфурқана вадийаан васикран лилмуттақийна
                Аллазийна йахшауна роббаҳум биалғайби ваҳум мина ассаааати мушфиқуна
                Ваҳаса сикрун мубаракун анзалнаҳу афаантум лаҳу мункируна
                Валақад атайна иброҳийма рушдаҳу мин қаблу вакунна биҳи ааалимийна
                Ис қала лиабийҳи вақаумиҳи ма ҳасиҳи аттамасийлу аллатий антум лаҳа ааакифуна
                Қалу важадна абаана лаҳа ааабидийна
                Қала лақад кунтум антум ваабаокум фий далалин мубийнин
                Қалу ажитана биалҳаққи ам анта мина аллааайбийна
                Қала бал роббукум роббу ассамауати вааларди аллазий фатароҳунна ваана ааала саликум мина ашшаҳидийна
                Ватааллааҳи лаакийданна аснамакум бааада ан туваллу мудбирийна
                Фажаааалаҳум жусасан илла кабийран лаҳум лааааллааҳум илайҳи йаржиаауна
                Қалу ман фаааала ҳаса биалиҳатина иннаҳу ламина ассалимийна
                Қалу самиаана фатан йаскуруҳум йуқалу лаҳу иброҳийму
                Қалу фату биҳи ааала ааайуни аннаси лааааллааҳум йашҳадуна
                Қалу аанта фаааалта ҳаса биалиҳатина йа иброҳийму
                Қала бал фаааалаҳу кабийруҳум ҳаса файсалуҳум ин кану йантиқуна
                Фаражааау ила анфусиҳим фақалу иннакум антуму ассалимуна
                Сумма нукису ааала руусиҳим лақад ааалимта ма ҳаолай йантиқуна
                Қала афатааабудуна мин дуни аллааҳи ма ла йанфаааукум шайан вала йадуррукум
                Оффин лакум валима тааабудуна мин дуни аллааҳи афала тааақилуна
                Қалу ҳарриқуҳу ваонсуру алиҳатакум ин кунтум фааайлийна
                Қулна йа нару куний бардан васаламан ааала иброҳийма
                Ваараду биҳи кайдан фажаааалнаҳуму алахсарийна
                Ванажжайнаҳу валутан ила аларди аллатий баракна фийҳа лилаааламийна
                Вауаҳабна лаҳу ишақа вайааақуба нафилатан вакуллан жаааална салиҳийна
                Важаааалнаҳум аймматан йаҳдуна биамрина ваавҳайна илайҳим фиаала алхайрати вайқама ассалати ваийтаа аззакати вакану лана ааабидийна
                Валутан атайнаҳу ҳукман вааайлман ванажжайнаҳу мина алқарйати аллатий канат тааамалу алхабайса иннаҳум кану қаума сауин фасиқийна
                Ваадхалнаҳу фий роҳматина иннаҳу мина ассалиҳийна
                Вануҳан ис нада мин қаблу файстажабна лаҳу фанажжайнаҳу вааҳлаҳу мина алкарби алааасийми
                Ванасарнаҳу мина алқауми аллазийна кассабу биайатина иннаҳум кану қаума сауин фаағрақнаҳум ажмаааийна
                Вадаууда васулаймана ис йаҳкумани фий алҳарси ис нафашат фийҳи ғанаму алқауми вакунна лиҳукмиҳим шаҳидийна
                Фафаҳҳамнаҳа сулаймана вакуллан атайна ҳукман вааайлман васаххарна маааа даууда алжибала йусаббиҳна ваалттайра вакунна фааайлийна
                Ваааалламнаҳу санааата лабусин лакум литуҳсинакум мин басикум фаҳал антум шакируна
                Валисулаймана аррийҳа ааасифатан тажрий биамриҳи ила аларди аллатий баракна фийҳа вакунна бикулли шайин ааалимийна
                Вамина ашшайатийни ман йағусуна лаҳу вайааамалуна ааамалан дуна салика вакунна лаҳум ҳафисийна
                Вааййуба ис нада роббаҳу анний массанийа аддурру ваанта арҳаму арроҳимийна
                Файстажабна лаҳу факашафна ма биҳи мин дуррин ваатайнаҳу аҳлаҳу вамислаҳум мааааҳум роҳматан мин ааиндина васикра лилааабидийна
                Вайсмаааийла вайдрийса васа алкифли куллун мина ассабирийна
                Ваадхалнаҳум фий роҳматина иннаҳум мина ассалиҳийна
                Васа аннуни ис саҳаба муғадибан фасанна ан лан нақдира ааалайҳи фанада фий ассулумати ан ла илаҳа илла анта субҳанака инний кунту мина ассалимийна
                Файстажабна лаҳу ванажжайнаҳу мина алғамми вакасалика нунжий алмуминийна
                Вазакариййа ис нада роббаҳу робби ла тасарний фардан ваанта хайру алварисийна
                Файстажабна лаҳу вауаҳабна лаҳу йаҳйа вааслаҳна лаҳу заужаҳу иннаҳум кану йусариаауна фий алхайрати вайадааунана рағабан вароҳабан вакану лана хашиааийна
                Вааллатий аҳсанат фаржаҳа фанафахна фийҳа мин руҳина важаааалнаҳа вайбнаҳа айатан лилаааламийна
                Инна ҳасиҳи омматукум омматан ваҳидатан ваана роббукум фаоаабудуни
                Ватақаттааау амроҳум байнаҳум куллун илайна ражиаауна
                Фаман йааамал мина ассалиҳати ваҳува муминун фала куфрана лисааайиҳи вайнна лаҳу катибуна
                Ваҳарамун ааала қарйатин аҳлакнаҳа аннаҳум ла йаржиаауна
                Ҳатта иса футиҳат йажужу вамажужу ваҳум мин кулли ҳадабин йансилуна
                Вайқтароба алваааду алҳаққу файса ҳийа шахисатун абсару аллазийна кафару йа вайлана қад кунна фий ғафлатин мин ҳаса бал кунна салимийна
                Иннакум вама тааабудуна мин дуни аллааҳи ҳасабу жаҳаннама антум лаҳа варидуна
                Лау кана ҳаолай алиҳатан ма варадуҳа вакуллун фийҳа халидуна
                Лаҳум фийҳа зафийрун ваҳум фийҳа ла йасмааауна
                Инна аллазийна сабақат лаҳум минна алҳусна олайка ааанҳа мубааадуна
                Ла йасмааауна ҳасийсаҳа ваҳум фий ма иштаҳат анфусуҳум халидуна
                Ла йаҳзунуҳуму алфазааау алакбару вататалаққаҳуму алмалайкату ҳаса йаумукуму аллазий кунтум туааадуна
                Йаума натвий ассамаа катаййи ассижлли лилкутуби кама бадана аувала халқин нуааийдуҳу вааадан ааалайна инна кунна фааайлийна
                Валақад катабна фий аззабури мин бааади ассикри анна аларда йарисуҳа ааибадийа ассалиҳуна
                Инна фий ҳаса лабалаған лиқаумин ааабидийна
                Вама арсалнака илла роҳматан лилаааламийна
                Қул иннама йуҳа илаййа аннама илаҳукум илаҳун ваҳидун фаҳал антум муслимуна
                Файн тауаллау фақул асантукум ааала сауайн вайн адрий ақарийбун ам баааийдун ма туааадуна
                Иннаҳу йаааламу алжаҳра мина алқаули вайаааламу ма тактумуна
                Вайн адрий лааааллааҳу фитнатун лакум ваматаааун ила ҳийнин
                Қала робби оҳкум биалҳаққи вароббуна арроҳману алмустаааану ааала ма тасифуна
            """.trimIndent(),
        ),
        Surah(
            id = 22,
            arabicName = "الحج",
            latinName = "Al-Hajj",
            transliteration = """
                Йа аййуҳа аннасу иттақу роббакум инна залзалата ассаааати шайон ааасиймун
                Йаума тараунаҳа тасҳалу куллу мурдиааатин ааамма ардаааат ватадааау куллу сати ҳамлин ҳамлаҳа ватара аннаса сукара вама ҳум бисукара валакинна ааасаба аллааҳи шадийдун
                Вамина аннаси ман йужадилу фий аллааҳи биғайри ааилмин вайаттабиаау кулла шайтанин марийдин
                Кутиба ааалайҳи аннаҳу ман тауаллааҳу фааннаҳу йудиллуҳу вайаҳдийҳи ила ааасаби ассаааийри
                Йа аййуҳа аннасу ин кунтум фий райбин мина албаааси файнна халақнакум мин туробин сумма мин нутфатин сумма мин ааалақатин сумма мин мудғатин мухаллақатин вағайри мухаллақатин линубаййина лакум вануқирру фий аларҳами ма нашао ила ажалин мусамман сумма нухрижукум тифлан сумма литаблуғу ашуддакум ваминкум ман йутауаффа ваминкум ман йурадду ила арсали алааумури ликайла йааалама мин бааади ааилмин шайан ватара аларда ҳамидатан файса анзална ааалайҳа алмаа иҳтаззат варобат ваанбатат мин кулли заужин баҳийжин
                Салика бианна аллааҳа ҳува алҳаққу вааннаҳу йуҳйий алмаута вааннаҳу ааала кулли шайин қадийрун
                Ваанна ассаааата атийатун ла райба фийҳа ваанна аллааҳа йабааасу ман фий алқубури
                Вамина аннаси ман йужадилу фий аллааҳи биғайри ааилмин вала ҳудан вала китабин мунийрин
                Санийа ааитфиҳи лийудилла ааан сабийли аллааҳи лаҳу фий аддунйа хизйун ванусийқуҳу йаума алқийамати ааасаба алҳарийқи
                Салика бима қаддамат йадака ваанна аллааҳа лайса бисалламин лилааабийди
                Вамина аннаси ман йааабуду аллааҳа ааала ҳарфин файн асабаҳу хайрун итмаанна биҳи вайн асабасу фитнатун инқалаба ааала важҳиҳи хасира аддунйа ваалахирата салика ҳува алхусрану алмубийну
                Йадаау мин дуни аллааҳи ма ла йадурруҳу вама ла йанфааауҳу салика ҳува аддалалу албаааийду
                Йадаау ламан дарруҳу ақробу мин нафааиҳи лабиса алмаула валабиса алааашийру
                Инна аллааҳа йудхилу аллазийна аману ваааамилу ассалиҳати жаннатин тажрий мин таҳтиҳа аланҳару инна аллааҳа йафааалу ма йурийду
                Ман кана йасунну ан лан йансуроҳу аллааҳу фий аддунйа ваалахирати фалйамдуд бисабабин ила ассамай сумма лийақтааа фалйансур ҳал йусҳибанна кайдуҳу ма йағийсу
                Вакасалика анзалнаҳу айатин баййинатин ваанна аллааҳа йаҳдий ман йурийду
                Инна аллазийна аману вааллазийна ҳаду ваалссабиийна ваалннасара ваалмажуса вааллазийна ашраку инна аллааҳа йафсилу байнаҳум йаума алқийамати инна аллааҳа ааала кулли шайин шаҳийдун
                Алам тара анна аллааҳа йасжуду лаҳу ман фий ассамауати ваман фий аларди ваалшшамсу ваалқамару ваалннужуму ваалжибалу ваалшшажару ваалддауаббу вакасийрун мина аннаси вакасийрун ҳаққа ааалайҳи алааасабу ваман йуҳини аллааҳу фама лаҳу мин мукримин инна аллааҳа йафааалу ма йашао
                Ҳасани хасмани ихтасаму фий роббиҳим фааллазийна кафару қуттиааат лаҳум сийабун мин нарин йусаббу мин фауқи руусиҳиму алҳамийму
                Йушару биҳи ма фий бутуниҳим ваалжулуду
                Валаҳум мақамиаау мин ҳадийдин
                Куллама араду ан йахружу минҳа мин ғаммин оааийду фийҳа васуқу ааасаба алҳарийқи
                Инна аллааҳа йудхилу аллазийна аману ваааамилу ассалиҳати жаннатин тажрий мин таҳтиҳа аланҳару йуҳаллауна фийҳа мин асауира мин саҳабин валулуан валибасуҳум фийҳа ҳарийрун
                Ваҳуду ила аттаййиби мина алқаули ваҳуду ила сирати алҳамийди
                Инна аллазийна кафару вайасуддуна ааан сабийли аллааҳи ваалмасжиди алҳарами аллазий жаааалнаҳу лилннаси сауаан алааакифу фийҳи ваалбади ваман йурид фийҳи бийлҳадин бисулмин нусиқҳу мин ааасабин алиймин
                Вайс баувана лийброҳийма макана албайти ан ла тушрик бий шайан ватаҳҳир байтийа лилттайфийна ваалқаймийна ваалрруккааай ассужуди
                Ваассин фий аннаси биалҳажжи йатука рижалан ваааала кулли дамирин йатийна мин кулли фажжин ааамийқин
                Лийашҳаду манафиааа лаҳум вайаскуру исма аллааҳи фий аййамин мааалуматин ааала ма разақаҳум мин баҳиймати аланааами факулу минҳа ваатааиму албайса алфақийра
                Сумма лйақду тафасаҳум валйуфу нусуроҳум валйаттаувафу биалбайти алааатийқи
                Салика ваман йуааассим ҳурумати аллааҳи фаҳува хайрун лаҳу ааинда роббиҳи ваоҳиллат лакуму аланаааму илла ма йутла ааалайкум файжтанибу аррижса мина алаусани вайжтанибу қаула аззури
                Ҳунафаа лиллаҳи ғайра мушрикийна биҳи ваман йушрик биаллааҳи факааннама харра мина ассамай фатахтафуҳу аттайру ау таҳвий биҳи аррийҳу фий маканин саҳийқин
                Салика ваман йуааассим шааааира аллааҳи файннаҳа мин тақва алқулуби
                Лакум фийҳа манафиаау ила ажалин мусамман сумма маҳиллуҳа ила албайти алааатийқи
                Валикулли омматин жаааална мансакан лийаскуру исма аллааҳи ааала ма разақаҳум мин баҳиймати аланааами файлаҳукум илаҳун ваҳидун фалаҳу аслиму вабашшири алмухбитийна
                Аллазийна иса сукира аллааҳу важилат қулубуҳум ваалссабирийна ааала ма асабаҳум ваалмуқиймий ассалати вамимма разақнаҳум йунфиқуна
                Ваалбудна жаааалнаҳа лакум мин шааааири аллааҳи лакум фийҳа хайрун фаоскуру исма аллааҳи ааалайҳа сауаффа файса важабат жунубуҳа факулу минҳа ваатааиму алқаниааа ваалмуаатарра касалика саххарнаҳа лакум лааааллакум ташкуруна
                Лан йанала аллааҳа луҳумуҳа вала димаоҳа валакин йаналуҳу аттақва минкум касалика саххароҳа лакум литукаббиру аллааҳа ааала ма ҳадакум вабашшири алмуҳсинийна
                Инна аллааҳа йудафиаау ааани аллазийна аману инна аллааҳа ла йуҳиббу кулла хауванин кафурин
                Осина лиллазийна йуқаталуна бианнаҳум сулиму вайнна аллааҳа ааала насриҳим лақадийрун
                Аллазийна охрижу мин дийариҳим биғайри ҳаққин илла ан йақулу роббуна аллааҳу валаула дафаау аллааҳи аннаса бааадаҳум бибааадин лаҳуддимат сауамиаау вабийаааун васалауатун вамасажиду йускару фийҳа исму аллааҳи касийран валайансуранна аллааҳу ман йансуруҳу инна аллааҳа лақауиййун ааазийзун
                Аллазийна ин макканнаҳум фий аларди ақаму ассалата ваатауу аззаката ваамару биалмаааруфи ванаҳау ааани алмункари валиллаҳи ааақибату аломури
                Вайн йукассибука фақад кассабат қаблаҳум қауму нуҳин ваааадун васамуду
                Вақауму иброҳийма вақауму лутин
                Ваашабу мадйана вакуссиба муса фаамлайту лилкафирийна сумма ахастуҳум факайфа кана накийри
                Факааййин мин қарйатин аҳлакнаҳа ваҳийа салиматун фаҳийа хауийатун ааала ааурушиҳа вабирин муааатталатин вақасрин машийдин
                Афалам йасийру фий аларди фатакуна лаҳум қулубун йааақилуна биҳа ау асанун йасмааауна биҳа файннаҳа ла тааама алабсару валакин тааама алқулубу аллатий фий ассудури
                Вайастааажилунака биалааасаби валан йухлифа аллааҳу вааадаҳу вайнна йауман ааинда роббика каалфи санатин мимма тааауддуна
                Вакааййин мин қарйатин амлайту лаҳа ваҳийа салиматун сумма ахастуҳа вайлаййа алмасийру
                Қул йа аййуҳа аннасу иннама ана лакум насийрун мубийнун
                Фааллазийна аману ваааамилу ассалиҳати лаҳум мағфиратун варизқун кариймун
                Вааллазийна саааав фий айатина муааажизийна олайка ашабу алжаҳийми
                Вама арсална мин қаблика мин расулин вала набиййин илла иса таманна алқа ашшайтану фий омниййатиҳи файансаху аллааҳу ма йулқий ашшайтану сумма йуҳкиму аллааҳу айатиҳи вааллааҳу ааалиймун ҳакиймун
                Лийажааала ма йулқий ашшайтану фитнатан лиллазийна фий қулубиҳим марадун ваалқасийати қулубуҳум вайнна ассалимийна лафий шиқақин баааийдин
                Валийааалама аллазийна уту алааилма аннаҳу алҳаққу мин роббика файумину биҳи фатухбита лаҳу қулубуҳум вайнна аллааҳа лаҳади аллазийна аману ила сиратин мустақиймин
                Вала йазалу аллазийна кафару фий мирйатин минҳу ҳатта татийаҳуму ассаааату бағтатан ау йатийаҳум ааасабу йаумин ааақиймин
                Алмулку йаумайсин лиллаҳи йаҳкуму байнаҳум фааллазийна аману ваааамилу ассалиҳати фий жаннати аннаааийми
                Вааллазийна кафару вакассабу биайатина фаолайка лаҳум ааасабун муҳийнун
                Вааллазийна ҳажару фий сабийли аллааҳи сумма қутилу ау мату лайарзуқаннаҳуму аллааҳу ризқан ҳасанан вайнна аллааҳа лаҳува хайру арразиқийна
                Лайудхиланнаҳум мудхалан йардаунаҳу вайнна аллааҳа лаааалиймун ҳалиймун
                Салика ваман ааақаба бимисли ма аауқиба биҳи сумма буғийа ааалайҳи лайансураннаҳу аллааҳу инна аллааҳа лаааафуввун ғафурун
                Салика бианна аллааҳа йулижу аллайла фий аннаҳари вайулижу аннаҳара фий аллайли ваанна аллааҳа самийааун басийрун
                Салика бианна аллааҳа ҳува алҳаққу ваанна ма йадаауна мин дуниҳи ҳува албатилу ваанна аллааҳа ҳува алааалиййу алкабийру
                Алам тара анна аллааҳа анзала мина ассамай маан фатусбиҳу аларду мухдарратан инна аллааҳа латийфун хабийрун
                Лаҳу ма фий ассамауати вама фий аларди вайнна аллааҳа лаҳува алғаниййу алҳамийду
                Алам тара анна аллааҳа саххара лакум ма фий аларди ваалфулка тажрий фий албаҳри биамриҳи вайумсику ассамаа ан тақаааа ааала аларди илла бийсниҳи инна аллааҳа биалннаси ларауфун роҳиймун
                Ваҳува аллазий аҳйакум сумма йумийтукум сумма йуҳйийкум инна алинсана лакафурун
                Ликулли омматин жаааална мансакан ҳум насикуҳу фала йуназиаауннака фий аламри ваодаау ила роббика иннака лаааала ҳудан мустақиймин
                Вайн жадалука фақули аллааҳу аааламу бима тааамалуна
                Аллааҳу йаҳкуму байнакум йаума алқийамати фийма кунтум фийҳи тахталифуна
                Алам тааалам анна аллааҳа йаааламу ма фий ассамай вааларди инна салика фий китабин инна салика ааала аллааҳи йасийрун
                Вайааабудуна мин дуни аллааҳи ма лам йуназзил биҳи султанан вама лайса лаҳум биҳи ааилмун вама лилссалимийна мин насийрин
                Вайса тутла ааалайҳим айатуна баййинатин тааарифу фий вужуҳи аллазийна кафару алмункара йакадуна йастуна биаллазийна йатлуна ааалайҳим айатина қул афаонаббиокум бишаррин мин саликум аннару ваааадаҳа аллааҳу аллазийна кафару вабиса алмасийру
                Йа аййуҳа аннасу дуриба масалун файстамиаау лаҳу инна аллазийна тадаауна мин дуни аллааҳи лан йахлуқу субабан валауи ижтамааау лаҳу вайн йаслубуҳуму ассубабу шайан ла йастанқисуҳу минҳу дааауфа атталибу ваалматлубу
                Ма қадару аллааҳа ҳаққа қадриҳи инна аллааҳа лақауиййун ааазийзун
                Аллааҳу йастафий мина алмалайкати русулан вамина аннаси инна аллааҳа самийааун басийрун
                Йаааламу ма байна айдийҳим вама халфаҳум вайла аллааҳи туржааау аломуру
                Йа аййуҳа аллазийна аману иркааау ваосжуду ваоаабуду роббакум вайфааалу алхайра лааааллакум туфлиҳуна
                Важаҳиду фий аллааҳи ҳаққа жиҳадиҳи ҳува ижтабакум вама жаааала ааалайкум фий аддийни мин ҳаражин миллата абийкум иброҳийма ҳува саммакуму алмуслимийна мин қаблу вафий ҳаса лийакуна аррасулу шаҳийдан ааалайкум ватакуну шуҳадаа ааала аннаси фаақийму ассалата ваату аззаката вайаатасиму биаллааҳи ҳува маулакум фаниаама алмаула ваниаама аннасийру
            """.trimIndent(),
        ),
        Surah(
            id = 23,
            arabicName = "المؤمنون",
            latinName = "Al-Mu'minun",
            transliteration = """
                Қад афлаҳа алмуминуна
                Аллазийна ҳум фий салатиҳим хашиаауна
                Вааллазийна ҳум ааани аллағви муааридуна
                Вааллазийна ҳум лилззакати фааайлуна
                Вааллазийна ҳум лифуружиҳим ҳафисуна
                Илла ааала азважиҳим ау ма малакат аймануҳум файннаҳум ғайру малумийна
                Фамани ибтаға вараа салика фаолайка ҳуму алааадуна
                Вааллазийна ҳум лиаманатиҳим вааааҳдиҳим рааауна
                Вааллазийна ҳум ааала салауатиҳим йуҳафисуна
                Олайка ҳуму алварисуна
                Аллазийна йарисуна алфирдауса ҳум фийҳа халидуна
                Валақад халақна алинсана мин сулалатин мин тийнин
                Сумма жаааалнаҳу нутфатан фий қарарин макийнин
                Сумма халақна аннутфата ааалақатан фахалақна алааалақата мудғатан фахалақна алмудғата ааисаман факасауна алааисама лаҳман сумма аншанаҳу халқан ахара фатабарака аллааҳу аҳсану алхалиқийна
                Сумма иннакум бааада салика ламаййитуна
                Сумма иннакум йаума алқийамати тубааасуна
                Валақад халақна фауқакум сабааа тарайқа вама кунна ааани алхалқи ғафилийна
                Ваанзална мина ассамай маан биқадарин фаасканнаҳу фий аларди вайнна ааала саҳабин биҳи лақадируна
                Фааншана лакум биҳи жаннатин мин нахийлин ваааанабин лакум фийҳа фауакиҳу касийратун ваминҳа такулуна
                Вашажаратан тахружу мин тури сайнаа танбуту биалддуҳни васибғин лилакилийна
                Вайнна лакум фий аланааами лааайбратан нусқийкум мимма фий бутуниҳа валакум фийҳа манафиаау касийратун ваминҳа такулуна
                Ваааалайҳа ваааала алфулки туҳмалуна
                Валақад арсална нуҳан ила қаумиҳи фақала йа қауми оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу афала таттақуна
                Фақала алмалао аллазийна кафару мин қаумиҳи ма ҳаса илла башарун мислукум йурийду ан йатафаддала ааалайкум валау шаа аллааҳу лаанзала малайкатан ма самиаана биҳаса фий абайна алаувалийна
                Ин ҳува илла ражулун биҳи жиннатун фатароббасу биҳи ҳатта ҳийнин
                Қала робби онсурний бима кассабуни
                Фаавҳайна илайҳи ани иснааай алфулка биааайунина вауаҳйина файса жаа амруна вафара аттаннуру фаослук фийҳа мин куллин заужайни иснайни вааҳлака илла ман сабақа ааалайҳи алқаулу минҳум вала тухатибний фий аллазийна саламу иннаҳум муғрақуна
                Файса истауайта анта ваман маааака ааала алфулки фақули алҳамду лиллаҳи аллазий нажжана мина алқауми ассалимийна
                Вақул робби анзилний мунзалан мубаракан ваанта хайру алмунзилийна
                Инна фий салика лаайатин вайн кунна ламубталийна
                Сумма аншана мин бааадиҳим қарнан ахарийна
                Фаарсална фийҳим расулан минҳум ани оаабуду аллааҳа ма лакум мин илаҳин ғайруҳу афала таттақуна
                Вақала алмалао мин қаумиҳи аллазийна кафару вакассабу билиқай алахирати ваатрафнаҳум фий алҳайати аддунйа ма ҳаса илла башарун мислукум йакулу мимма такулуна минҳу вайашробу мимма ташробуна
                Валайн атааатум башаран мислакум иннакум исан лахасируна
                Айааайдукум аннакум иса миттум вакунтум туробан вааайсаман аннакум мухражуна
                Ҳайҳата ҳайҳата лима туааадуна
                Ин ҳийа илла ҳайатуна аддунйа намуту ванаҳйа вама наҳну бимабааусийна
                Ин ҳува илла ражулун ифтара ааала аллааҳи касибан вама наҳну лаҳу бимуминийна
                Қала робби онсурний бима кассабуни
                Қала ааамма қалийлин лайусбиҳунна надимийна
                Фаахасасуму ассайҳату биалҳаққи фажаааалнаҳум ғусаан фабуаадан лилқауми ассалимийна
                Сумма аншана мин бааадиҳим қурунан ахарийна
                Ма тасбиқу мин омматин ажалаҳа вама йастахируна
                Сумма арсална русулана татра кулла ма жаа омматан расулуҳа кассабуҳу фаатбааана бааадаҳум бааадан важаааалнаҳум аҳадийса фабуаадан лиқаумин ла йуминуна
                Сумма арсална муса ваахаҳу ҳаруна биайатина васултанин мубийнин
                Ила фирааауна вамалайҳи файстакбару вакану қауман ааалийна
                Фақалу анумину либашарайни мислина вақаумуҳума лана ааабидуна
                Факассабуҳума факану мина алмуҳлакийна
                Валақад атайна муса алкитаба лааааллааҳум йаҳтадуна
                Важаааална ибна марйама ваоммаҳу айатан ваавайнаҳума ила робватин сати қарарин вамаааийнин
                Йа аййуҳа аррусулу кулу мина аттаййибати вайаамалу салиҳан инний бима тааамалуна ааалиймун
                Вайнна ҳасиҳи омматукум омматан ваҳидатан ваана роббукум файттақуни
                Фатақаттааау амроҳум байнаҳум зубуран куллу ҳизбин бима ладайҳим фариҳуна
                Фасарҳум фий ғамратиҳим ҳатта ҳийнин
                Айаҳсабуна аннама нумиддуҳум биҳи мин малин вабанийна
                Нусариаау лаҳум фий алхайрати бал ла йашаауруна
                Инна аллазийна ҳум мин хашйати роббиҳим мушфиқуна
                Вааллазийна ҳум биайати роббиҳим йуминуна
                Вааллазийна ҳум бироббиҳим ла йушрикуна
                Вааллазийна йутуна ма атау вақулубуҳум важилатун аннаҳум ила роббиҳим ражиаауна
                Олайка йусариаауна фий алхайрати ваҳум лаҳа сабиқуна
                Вала нукаллифу нафсан илла вусаааҳа валадайна китабун йантиқу биалҳаққи ваҳум ла йусламуна
                Бал қулубуҳум фий ғамратин мин ҳаса валаҳум ааамалун мин дуни салика ҳум лаҳа ааамилуна
                Ҳатта иса ахасна мутрафийҳим биалааасаби иса ҳум йажаруна
                Ла тажару алйаума иннакум минна ла тунсаруна
                Қад канат айатий тутла ааалайкум факунтум ааала ааақабикум танкисуна
                Мустакбирийна биҳи самиран таҳжуруна
                Афалам йаддаббару алқаула ам жааҳум ма лам йати абааҳуму алаувалийна
                Ам лам йааарифу расулаҳум фаҳум лаҳу мункируна
                Ам йақулуна биҳи жиннатун бал жааҳум биалҳаққи вааксаруҳум лилҳаққи кариҳуна
                Валауи иттабаааа алҳаққу аҳвааҳум лафасадати ассамауату вааларду ваман фийҳинна бал атайнаҳум бисикриҳим фаҳум ааан сикриҳим муааридуна
                Ам тасалуҳум харжан фахаражу роббика хайрун ваҳува хайру арразиқийна
                Вайннака латадаауҳум ила сиратин мустақиймин
                Вайнна аллазийна ла йуминуна биалахирати ааани ассирати ланакибуна
                Валау роҳимнаҳум вакашафна ма биҳим мин дуррин лалажжу фий туғйаниҳим йааамаҳуна
                Валақад ахаснаҳум биалааасаби фама истакану лироббиҳим вама йатадаррааауна
                Ҳатта иса фатаҳна ааалайҳим бабан са ааасабин шадийдин иса ҳум фийҳи мублисуна
                Ваҳува аллазий аншаа лакуму ассамааа ваалабсара ваалафидата қалийлан ма ташкуруна
                Ваҳува аллазий сараакум фий аларди вайлайҳи туҳшаруна
                Ваҳува аллазий йуҳйий вайумийту валаҳу ихтилафу аллайли ваалннаҳари афала тааақилуна
                Бал қалу мисла ма қала алаувалуна
                Қалу айса митна вакунна туробан вааайсаман айнна ламабааусуна
                Лақад вуааидна наҳну ваабаона ҳаса мин қаблу ин ҳаса илла асатийру алаувалийна
                Қул лимани аларду ваман фийҳа ин кунтум таааламуна
                Сайақулуна лиллаҳи қул афала тасаккаруна
                Қул ман роббу ассамауати ассабааи вароббу алааарши алааасийми
                Сайақулуна лиллаҳи қул афала таттақуна
                Қул ман бийадиҳи малакуту кулли шайин ваҳува йужийру вала йужару ааалайҳи ин кунтум таааламуна
                Сайақулуна лиллаҳи қул фаанна тушаруна
                Бал атайнаҳум биалҳаққи вайннаҳум лакасибуна
                Ма иттахаса аллааҳу мин валадин вама кана мааааҳу мин илаҳин исан ласаҳаба куллу илаҳин бима халақа валаааала бааадуҳум ааала бааадин субҳана аллааҳи ааамма йасифуна
                Ааалими алғайби ваалшшаҳадати фатаааала ааамма йушрикуна
                Қул робби имма турийанний ма йуааадуна
                Робби фала тажааалний фий алқауми ассалимийна
                Вайнна ааала ан нурийака ма нааайдуҳум лақадируна
                Идфааа биаллатий ҳийа аҳсану ассаййиата наҳну аааламу бима йасифуна
                Вақул робби аааусу бика мин ҳамазати ашшайатийни
                Вааааусу бика робби ан йаҳдуруни
                Ҳатта иса жаа аҳадаҳуму алмауту қала робби иржиаауни
                Лааааллий ааамалу салиҳан фийма таракту калла иннаҳа калиматун ҳува қайлуҳа вамин варайҳим барзахун ила йауми йубааасуна
                Файса нуфиха фий ассури фала ансаба байнаҳум йаумайсин вала йатасаалуна
                Фаман сақулат мауазийнуҳу фаолайка ҳуму алмуфлиҳуна
                Ваман хаффат мауазийнуҳу фаолайка аллазийна хасиру анфусаҳум фий жаҳаннама халидуна
                Талфаҳу вужуҳаҳуму аннару ваҳум фийҳа калиҳуна
                Алам такун айатий тутла ааалайкум факунтум биҳа тукассибуна
                Қалу роббана ғалабат ааалайна шиқватуна вакунна қауман даллийна
                Роббана ахрижна минҳа файн ааудна файнна салимуна
                Қала ихсау фийҳа вала тукаллимуни
                Иннаҳу кана фарийқун мин ааибадий йақулуна роббана аманна файғфир лана вайрҳамна ваанта хайру арроҳимийна
                Файттахастумуҳум сихриййан ҳатта ансаукум сикрий вакунтум минҳум тазакуна
                Инний жазайтуҳуму алйаума бима сабару аннаҳум ҳуму алфайзуна
                Қала кам лабистум фий аларди ааадада синийна
                Қалу лабисна йауман ау бааада йаумин файсали алаааддийна
                Қала ин лабистум илла қалийлан лау аннакум кунтум таааламуна
                Афаҳасибтум аннама халақнакум ааабасан вааннакум илайна ла туржааауна
                Фатаааала аллааҳу алмалику алҳаққу ла илаҳа илла ҳува роббу алааарши алкарийми
                Ваман йадаау маааа аллааҳи илаҳан ахара ла бурҳана лаҳу биҳи файннама ҳисабуҳу ааинда роббиҳи иннаҳу ла йуфлиҳу алкафируна
                Вақул робби иғфир вайрҳам ваанта хайру арроҳимийна
            """.trimIndent(),
        ),
        Surah(
            id = 24,
            arabicName = "النور",
            latinName = "An-Nur",
            transliteration = """
                Суратун анзалнаҳа вафараднаҳа ваанзална фийҳа айатин баййинатин лааааллакум тасаккаруна
                Аззанийату ваалззаний файжлиду кулла ваҳидин минҳума миата жалдатин вала тахускум биҳима рафатун фий дийни аллааҳи ин кунтум туминуна биаллааҳи ваалйауми алахири валйашҳад ааасабаҳума тайфатун мина алмуминийна
                Аззаний ла йанкиҳу илла занийатан ау мушрикатан ваалззанийату ла йанкиҳуҳа илла занин ау мушрикун ваҳуррима салика ааала алмуминийна
                Вааллазийна йармуна алмуҳсанати сумма лам йату биарбаааати шуҳадаа файжлидуҳум саманийна жалдатан вала тақбалу лаҳум шаҳадатан абадан ваолайка ҳуму алфасиқуна
                Илла аллазийна табу мин бааади салика вааслаҳу файнна аллааҳа ғафурун роҳиймун
                Вааллазийна йармуна азважаҳум валам йакун лаҳум шуҳадао илла анфусуҳум фашаҳадату аҳадиҳим арбааау шаҳадатин биаллааҳи иннаҳу ламина ассадиқийна
                Ваалхамисату анна лаааната аллааҳи ааалайҳи ин кана мина алкасибийна
                Вайадрао ааанҳа алааасаба ан ташҳада арбаааа шаҳадатин биаллааҳи иннаҳу ламина алкасибийна
                Ваалхамисата анна ғадаба аллааҳи ааалайҳа ин кана мина ассадиқийна
                Валаула фадлу аллааҳи ааалайкум вароҳматуҳу ваанна аллааҳа таувабун ҳакиймун
                Инна аллазийна жау биалифки ааусбатун минкум ла таҳсабуҳу шарран лакум бал ҳува хайрун лакум ликулли имрийн минҳум ма иктасаба мина алисми вааллазий тауалла киброҳу минҳум лаҳу ааасабун ааасиймун
                Лаула ис самиаатумуҳу санна алмуминуна ваалмуминату бианфусиҳим хайран вақалу ҳаса ифкун мубийнун
                Лаула жау ааалайҳи биарбаааати шуҳадаа файс лам йату биалшшуҳадай фаолайка ааинда аллааҳи ҳуму алкасибуна
                Валаула фадлу аллааҳи ааалайкум вароҳматуҳу фий аддунйа ваалахирати ламассакум фий ма афадтум фийҳи ааасабун ааасиймун
                Ис талаққаунаҳу биалсинатикум ватақулуна биафваҳикум ма лайса лакум биҳи ааилмун ватаҳсабунаҳу ҳаййинан ваҳува ааинда аллааҳи ааасиймун
                Валаула ис самиаатумуҳу қултум ма йакуну лана ан натакаллама биҳаса субҳанака ҳаса буҳтанун ааасиймун
                Йааайсукуму аллааҳу ан тааауду лимислиҳи абадан ин кунтум муминийна
                Вайубаййину аллааҳу лакуму алайати вааллааҳу ааалиймун ҳакиймун
                Инна аллазийна йуҳиббуна ан ташийааа алфаҳишату фий аллазийна аману лаҳум ааасабун алиймун фий аддунйа ваалахирати вааллааҳу йаааламу ваантум ла таааламуна
                Валаула фадлу аллааҳи ааалайкум вароҳматуҳу ваанна аллааҳа рауфун роҳиймун
                Йа аййуҳа аллазийна аману ла таттабиаау хутувати ашшайтани ваман йаттабиаа хутувати ашшайтани файннаҳу йамуру биалфаҳшай ваалмункари валаула фадлу аллааҳи ааалайкум вароҳматуҳу ма зака минкум мин аҳадин абадан валакинна аллааҳа йузаккий ман йашао вааллааҳу самийааун ааалиймун
                Вала йатали олу алфадли минкум ваалссаааати ан йуту олий алқурба ваалмасакийна ваалмуҳажирийна фий сабийли аллааҳи валйааафу валйасфаҳу ала туҳиббуна ан йағфира аллааҳу лакум вааллааҳу ғафурун роҳиймун
                Инна аллазийна йармуна алмуҳсанати алғафилати алмуминати луааину фий аддунйа ваалахирати валаҳум ааасабун ааасиймун
                Йаума ташҳаду ааалайҳим алсинатуҳум ваайдийҳим вааржулуҳум бима кану йааамалуна
                Йаумайсин йуваффийҳиму аллааҳу дийнаҳуму алҳаққа вайаааламуна анна аллааҳа ҳува алҳаққу алмубийну
                Алхабийсату лилхабийсийна ваалхабийсуна лилхабийсати ваалттаййибату лилттаййибийна ваалттаййибуна лилттаййибати олайка мубаррауна мимма йақулуна лаҳум мағфиратун варизқун кариймун
                Йа аййуҳа аллазийна аману ла тадхулу буйутан ғайра буйутикум ҳатта тастанису ватусаллиму ааала аҳлиҳа саликум хайрун лакум лааааллакум тасаккаруна
                Файн лам тажиду фийҳа аҳадан фала тадхулуҳа ҳатта йусана лакум вайн қийла лакуму иржиаау файржиаау ҳува азка лакум вааллааҳу бима тааамалуна ааалиймун
                Лайса ааалайкум жунаҳун ан тадхулу буйутан ғайра маскунатин фийҳа матаааун лакум вааллааҳу йаааламу ма тубдуна вама тактумуна
                Қул лилмуминийна йағудду мин абсариҳум вайаҳфасу фуружаҳум салика азка лаҳум инна аллааҳа хабийрун бима йаснааауна
                Вақул лилмуминати йағдудна мин абсариҳинна вайаҳфасна фуружаҳунна вала йубдийна зийнатаҳунна илла ма саҳара минҳа валйадрибна бихумуриҳинна ааала жуйубиҳинна вала йубдийна зийнатаҳунна илла либуааулатиҳинна ау абайҳинна ау абай буааулатиҳинна ау абнайҳинна ау абнай буааулатиҳинна ау ихваниҳинна ау баний ихваниҳинна ау баний ахауатиҳинна ау нисайҳинна ау ма малакат аймануҳунна ауи аттабиааийна ғайри олий алирбати мина аррижали ауи аттифли аллазийна лам йасҳару ааала аааурати аннисай вала йадрибна биаржулиҳинна лийуаалама ма йухфийна мин зийнатиҳинна ватубу ила аллааҳи жамийааан аййуҳа алмуминуна лааааллакум туфлиҳуна
                Ваанкиҳу алайама минкум ваалссалиҳийна мин ааибадикум ваймайкум ин йакуну фуқараа йуғниҳиму аллааҳу мин фадлиҳи вааллааҳу васиааун ааалиймун
                Валйастааафифи аллазийна ла йажидуна никаҳан ҳатта йуғнийаҳуму аллааҳу мин фадлиҳи вааллазийна йабтағуна алкитаба мимма малакат айманукум факатибуҳум ин ааалимтум фийҳим хайран ваатуҳум мин мали аллааҳи аллазий атакум вала тукриҳу фатайатикум ааала албиғай ин арадна таҳассунан литабтағу ааарада алҳайати аддунйа ваман йукриҳҳунна файнна аллааҳа мин бааади икроҳиҳинна ғафурун роҳиймун
                Валақад анзална илайкум айатин мубаййинатин вамасалан мина аллазийна халау мин қабликум вамауааисатан лилмуттақийна
                Аллааҳу нуру ассамауати вааларди масалу нуриҳи камишкатин фийҳа мисбаҳун алмисбаҳу фий зужажатин аззужажату кааннаҳа каукабун дурриййун йуқаду мин шажаратин мубаракатин зайтунатин ла шарқиййатин вала ғарбиййатин йакаду зайтуҳа йудийо валау лам тамсашу нарун нурун ааала нурин йаҳдий аллааҳу линуриҳи ман йашао вайадрибу аллааҳу аламсала лилннаси вааллааҳу бикулли шайин ааалиймун
                Фий буйутин асина аллааҳу ан турфаааа вайускара фийҳа исмуҳу йусаббиҳу лаҳу фийҳа биалғудувви вааласали
                Рижалун ла тулҳийҳим тижаратун вала байааун ааан сикри аллааҳи вайқами ассалати ваийтай аззакати йахафуна йауман татақаллабу фийҳи алқулубу ваалабсару
                Лийажзийаҳуму аллааҳу аҳсана ма ааамилу вайазийдаҳум мин фадлиҳи вааллааҳу йарзуқу ман йашао биғайри ҳисабин
                Вааллазийна кафару ааамалуҳум касаробин биқийааатин йаҳсабуҳу ассаману маан ҳатта иса жааҳу лам йажизу шайан вауажада аллааҳа ааиндаҳу фауаффаҳу ҳисабаҳу вааллааҳу сарийаау алҳисаби
                Ау касулуматин фий баҳрин лужжиййин йағшаҳу маужун мин фауқиҳи маужун мин фауқиҳи саҳабун сулуматун бааадуҳа фауқа бааадин иса ахража йадаҳу лам йакад йароҳа ваман лам йажааали аллааҳу лаҳу нуран фама лаҳу мин нурин
                Алам тара анна аллааҳа йусаббиҳу лаҳу ман фий ассамауати вааларди ваалттайру саффатин куллун қад ааалима салатаҳу ватасбийҳаҳу вааллааҳу ааалиймун бима йафааалуна
                Валиллаҳи мулку ассамауати вааларди вайла аллааҳи алмасийру
                Алам тара анна аллааҳа йузжий саҳабан сумма йуаллифу байнаҳу сумма йажааалуҳу рукаман фатара алвадқа йахружу мин хилалиҳи вайуназзилу мина ассамай мин жибалин фийҳа мин барадин файусийбу биҳи ман йашао вайасрифуҳу ааан ман йашао йакаду сана барқиҳи йасҳабу биалабсари
                Йуқаллибу аллааҳу аллайла ваалннаҳара инна фий салика лааайбратан лиолий алабсари
                Вааллааҳу халақа кулла даббатин мин майн фаминҳум ман йамший ааала батниҳи ваминҳум ман йамший ааала рижлайни ваминҳум ман йамший ааала арбааайн йахлуқу аллааҳу ма йашао инна аллааҳа ааала кулли шайин қадийрун
                Лақад анзална айатин мубаййинатин вааллааҳу йаҳдий ман йашао ила сиратин мустақиймин
                Вайақулуна аманна биаллааҳи вабиалррасули ваатааана сумма йатауалла фарийқун минҳум мин бааади салика вама олайка биалмуминийна
                Вайса дуаау ила аллааҳи варасулиҳи лийаҳкума байнаҳум иса фарийқун минҳум муааридуна
                Вайн йакун лаҳуму алҳаққу йату илайҳи мусааинийна
                Афий қулубиҳим марадун ами иртабу ам йахафуна ан йаҳийфа аллааҳу ааалайҳим варасулуҳу бал олайка ҳуму ассалимуна
                Иннама кана қаула алмуминийна иса дуаау ила аллааҳи варасулиҳи лийаҳкума байнаҳум ан йақулу самиаана ваатааана ваолайка ҳуму алмуфлиҳуна
                Ваман йутиааи аллааҳа варасулаҳу вайахша аллааҳа вайаттақҳи фаолайка ҳуму алфайзуна
                Ваақсаму биаллааҳи жаҳда айманиҳим лайн амартаҳум лайахружунна қул ла туқсиму таааатун маааруфатун инна аллааҳа хабийрун бима тааамалуна
                Қул атийаау аллааҳа ваатийаау аррасула файн тауаллау файннама ааалайҳи ма ҳуммила ваааалайкум ма ҳуммилтум вайн тутийаауҳу таҳтаду вама ааала аррасули илла албалағу алмубийна
                Ваааада аллааҳу аллазийна аману минкум ваааамилу ассалиҳати лайастахлифаннаҳум фий аларди кама истахлафа аллазийна мин қаблиҳим валайумаккинанна лаҳум дийнаҳуму аллазий иртада лаҳум валайубаддиланнаҳум мин бааади хауфиҳим амнан йааабудунаний ла йушрикуна бий шайан ваман кафара бааада салика фаолайка ҳуму алфасиқуна
                Ваақийму ассалата ваату аззаката ваатийаау аррасула лааааллакум турҳамуна
                Ла таҳсабанна аллазийна кафару муаажизийна фий аларди вамауаҳуму аннару валабиса алмасийру
                Йа аййуҳа аллазийна аману лийастасинкуму аллазийна малакат айманукум вааллазийна лам йаблуғу алҳулума минкум саласа марратин мин қабли салати алфажри ваҳийна тадааауна сийабакум мина ассаҳийрати вамин бааади салати алааишай саласу ааауратин лакум лайса ааалайкум вала ааалайҳим жунаҳун бааадаҳунна таувафуна ааалайкум бааадукум ааала бааадин касалика йубаййину аллааҳу лакуму алайати вааллааҳу ааалиймун ҳакиймун
                Вайса балаға алатфалу минкуму алҳулума фалйастасину кама истасана аллазийна мин қаблиҳим касалика йубаййину аллааҳу лакум айатиҳи вааллааҳу ааалиймун ҳакиймун
                Ваалқауааайду мина аннисай аллатий ла йаржуна никаҳан фалайса ааалайҳинна жунаҳун ан йадааана сийабаҳунна ғайра мутабаррижатин бизийнатин ваан йастааафифна хайрун лаҳунна вааллааҳу самийааун ааалиймун
                Лайса ааала алааама ҳаражун вала ааала алаааражи ҳаражун вала ааала алмарийди ҳаражун вала ааала анфусикум ан такулу мин буйутикум ау буйути абайкум ау буйути оммаҳатикум ау буйути ихваникум ау буйути ахауатикум ау буйути ааамамикум ау буйути ааамматикум ау буйути ахваликум ау буйути халатикум ау ма малактум мафатиҳаҳу ау садийқикум лайса ааалайкум жунаҳун ан такулу жамийааан ау аштатан файса дахалтум буйутан фасаллиму ааала анфусикум таҳиййатан мин ааинди аллааҳи мубаракатан таййибатан касалика йубаййину аллааҳу лакуму алайати лааааллакум тааақилуна
                Иннама алмуминуна аллазийна аману биаллааҳи варасулиҳи вайса кану мааааҳу ааала амрин жамиааин лам йасҳабу ҳатта йастасинуҳу инна аллазийна йастасинунака олайка аллазийна йуминуна биаллааҳи варасулиҳи файса истасанука либааади шаниҳим фасан лиман шита минҳум вайстағфир лаҳуму аллааҳа инна аллааҳа ғафурун роҳиймун
                Ла тажааалу дуаааа аррасули байнакум кадуааай бааадикум бааадан қад йаааламу аллааҳу аллазийна йатасаллалуна минкум ливасан фалйаҳсари аллазийна йухалифуна ааан амриҳи ан тусийбаҳум фитнатун ау йусийбаҳум ааасабун алиймун
                Ала инна лиллаҳи ма фий ассамауати вааларди қад йаааламу ма антум ааалайҳи вайаума йуржааауна илайҳи файунаббиоҳум бима ааамилу вааллааҳу бикулли шайин ааалиймун
            """.trimIndent(),
        ),
        Surah(
            id = 25,
            arabicName = "الفرقان",
            latinName = "Al-Furqan",
            transliteration = """
                Табарака аллазий наззала алфурқана ааала ааабдиҳи лийакуна лилаааламийна насийран
                Аллазий лаҳу мулку ассамауати вааларди валам йаттахис валадан валам йакун лаҳу шарийкун фий алмулки вахалақа кулла шайин фақаддароҳу тақдийран
                Вайттахасу мин дуниҳи алиҳатан ла йахлуқуна шайан ваҳум йухлақуна вала йамликуна лианфусиҳим дарран вала нафааан вала йамликуна маутан вала ҳайатан вала нушуран
                Вақала аллазийна кафару ин ҳаса илла ифкун ифтароҳу вааааанаҳу ааалайҳи қаумун ахаруна фақад жау сулман вазуран
                Вақалу асатийру алаувалийна иктатабаҳа фаҳийа тумла ааалайҳи букратан ваасийлан
                Қул анзалаҳу аллазий йаааламу ассирра фий ассамауати вааларди иннаҳу кана ғафуран роҳийман
                Вақалу мали ҳаса аррасули йакулу аттаааама вайамший фий аласвақи лаула онзила илайҳи малакун файакуна мааааҳу насийран
                Ау йулқа илайҳи канзун ау такуну лаҳу жаннатун йакулу минҳа вақала ассалимуна ин таттабиаауна илла ражулан машуран
                Онсур кайфа даробу лака аламсала фадаллу фала йастатийаауна сабийлан
                Табарака аллазий ин шаа жаааала лака хайран мин салика жаннатин тажрий мин таҳтиҳа аланҳару вайажааал лака қусуран
                Бал кассабу биалссаааати ваааатадна лиман кассаба биалссаааати саааийран
                Иса раасум мин маканин баааийдин самиаау лаҳа тағаййусан вазафийран
                Вайса олқу минҳа маканан даййиқан муқарранийна даааав ҳуналика субуран
                Ла тадаау алйаума субуран ваҳидан ваодаау субуран касийран
                Қул асалика хайрун ам жаннату алхулди аллатий вуааида алмуттақуна канат лаҳум жазаан вамасийран
                Лаҳум фийҳа ма йашауна халидийна кана ааала роббика вааадан масулан
                Вайаума йаҳшуруҳум вама йааабудуна мин дуни аллааҳи файақулу аантум адлалтум ааибадий ҳаолай ам ҳум даллу ассабийла
                Қалу субҳанака ма кана йанбағий лана ан наттахиса мин дуника мин аулийаа валакин маттааатаҳум ваабааҳум ҳатта насу ассикра вакану қауман буран
                Фақад кассабукум бима тақулуна фама тастатийаауна сарфан вала насран ваман йаслим минкум нусиқҳу ааасабан кабийран
                Вама арсална қаблака мина алмурсалийна илла иннаҳум лайакулуна аттаааама вайамшуна фий аласвақи важаааална бааадакум либааадин фитнатан атасбируна вакана роббука басийран
                Вақала аллазийна ла йаржуна лиқаана лаула онзила ааалайна алмалайкату ау нара роббана лақади истакбару фий анфусиҳим ваааатау ааутувван кабийран
                Йаума йарауна алмалайката ла бушра йаумайсин лилмужримийна вайақулуна ҳижран маҳжуран
                Вақадимна ила ма ааамилу мин ааамалин фажаааалнаҳу ҳабаан мансуран
                Ашабу алжаннати йаумайсин хайрун мустақарран вааҳсану мақийлан
                Вайаума ташаққақу ассамао биалғамами вануззила алмалайкату танзийлан
                Алмулку йаумайсин алҳаққу лилрроҳмани вакана йауман ааала алкафирийна ааасийран
                Вайаума йаааадду ассалиму ааала йадайҳи йақулу йа лайтаний иттахасту маааа аррасули сабийлан
                Йа вайлата лайтаний лам аттахис фуланан халийлан
                Лақад адалланий ааани ассикри бааада ис жааний вакана ашшайтану лилинсани хасулан
                Вақала аррасулу йа робби инна қаумий иттахасу ҳаса алқурана маҳжуран
                Вакасалика жаааална ликулли набиййин ааадувван мина алмужримийна вакафа бироббика ҳадийан ванасийран
                Вақала аллазийна кафару лаула нуззила ааалайҳи алқурану жумлатан ваҳидатан касалика линусаббита биҳи фуадака варатталнаҳу тартийлан
                Вала йатунака бимасалин илла жинака биалҳаққи вааҳсана тафсийран
                Аллазийна йуҳшаруна ааала вужуҳиҳим ила жаҳаннама олайка шаррун маканан ваадаллу сабийлан
                Валақад атайна муса алкитаба важаааална мааааҳу ахаҳу ҳаруна вазийран
                Фақулна исҳаба ила алқауми аллазийна кассабу биайатина фадаммарнаҳум тадмийран
                Вақаума нуҳин ламма кассабу аррусула ағрақнаҳум важаааалнаҳум лилннаси айатан ваааатадна лилссалимийна ааасабан алийман
                Ваааадан васамуда ваашаба аррасси вақурунан байна салика касийран
                Вакуллан даробна лаҳу аламсала вакуллан таббарна татбийран
                Валақад атау ааала алқарйати аллатий омтират матара ассауи афалам йакуну йараунаҳа бал кану ла йаржуна нушуран
                Вайса раавка ин йаттахисунака илла ҳузуван аҳаса аллазий бааааса аллааҳу расулан
                Ин када лайудиллуна ааан алиҳатина лаула ан сабарна ааалайҳа васауфа йаааламуна ҳийна йарауна алааасаба ман адаллу сабийлан
                Араайта мани иттахаса илаҳаҳу ҳауаҳу афаанта такуну ааалайҳи вакийлан
                Ам таҳсабу анна аксароҳум йасмааауна ау йааақилуна ин ҳум илла кааланааами бал ҳум адаллу сабийлан
                Алам тара ила роббика кайфа мадда ассилла валау шаа лажаааалаҳу сакинан сумма жаааална ашшамса ааалайҳи далийлан
                Сумма қабаднаҳу илайна қабдан йасийран
                Ваҳува аллазий жаааала лакуму аллайла либасан ваалннаума субатан важаааала аннаҳара нушуран
                Ваҳува аллазий арсала аррийаҳа бушран байна йадай роҳматиҳи ваанзална мина ассамай маан таҳуран
                Линуҳйийа биҳи балдатан майтан ванусқийаҳу мимма халақна анаааман ваанасиййа касийран
                Валақад саррафнаҳу байнаҳум лийассаккару фааба аксару аннаси илла куфуран
                Валау шина лабаааасна фий кулли қарйатин насийран
                Фала тутиааи алкафирийна важаҳизум биҳи жиҳадан кабийран
                Ваҳува аллазий маража албаҳрайни ҳаса ааасбун фуратун ваҳаса милҳун ожажун важаааала байнаҳума барзахан ваҳижран маҳжуран
                Ваҳува аллазий халақа мина алмай башаран фажаааалаҳу насабан васиҳран вакана роббука қадийран
                Вайааабудуна мин дуни аллааҳи ма ла йанфааауҳум вала йадурруҳум вакана алкафиру ааала роббиҳи саҳийран
                Вама арсалнака илла мубашширан ванасийран
                Қул ма асалукум ааалайҳи мин ажрин илла ман шаа ан йаттахиса ила роббиҳи сабийлан
                Ватауаккал ааала алҳаййи аллазий ла йамуту васаббиҳ биҳамдиҳи вакафа биҳи бисунуби ааибадиҳи хабийран
                Аллазий халақа ассамауати вааларда вама байнаҳума фий ситтати аййамин сумма истауа ааала алааарши арроҳману файсал биҳи хабийран
                Вайса қийла лаҳуму осжуду лилрроҳмани қалу вама арроҳману анасжуду лима тамуруна вазадаҳум нуфуран
                Табарака аллазий жаааала фий ассамай буружан важаааала фийҳа сиражан вақамаран мунийран
                Ваҳува аллазий жаааала аллайла ваалннаҳара хилфатан лиман арада ан йассаккара ау арада шукуран
                Вааайбаду арроҳмани аллазийна йамшуна ааала аларди ҳаунан вайса хатабаҳуму алжаҳилуна қалу саламан
                Вааллазийна йабийтуна лироббиҳим сужжадан вақийаман
                Вааллазийна йақулуна роббана исриф ааанна ааасаба жаҳаннама инна ааасабаҳа кана ғараман
                Иннаҳа саат мустақарран вамуқаман
                Вааллазийна иса анфақу лам йусрифу валам йақтуру вакана байна салика қауаман
                Вааллазийна ла йадаауна маааа аллааҳи илаҳан ахара вала йақтулуна аннафса аллатий ҳаррама аллааҳу илла биалҳаққи вала йазнуна ваман йафааал салика йалқа асаман
                Йудааааф лаҳу алааасабу йаума алқийамати вайахлуд фийҳи муҳанан
                Илла ман таба ваамана ваааамила ааамалан салиҳан фаолайка йубаддилу аллааҳу саййиатиҳим ҳасанатин вакана аллааҳу ғафуран роҳийман
                Ваман таба ваааамила салиҳан файннаҳу йатубу ила аллааҳи матабан
                Вааллазийна ла йашҳадуна аззура вайса марру биаллағви марру кираман
                Вааллазийна иса суккиру биайати роббиҳим лам йахирру ааалайҳа сумман ваааумйанан
                Вааллазийна йақулуна роббана ҳаб лана мин азважина васурриййатина қуррата ааайунин вайжааална лилмуттақийна имаман
                Олайка йужзауна алғурфата бима сабару вайулаққауна фийҳа таҳиййатан васаламан
                Халидийна фийҳа ҳасунат мустақарран вамуқаман
                Қул ма йааабао бикум роббий лаула дуаааокум фақад кассабтум фасауфа йакуну лизаман
            """.trimIndent(),
        ),
        Surah(
            id = 26,
            arabicName = "الشعراء",
            latinName = "Ash-Shu'ara",
            transliteration = """
                Тасийнмийм
                Тилка айату алкитаби алмубийни
                Лааааллака бахиааун нафсака алла йакуну муминийна
                Ин наша нуназзил ааалайҳим мина ассамай айатан фасаллат ааанақуҳум лаҳа хадиааийна
                Вама йатийҳим мин сикрин мина арроҳмани муҳдасин илла кану ааанҳу муааридийна
                Фақад кассабу фасайатийҳим анбао ма кану биҳи йастаҳзиуна
                Ауалам йарау ила аларди кам анбатна фийҳа мин кулли заужин кариймин
                Инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Вайс нада роббука муса ани ити алқаума ассалимийна
                Қаума фирааауна ала йаттақуна
                Қала робби инний ахафу ан йукассибуни
                Вайадийқу садрий вала йанталиқу лисаний фаарсил ила ҳаруна
                Валаҳум ааалаййа санбун фаахафу ан йақтулуни
                Қала калла файсҳаба биайатина инна маааакум мустамиаауна
                Фатийа фирааауна фақула инна расулу робби алаааламийна
                Ан арсил маааана баний исраийла
                Қала алам нуроббика фийна валийдан валабиста фийна мин ааумурика синийна
                Вафаааалта фааалатака аллатий фаааалта ваанта мина алкафирийна
                Қала фаааалтуҳа исан ваана мина аддаллийна
                Фафарарту минкум ламма хифтукум фауаҳаба лий роббий ҳукман важааааланий мина алмурсалийна
                Ватилка ниааматун тамуннуҳа ааалаййа ан аааббадта баний исраийла
                Қала фирааауну вама роббу алаааламийна
                Қала роббу ассамауати вааларди вама байнаҳума ин кунтум муқинийна
                Қала лиман ҳаулаҳу ала тастамиаауна
                Қала роббукум вароббу абайкуму алаувалийна
                Қала инна расулакуму аллазий орсила илайкум ламажнунун
                Қала роббу алмашриқи ваалмағриби вама байнаҳума ин кунтум тааақилуна
                Қала лайни иттахаста илаҳан ғайрий лаажаааланнака мина алмасжунийна
                Қала ауалау житука бишайин мубийнин
                Қала фати биҳи ин кунта мина ассадиқийна
                Фаалқа ааасаҳу файса ҳийа суаабанун мубийнун
                Ваназаааа йадаҳу файса ҳийа байдао лилннасирийна
                Қала лилмалай ҳаулаҳу инна ҳаса ласаҳирун ааалиймун
                Йурийду ан йухрижакум мин ардикум бисиҳриҳи фамаса тамуруна
                Қалу аржиҳ ваахаҳу вайбааас фий алмадайни ҳаширийна
                Йатука бикулли саҳҳарин ааалиймин
                Фажумиааа ассаҳарату лимийқати йаумин мааалумин
                Вақийла лилннаси ҳал антум мужтамиаауна
                Лааааллана наттабиаау ассаҳарата ин кану ҳуму алғалибийна
                Фаламма жаа ассаҳарату қалу лифирааауна айнна лана лаажран ин кунна наҳну алғалибийна
                Қала наааам вайннакум исан ламина алмуқарробийна
                Қала лаҳум муса алқу ма антум мулқуна
                Фаалқау ҳибалаҳум вааайсиййаҳум вақалу биааиззати фирааауна инна ланаҳну алғалибуна
                Фаалқа муса ааасаҳу файса ҳийа талқафу ма йафикуна
                Фаолқийа ассаҳарату сажидийна
                Қалу аманна биробби алаааламийна
                Робби муса ваҳаруна
                Қала амантум лаҳу қабла ан асана лакум иннаҳу лакабийрукуму аллазий ааалламакуму ассиҳра фаласауфа таааламуна лаоқаттиааанна айдийакум вааржулакум мин хилафин валаосаллибаннакум ажмаааийна
                Қалу ла дайра инна ила роббина мунқалибуна
                Инна натмааау ан йағфира лана роббуна хатайана ан кунна аувала алмуминийна
                Ваавҳайна ила муса ан асри биааибадий иннакум муттабааауна
                Фаарсала фирааауну фий алмадайни ҳаширийна
                Инна ҳаолай лаширсиматун қалийлуна
                Вайннаҳум лана лағайсуна
                Вайнна лажамийааун ҳасируна
                Фаахражнаҳум мин жаннатин вааауйунин
                Вакунузин вамақамин кариймин
                Касалика ваавраснаҳа баний исраийла
                Фаатбааауҳум мушриқийна
                Фаламма тараа алжамааани қала ашабу муса инна ламудракуна
                Қала калла инна маааййа роббий сайаҳдийни
                Фаавҳайна ила муса ани идриб биааасака албаҳра файнфалақа факана куллу фирқин каалттауди алааасийми
                Ваазлафна самма алахарийна
                Ваанжайна муса ваман мааааҳу ажмаааийна
                Сумма ағрақна алахарийна
                Инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Ваотлу ааалайҳим набаа иброҳийма
                Ис қала лиабийҳи вақаумиҳи ма тааабудуна
                Қалу нааабуду аснаман фанасаллу лаҳа ааакифийна
                Қала ҳал йасмаааунакум ис тадаауна
                Ау йанфаааунакум ау йадурруна
                Қалу бал важадна абаана касалика йафааалуна
                Қала афараайтум ма кунтум тааабудуна
                Антум ваабаокуму алақдамуна
                Файннаҳум ааадуввун лий илла робба алаааламийна
                Аллазий халақаний фаҳува йаҳдийни
                Вааллазий ҳува йутааимуний вайасқийни
                Вайса маридту фаҳува йашфийни
                Вааллазий йумийтуний сумма йуҳйийни
                Вааллазий атмааау ан йағфира лий хатийатий йаума аддийни
                Робби ҳаб лий ҳукман ваалҳиқний биалссалиҳийна
                Вайжааал лий лисана сидқин фий алахирийна
                Вайжааалний мин варасати жаннати аннаааийми
                Вайғфир лиабий иннаҳу кана мина аддаллийна
                Вала тухзиний йаума йубааасуна
                Йаума ла йанфааау малун вала бануна
                Илла ман ата аллааҳа биқалбин салиймин
                Ваозлифати алжаннату лилмуттақийна
                Вабурризати алжаҳийму лилғауийна
                Вақийла лаҳум айна ма кунтум тааабудуна
                Мин дуни аллааҳи ҳал йансурунакум ау йантасируна
                Факубкибу фийҳа ҳум ваалғаууна
                Важунуду иблийса ажмааауна
                Қалу ваҳум фийҳа йахтасимуна
                Тааллааҳи ин кунна лафий далалин мубийнин
                Ис нусаувийкум биробби алаааламийна
                Вама адаллана илла алмужримуна
                Фама лана мин шафиааийна
                Вала садийқин ҳамиймин
                Фалау анна лана карратан фанакуна мина алмуминийна
                Инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Кассабат қауму нуҳин алмурсалийна
                Ис қала лаҳум ахуҳум нуҳун ала таттақуна
                Инний лакум расулун амийнун
                Файттақу аллааҳа ваатийаауни
                Вама асалукум ааалайҳи мин ажрин ин ажрийа илла ааала робби алаааламийна
                Файттақу аллааҳа ваатийаауни
                Қалу анумину лака вайттабаааака аларсалуна
                Қала вама ааилмий бима кану йааамалуна
                Ин ҳисабуҳум илла ааала роббий лау ташаауруна
                Вама ана битариди алмуминийна
                Ин ана илла насийрун мубийнун
                Қалу лайн лам тантаҳи йа нуҳу латакунанна мина алмаржумийна
                Қала робби инна қаумий кассабуни
                Файфтаҳ байний вабайнаҳум фасан ванажжиний ваман маааййа мина алмуминийна
                Фаанжайнаҳу ваман мааааҳу фий алфулки алмашҳуни
                Сумма ағрақна баааду албақийна
                Инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Кассабат ааадун алмурсалийна
                Ис қала лаҳум ахуҳум ҳудун ала таттақуна
                Инний лакум расулун амийнун
                Файттақу аллааҳа ваатийаауни
                Вама асалукум ааалайҳи мин ажрин ин ажрийа илла ааала робби алаааламийна
                Атабнуна бикулли рийааин айатан тааабасуна
                Вататтахисуна масаниааа лааааллакум тахлудуна
                Вайса баташтум баташтум жаббарийна
                Файттақу аллааҳа ваатийаауни
                Вайттақу аллазий амаддакум бима таааламуна
                Амаддакум бианааамин вабанийна
                Важаннатин вааауйунин
                Инний ахафу ааалайкум ааасаба йаумин ааасиймин
                Қалу сауаон ааалайна ауааааста ам лам такун мина алвааайсийна
                Ин ҳаса илла хулуқу алаувалийна
                Вама наҳну бимуааассабийна
                Факассабуҳу фааҳлакнаҳум инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Кассабат самуду алмурсалийна
                Ис қала лаҳум ахуҳум салиҳун ала таттақуна
                Инний лакум расулун амийнун
                Файттақу аллааҳа ваатийаауни
                Вама асалукум ааалайҳи мин ажрин ин ажрийа илла ааала робби алаааламийна
                Атутракуна фий ма ҳаҳуна аминийна
                Фий жаннатин вааауйунин
                Вазуруааин ванахлин талаауҳа ҳадиймун
                Ватанҳитуна мина алжибали буйутан фариҳийна
                Файттақу аллааҳа ваатийаауни
                Вала тутийаау амра алмусрифийна
                Аллазийна йуфсидуна фий аларди вала йуслиҳуна
                Қалу иннама анта мина алмусаҳҳарийна
                Ма анта илла башарун мислуна фати биайатин ин кунта мина ассадиқийна
                Қала ҳасиҳи нақатун лаҳа ширбун валакум ширбу йаумин мааалумин
                Вала тамассуҳа бисуин файахусакум ааасабу йаумин ааасиймин
                Фаааақаруҳа фаасбаҳу надимийна
                Фаахасаҳуму алааасабу инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Кассабат қауму лутин алмурсалийна
                Ис қала лаҳум ахуҳум лутун ала таттақуна
                Инний лакум расулун амийнун
                Файттақу аллааҳа ваатийаауни
                Вама асалукум ааалайҳи мин ажрин ин ажрийа илла ааала робби алаааламийна
                Ататуна ассукрана мина алаааламийна
                Ватасаруна ма халақа лакум роббукум мин азважикум бал антум қаумун ааадуна
                Қалу лайн лам тантаҳи йа луту латакунанна мина алмухражийна
                Қала инний лиааамаликум мина алқалийна
                Робби нажжиний вааҳлий мимма йааамалуна
                Фанажжайнаҳу вааҳлаҳу ажмаааийна
                Илла ааажузан фий алғабирийна
                Сумма даммарна алахарийна
                Ваамтарна ааалайҳим матаран фасаа матару алмунсарийна
                Инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Кассаба ашабу алайкати алмурсалийна
                Ис қала лаҳум шуааайбун ала таттақуна
                Инний лакум расулун амийнун
                Файттақу аллааҳа ваатийаауни
                Вама асалукум ааалайҳи мин ажрин ин ажрийа илла ааала робби алаааламийна
                Ауфу алкайла вала такуну мина алмухсирийна
                Вазину биалқистаси алмустақийми
                Вала табхасу аннаса ашйааҳум вала тааасау фий аларди муфсидийна
                Вайттақу аллазий халақакум ваалжибиллата алаувалийна
                Қалу иннама анта мина алмусаҳҳарийна
                Вама анта илла башарун мислуна вайн насуннука ламина алкасибийна
                Фаасқит ааалайна кисафан мина ассамай ин кунта мина ассадиқийна
                Қала роббий аааламу бима тааамалуна
                Факассабуҳу фаахасаҳум ааасабу йауми ассуллати иннаҳу кана ааасаба йаумин ааасиймин
                Инна фий салика лаайатан вама кана аксаруҳум муминийна
                Вайнна роббака лаҳува алааазийзу арроҳийму
                Вайннаҳу латанзийлу робби алаааламийна
                Назала биҳи арруҳу аламийну
                Ааала қалбика литакуна мина алмунсирийна
                Билисанин аааробиййин мубийнин
                Вайннаҳу лафий зубури алаувалийна
                Ауалам йакун лаҳум айатан ан йаааламаҳу аауламао баний исраийла
                Валау наззалнаҳу ааала бааади алааажамийна
                Фақарааҳу ааалайҳим ма кану биҳи муминийна
                Касалика салакнаҳу фий қулуби алмужримийна
                Ла йуминуна биҳи ҳатта йарауу алааасаба алалийма
                Файатийаҳум бағтатан ваҳум ла йашаауруна
                Файақулу ҳал наҳну мунсаруна
                Афабиааасабина йастааажилуна
                Афараайта ин маттааанаҳум синийна
                Сумма жааҳум ма кану йуааадуна
                Ма ағна ааанҳум ма кану йуматтааауна
                Вама аҳлакна мин қарйатин илла лаҳа мунсируна
                Сикра вама кунна салимийна
                Вама таназзалат биҳи ашшайатийну
                Вама йанбағий лаҳум вама йастатийаауна
                Иннаҳум ааани ассамааи ламааазулуна
                Фала тадаау маааа аллааҳи илаҳан ахара фатакуна мина алмуааассабийна
                Ваансир ааашийратака алақробийна
                Вайхфид жанаҳака лимани иттабаааака мина алмуминийна
                Файн ааасаука фақул инний барийон мимма тааамалуна
                Ватауаккал ааала алааазийзи арроҳийми
                Аллазий йарака ҳийна тақуму
                Ватақаллубака фий ассажидийна
                Иннаҳу ҳува ассамийаау алааалийму
                Ҳал онаббиокум ааала ман таназзалу ашшайатийну
                Таназзалу ааала кулли аффакин асиймин
                Йулқуна ассамааа вааксаруҳум касибуна
                Ваалшшуааарао йаттабиаауҳуму алғаууна
                Алам тара аннаҳум фий кулли вадин йаҳиймуна
                Вааннаҳум йақулуна ма ла йафааалуна
                Илла аллазийна аману ваааамилу ассалиҳати васакару аллааҳа касийран вайнтасару мин бааади ма сулиму васайаааламу аллазийна саламу аййа мунқалабин йанқалибуна
            """.trimIndent(),
        ),
        Surah(
            id = 27,
            arabicName = "النمل",
            latinName = "An-Naml",
            transliteration = """
                Тасийн тилка айату алқурани вакитабин мубийнин
                Ҳудан вабушра лилмуминийна
                Аллазийна йуқиймуна ассалата вайутуна аззаката ваҳум биалахирати ҳум йуқинуна
                Инна аллазийна ла йуминуна биалахирати заййанна лаҳум ааамалаҳум фаҳум йааамаҳуна
                Олайка аллазийна лаҳум суо алааасаби ваҳум фий алахирати ҳуму алахсаруна
                Вайннака латулаққа алқурана мин ладун ҳакиймин ааалиймин
                Ис қала муса лиаҳлиҳи инний анасту наран саатийкум минҳа бихабарин ау атийкум бишиҳабин қабасин лааааллакум тасталуна
                Фаламма жааҳа нудийа ан бурика ман фий аннари ваман ҳаулаҳа васубҳана аллааҳи робби алаааламийна
                Йа муса иннаҳу ана аллааҳу алааазийзу алҳакийму
                Ваалқи ааасака фаламма рааҳа таҳтаззу кааннаҳа жаннун валла мудбиран валам йуаааққиб йа муса ла тахаф инний ла йахафу ладаййа алмурсалуна
                Илла ман салама сумма баддала ҳуснан бааада суин файнний ғафурун роҳиймун
                Ваадхил йадака фий жайбика тахруж байдаа мин ғайри суин фий тисааи айатин ила фирааауна вақаумиҳи иннаҳум кану қауман фасиқийна
                Фаламма жаасум айатуна мубсиратан қалу ҳаса сиҳрун мубийнун
                Важаҳаду биҳа вайстайқанаса анфусуҳум сулман ваааулувван фаонсур кайфа кана ааақибату алмуфсидийна
                Валақад атайна даууда васулаймана ааилман вақала алҳамду лиллаҳи аллазий фаддалана ааала касийрин мин ааибадиҳи алмуминийна
                Вауариса сулайману даууда вақала йа аййуҳа аннасу аауллимна мантиқа аттайри ваутийна мин кулли шайин инна ҳаса лаҳува алфадлу алмубийну
                Ваҳушира лисулаймана жунудуҳу мина алжинни ваалинси ваалттайри фаҳум йузааауна
                Ҳатта иса атау ааала вади аннамли қалат намлатун йа аййуҳа аннамлу одхулу масакинакум ла йаҳтиманнакум сулайману важунудуҳу ваҳум ла йашаауруна
                Фатабассама даҳикан мин қаулиҳа вақала робби аузиааний ан ашкура ниааматака аллатий анааамта ааалаййа ваааала валидаййа ваан ааамала салиҳан тардаҳу ваадхилний бироҳматика фий ааибадика ассалиҳийна
                Ватафаққада аттайра фақала ма лийа ла ара алҳузуда ам кана мина алғайбийна
                Лаоааассибаннаҳу ааасабан шадийдан ау лаасбаҳаннаҳу ау лайатийанний бисултанин мубийнин
                Фамакаса ғайра баааийдин фақала аҳатту бима лам туҳит биҳи важитука мин сабайн бинабайн йақийнин
                Инний важадту имраатан тамликуҳум ваутийат мин кулли шайин валаҳа аааршун ааасиймун
                Важадтуҳа вақаумаҳа йасжудуна лилшшамси мин дуни аллааҳи вазаййана лаҳуму ашшайтану ааамалаҳум фасаддаҳум ааани ассабийли фаҳум ла йаҳтадуна
                Алла йасжуду лиллаҳи аллазий йухрижу алхабаа фий ассамауати вааларди вайаааламу ма тухфуна вама туаалинуна
                Аллааҳу ла илаҳа илла ҳува роббу алааарши алааасийми
                Қала санансуру асадақта ам кунта мина алкасибийна
                Исҳаб бикитабий ҳаса фаалқиҳ илайҳим сумма тауалла ааанҳум фаонсур маса йаржиаауна
                Қалат йа аййуҳа алмалао инний олқийа илаййа китабун кариймун
                Иннаҳу мин сулаймана вайннаҳу бисми аллааҳи арроҳмани арроҳийми
                Алла тааалу ааалаййа ватуний муслимийна
                Қалат йа аййуҳа алмалао афтуний фий амрий ма кунту қатиааатан амран ҳатта ташҳадуна
                Қалу наҳну олу қувватин ваолу басин шадийдин вааламру илайки фаонсурий маса тамурийна
                Қалат инна алмулука иса дахалу қарйатан афсадуҳа важаааалу ааайззата аҳлиҳа асиллатан вакасалика йафааалуна
                Вайнний мурсилатун илайҳим биҳадиййатин фанасиратун бима йаржиаау алмурсалуна
                Фаламма жаа сулаймана қала атумиддунани бималин фама атанийа аллааҳу хайрун мимма атакум бал антум биҳадиййатикум тафроҳуна
                Иржиаа илайҳим фаланатийаннаҳум бижунудин ла қибала лаҳум биҳа валанухрижаннаҳум минҳа асиллатан ваҳум сағируна
                Қала йа аййуҳа алмалао аййукум йатийний биаааршиҳа қабла ан йатуний муслимийна
                Қала ааифрийтун мина алжинни ана атийка биҳи қабла ан тақума мин мақамика вайнне ааалайҳи лақауиййун амийнун
                Қала аллазий ааиндаҳу ааилмун мина алкитаби ана атийка биҳи қабла ан йартадда илайка тарфука фаламма рааҳу мустақирран ааиндаҳу қала ҳаса мин фадли роббий лийаблуваний аашкуру ам акфуру ваман шакара файннама йашкуру линафсиҳи ваман кафара файнна роббий ғаниййун кариймун
                Қала наккиру лаҳа аааршаҳа нансур атаҳтадий ам такуну мина аллазийна ла йаҳтадуна
                Фаламма жаат қийла аҳакаса аааршуки қалат кааннаҳу ҳува ваутийна алааилма мин қаблиҳа вакунна муслимийна
                Васаддаҳа ма канат тааабуду мин дуни аллааҳи иннаҳа канат мин қаумин кафирийна
                Қийла лаҳа одхулий ассарҳа фаламма раасу ҳасибасу лужжатан вакашафат ааан сақайҳа қала иннаҳу сарҳун мумаррадун мин қауарийра қалат робби инний саламту нафсий ваасламту маааа сулаймана лиллаҳи робби алаааламийна
                Валақад арсална ила самуда ахаҳум салиҳан ани оаабуду аллааҳа файса ҳум фарийқани йахтасимуна
                Қала йа қауми лима тастааажилуна биалссаййиати қабла алҳасанати лаула тастағфируна аллааҳа лааааллакум турҳамуна
                Қалу иттаййарна бика вабиман маааака қала тайрукум ааинда аллааҳи бал антум қаумун туфтануна
                Вакана фий алмадийнати тисааату роҳтин йуфсидуна фий аларди вала йуслиҳуна
                Қалу тақасаму биаллааҳи ланубаййитаннаҳу вааҳлаҳу сумма ланақуланна ливалиййиҳи ма шаҳидна маҳлика аҳлиҳи вайнна ласадиқуна
                Вамакару макран вамакарна макран ваҳум ла йашаауруна
                Фаонсур кайфа кана ааақибату макриҳим анна даммарнаҳум вақаумаҳум ажмаааийна
                Фатилка буйутуҳум хауийатан бима саламу инна фий салика лаайатан лиқаумин йаааламуна
                Ваанжайна аллазийна аману вакану йаттақуна
                Валутан ис қала лиқаумиҳи ататуна алфаҳишата ваантум тубсируна
                Айннакум лататуна аррижала шаҳватан мин дуни аннисай бал антум қаумун тажҳалуна
                Фама кана жауаба қаумиҳи илла ан қалу ахрижу ала лутин мин қарйатикум иннаҳум онасун йататаҳҳаруна
                Фаанжайнаҳу вааҳлаҳу илла имраатаҳу қаддарнаҳа мина алғабирийна
                Ваамтарна ааалайҳим матаран фасаа матару алмунсарийна
                Қули алҳамду лиллаҳи васаламун ааала ааибадиҳи аллазийна истафа аллааҳу хайрун амма йушрикуна
                Амман халақа ассамауати вааларда ваанзала лакум мина ассамай маан фаанбатна биҳи ҳадайқа сата баҳжатин ма кана лакум ан тунбиту шажароҳа айлаҳун маааа аллааҳи бал ҳум қаумун йааадилуна
                Амман жаааала аларда қараран важаааала хилалаҳа анҳаран важаааала лаҳа рауасийа важаааала байна албаҳрайни ҳажизан айлаҳун маааа аллааҳи бал аксаруҳум ла йаааламуна
                Амман йужийбу алмудтарра иса дааааҳу вайакшифу ассуа вайажааалукум хулафаа аларди айлаҳун маааа аллааҳи қалийлан ма тасаккаруна
                Амман йаҳдийкум фий сулумати албарри ваалбаҳри ваман йурсилу аррийаҳа бушран байна йадай роҳматиҳи айлаҳун маааа аллааҳи таааала аллааҳу ааамма йушрикуна
                Амман йабдао алхалқа сумма йуааийдуҳу ваман йарзуқукум мина ассамай вааларди айлаҳун маааа аллааҳи қул ҳату бурҳанакум ин кунтум садиқийна
                Қул ла йаааламу ман фий ассамауати вааларди алғайба илла аллааҳу вама йашаауруна аййана йубааасуна
                Бали иддарака ааилмуҳум фий алахирати бал ҳум фий шаккин минҳа бал ҳум минҳа ааамуна
                Вақала аллазийна кафару айса кунна туробан ваабаона айнна ламухражуна
                Лақад вуааидна ҳаса наҳну ваабаона мин қаблу ин ҳаса илла асатийру алаувалийна
                Қул сийру фий аларди фаонсуру кайфа кана ааақибату алмужримийна
                Вала таҳзан ааалайҳим вала такун фий дайқин мимма йамкуруна
                Вайақулуна мата ҳаса алваааду ин кунтум садиқийна
                Қул аааса ан йакуна радифа лакум баааду аллазий тастааажилуна
                Вайнна роббака ласу фадлин ааала аннаси валакинна аксароҳум ла йашкуруна
                Вайнна роббака лайаааламу ма тукинну судуруҳум вама йуаалинуна
                Вама мин ғайбатин фий ассамай вааларди илла фий китабин мубийнин
                Инна ҳаса алқурана йақуссу ааала баний исраийла аксара аллазий ҳум фийҳи йахталифуна
                Вайннаҳу лаҳудан вароҳматун лилмуминийна
                Инна роббака йақдий байнаҳум биҳукмиҳи ваҳува алааазийзу алааалийму
                Фатауаккал ааала аллааҳи иннака ааала алҳаққи алмубийни
                Иннака ла тусмиаау алмаута вала тусмиаау ассумма аддуаааа иса валлау мудбирийна
                Вама анта биҳадий алааумйи ааан далалатиҳим ин тусмиаау илла ман йумину биайатина фаҳум муслимуна
                Вайса вақаааа алқаулу ааалайҳим ахражна лаҳум даббатан мина аларди тукаллимуҳум анна аннаса кану биайатина ла йуқинуна
                Вайаума наҳшуру мин кулли омматин фаужан мимман йукассибу биайатина фаҳум йузааауна
                Ҳатта иса жау қала акассабтум биайатий валам туҳийту биҳа ааилман аммаса кунтум тааамалуна
                Вауақаааа алқаулу ааалайҳим бима саламу фаҳум ла йантиқуна
                Алам йарау анна жаааална аллайла лийаскуну фийҳи ваалннаҳара мубсиран инна фий салика лаайатин лиқаумин йуминуна
                Вайаума йунфаху фий ассури фафазиааа ман фий ассамауати ваман фий аларди илла ман шаа аллааҳу вакуллун атауҳу дахирийна
                Ватара алжибала таҳсабуҳа жамидатан ваҳийа тамурру марра ассаҳаби сунааа аллааҳи аллазий атқана кулла шайин иннаҳу хабийрун бима тафааалуна
                Ман жаа биалҳасанати фалаҳу хайрун минҳа ваҳум мин фазааайн йаумайсин аминуна
                Ваман жаа биалссаййиати факуббат вужуҳуҳум фий аннари ҳал тужзауна илла ма кунтум тааамалуна
                Иннама омирту ан ааабуда робба ҳасиҳи албалдати аллазий ҳаррамаҳа валаҳу куллу шайин ваомирту ан акуна мина алмуслимийна
                Ваан атлува алқурана фамани иҳтада файннама йаҳтадий линафсиҳи ваман далла фақул иннама ана мина алмунсирийна
                Вақули алҳамду лиллаҳи сайурийкум айатиҳи фатааарифунаҳа вама роббука биғафилин ааамма тааамалуна
            """.trimIndent(),
        ),
        Surah(
            id = 28,
            arabicName = "القصص",
            latinName = "Al-Qasas",
            transliteration = """
                Тасийнмийм
                Тилка айату алкитаби алмубийни
                Натлу ааалайка мин набай муса вафирааауна биалҳаққи лиқаумин йуминуна
                Инна фирааауна ааала фий аларди важаааала аҳлаҳа шийаааан йастадааифу тайфатан минҳум йусаббиҳу абнааҳум вайастаҳйий нисааҳум иннаҳу кана мина алмуфсидийна
                Ванурийду ан намунна ааала аллазийна истудааифу фий аларди ванажааалаҳум аймматан ванажааалаҳуму алварисийна
                Ванумаккина лаҳум фий аларди ванурийа фирааауна ваҳамана важунудаҳума минҳум ма кану йаҳсаруна
                Ваавҳайна ила омми муса ан ардиааийҳи файса хифти ааалайҳи фаалқийҳи фий алйамми вала тахафий вала таҳзаний инна раддуҳу илайки важааайлуҳу мина алмурсалийна
                Файлтақатаҳу алу фирааауна лийакуна лаҳум ааадувван ваҳазанан инна фирааауна ваҳамана важунудаҳума кану хатиийна
                Вақалати имраату фирааауна қуррату ааайнин лий валака ла тақтулуҳу аааса ан йанфаааана ау наттахисаҳу валадан ваҳум ла йашаауруна
                Ваасбаҳа фуаду омми муса фариған ин кадат латубдий биҳи лаула ан робатна ааала қалбиҳа литакуна мина алмуминийна
                Вақалат лиохтиҳи қуссийҳи фабасурат биҳи ааан жунубин ваҳум ла йашаауруна
                Ваҳаррамна ааалайҳи алмарадиааа мин қаблу фақалат ҳал адуллукум ааала аҳли байтин йакфулунаҳу лакум ваҳум лаҳу насиҳуна
                Фарададнаҳу ила оммиҳи кай тақарра ааайнуҳа вала таҳзана валитааалама анна вааада аллааҳи ҳаққун валакинна аксароҳум ла йаааламуна
                Валамма балаға ашуддаҳу вайстауа атайнаҳу ҳукман вааайлман вакасалика нажзий алмуҳсинийна
                Вадахала алмадийната ааала ҳийни ғафлатин мин аҳлиҳа фауажада фийҳа ражулайни йақтатилани ҳаса мин шийааатиҳи ваҳаса мин ааадуввиҳи файстағасаҳу аллазий мин шийааатиҳи ааала аллазий мин ааадуввиҳи фауаказаҳу муса фақада ааалайҳи қала ҳаса мин ааамали ашшайтани иннаҳу ааадуввун мудиллун мубийнун
                Қала робби инний саламту нафсий файғфир лий фағафара лаҳу иннаҳу ҳува алғафуру арроҳийму
                Қала робби бима анааамта ааалаййа фалан акуна саҳийран лилмужримийна
                Фаасбаҳа фий алмадийнати хайфан йатараққабу файса аллазий истансароҳу биаламси йастасрихуҳу қала лаҳу муса иннака лағауиййун мубийнун
                Фаламма ан арада ан йабтиша биаллазий ҳува ааадуввун лаҳума қала йа муса атурийду ан тақтуланий кама қаталта нафсан биаламси ин турийду илла ан такуна жаббаран фий аларди вама турийду ан такуна мина алмуслиҳийна
                Важаа ражулун мин ақса алмадийнати йасааа қала йа муса инна алмалаа йатамируна бика лийақтулука фаохруж инний лака мина аннасиҳийна
                Фахаража минҳа хайфан йатараққабу қала робби нажжиний мина алқауми ассалимийна
                Валамма тауажжаҳа тилқаа мадйана қала аааса роббий ан йаҳдийаний сауаа ассабийли
                Валамма варада маа мадйана важада ааалайҳи омматан мина аннаси йасқуна вауажада мин дуниҳиму имраатайни тасудани қала ма хатбукума қалата ла насқий ҳатта йусдира арриааао ваабуна шайхун кабийрун
                Фасақа лаҳума сумма тауалла ила ассилли фақала робби инний лима анзалта илаййа мин хайрин фақийрун
                Фажаасу иҳдаҳума тамший ааала истиҳйайн қалат инна абий йадааука лийажзийака ажра ма сақайта лана фаламма жааҳу вақасса ааалайҳи алқасаса қала ла тахаф нажаута мина алқауми ассалимийна
                Қалат иҳдаҳума йа абати истажирҳу инна хайра мани истажарта алқауиййу аламийну
                Қала инний орийду ан онкиҳака иҳда ибнатаййа ҳатайни ааала ан тажураний саманийа ҳижажин файн атмамта ааашран фамин ааиндика вама орийду ан ашуққа ааалайка сатажидуний ин шаа аллааҳу мина ассалиҳийна
                Қала салика байний вабайнака аййама алажалайни қадайту фала ааудвана ааалаййа вааллааҳу ааала ма нақулу вакийлун
                Фаламма қада мусаалажала васара биаҳлиҳи анаса мин жаниби аттури наран қала лиаҳлиҳи омкусу инний анасту наран лааааллий атийкум минҳа бихабарин ау жасватин мина аннари лааааллакум тасталуна
                Фаламма атаҳа нудийа мин шатий алвади алаймани фий албуқааати алмубаракати мина ашшажарати ан йа муса инний ана аллааҳу роббу алаааламийна
                Ваан алқи ааасака фаламма рааҳа таҳтаззу кааннаҳа жаннун валла мудбиран валам йуаааққиб йа муса ақбил вала тахаф иннака мина аламинийна
                Ослук йадака фий жайбика тахруж байдаа мин ғайри суин ваодмум илайка жанаҳака мина арроҳби фасаника бурҳанани мин роббика ила фирааауна вамалайҳи иннаҳум кану қауман фасиқийна
                Қала робби инний қаталту минҳум нафсан фаахафу ан йақтулуни
                Ваахий ҳаруну ҳува афсаҳу минний лисанан фаарсилҳу маааййа ридан йусаддиқуний инний ахафу ан йукассибуни
                Қала санашудду ааадудака биахийка ванажааалу лакума султанан фала йасилуна илайкума биайатина антума вамани иттабаааакума алғалибуна
                Фаламма жааҳум муса биайатина баййинатин қалу ма ҳаса илла сиҳрун муфтаран вама самиаана биҳаса фий абайна алаувалийна
                Вақала муса роббий аааламу биман жаа биалҳуда мин ааиндиҳи ваман такуну лаҳу ааақибату аддари иннаҳу ла йуфлиҳу ассалимуна
                Вақала фирааауну йа аййуҳа алмалао ма ааалимту лакум мин илаҳин ғайрий фаавқид лий йа ҳаману ааала аттийни файжааал лий сарҳан лааааллий атталиаау ила илаҳи муса вайнний лаасуннуҳу мина алкасибийна
                Вайстакбара ҳува важунудуҳу фий аларди биғайри алҳаққи васанну аннаҳум илайна ла йуржааауна
                Фаахаснаҳу важунудаҳу фанабаснаҳум фий алйамми фаонсур кайфа кана ааақибату ассалимийна
                Важаааалнаҳум аймматан йадаауна ила аннари вайаума алқийамати ла йунсаруна
                Ваатбааанаҳум фий ҳасиҳи аддунйа лааанатан вайаума алқийамати ҳум мина алмақбуҳийна
                Валақад атайна муса алкитаба мин бааади ма аҳлакна алқуруна алула басайра лилннаси ваҳудан вароҳматан лааааллааҳум йатасаккаруна
                Вама кунта бижаниби алғарбиййи ис қадайна ила муса аламра вама кунта мина ашшаҳидийна
                Валакинна аншана қурунан фататауала ааалайҳиму алааумуру вама кунта сауийан фий аҳли мадйана татлу ааалайҳим айатина валакинна кунна мурсилийна
                Вама кунта бижаниби аттури ис надайна валакин роҳматан мин роббика литунсира қауман ма атаҳум мин насийрин мин қаблика лааааллааҳум йатасаккаруна
                Валаула ан тусийбаҳум мусийбатун бима қаддамат айдийҳим файақулу роббана лаула арсалта илайна расулан фанаттабиааа айатика ванакуна мина алмуминийна
                Фаламма жааҳуму алҳаққу мин ааиндина қалу лаула утийа мисла ма утийа муса ауалам йакфуру бима утийа муса мин қаблу қалу сиҳрани тасаҳара вақалу инна бикуллин кафируна
                Қул фату бикитабин мин ааинди аллааҳи ҳува аҳда минҳума аттабиааҳу ин кунтум садиқийна
                Файн лам йастажийбу лака файаалам аннама йаттабиаауна аҳвааҳум ваман адаллу миммани иттабаааа ҳауаҳу биғайри ҳудан мина аллааҳи инна аллааҳа ла йаҳдий алқаума ассалимийна
                Валақад вассална лаҳуму алқаула лааааллааҳум йатасаккаруна
                Аллазийна атайнаҳуму алкитаба мин қаблиҳи ҳум биҳи йуминуна
                Вайса йутла ааалайҳим қалу аманна биҳи иннаҳу алҳаққу мин роббина инна кунна мин қаблиҳи муслимийна
                Олайка йутауна ажроҳум марратайни бима сабару вайадрауна биалҳасанати ассаййиата вамимма разақнаҳум йунфиқуна
                Вайса самиаау аллағва ааараду ааанҳу вақалу лана ааамалуна валакум ааамалукум саламун ааалайкум ла набтағий алжаҳилийна
                Иннака ла таҳдий ман аҳбабта валакинна аллааҳа йаҳдий ман йашао ваҳува аааламу биалмуҳтадийна
                Вақалу ин наттабиааи алҳуда маааака нутахаттаф мин ардина ауалам нумаккин лаҳум ҳараман аминан йужба илайҳи самарату кулли шайин ризқан мин ладунна валакинна аксароҳум ла йаааламуна
                Вакам аҳлакна мин қарйатин батират маааийшатаҳа фатилка масакинуҳум лам тускан мин бааадиҳим илла қалийлан вакунна наҳну алварисийна
                Вама кана роббука муҳлика алқура ҳатта йабаааса фий оммиҳа расулан йатлу ааалайҳим айатина вама кунна муҳликий алқура илла вааҳлуҳа салимуна
                Вама утийтум мин шайин фаматааау алҳайати аддунйа вазийнатуҳа вама ааинда аллааҳи хайрун ваабқа афала тааақилуна
                Афаман вааааднаҳу вааадан ҳасанан фаҳува лақийҳи каман маттааанаҳу матаааа алҳайати аддунйа сумма ҳува йаума алқийамати мина алмуҳдарийна
                Вайаума йунадийҳим файақулу айна шуракаййа аллазийна кунтум тазааумуна
                Қала аллазийна ҳаққа ааалайҳиму алқаулу роббана ҳаолай аллазийна ағвайна ағвайнаҳум кама ғауайна табаррана илайка ма кану иййана йааабудуна
                Вақийла одаау шуракаакум фадаааавҳум фалам йастажийбу лаҳум варааву алааасаба лау аннаҳум кану йаҳтадуна
                Вайаума йунадийҳим файақулу маса ажабтуму алмурсалийна
                Фаааамийат ааалайҳиму аланбао йаумайсин фаҳум ла йатасаалуна
                Фаамма ман таба ваамана ваааамила салиҳан фааааса ан йакуна мина алмуфлиҳийна
                Вароббука йахлуқу ма йашао вайахтару ма кана лаҳуму алхийарату субҳана аллааҳи ватаааала ааамма йушрикуна
                Вароббука йаааламу ма тукинну судуруҳум вама йуаалинуна
                Ваҳува аллааҳу ла илаҳа илла ҳува лаҳу алҳамду фий алула ваалахирати валаҳу алҳукму вайлайҳи туржааауна
                Қул араайтум ин жаааала аллааҳу ааалайкуму аллайла сармадан ила йауми алқийамати ман илаҳун ғайру аллааҳи йатийкум бидийайн афала тасмааауна
                Қул араайтум ин жаааала аллааҳу ааалайкуму аннаҳара сармадан ила йауми алқийамати ман илаҳун ғайру аллааҳи йатийкум билайлин таскунуна фийҳи афала тубсируна
                Вамин роҳматиҳи жаааала лакуму аллайла ваалннаҳара литаскуну фийҳи валитабтағу мин фадлиҳи валааааллакум ташкуруна
                Вайаума йунадийҳим файақулу айна шуракаййа аллазийна кунтум тазааумуна
                Ваназааана мин кулли омматин шаҳийдан фақулна ҳату бурҳанакум фаааалиму анна алҳаққа лиллаҳи вадалла ааанҳум ма кану йафтаруна
                Инна қаруна кана мин қауми муса фабаға ааалайҳим ваатайнаҳу мина алкунузи ма инна мафатиҳаҳу латануо биалааусбати олий алқуввати ис қала лаҳу қаумуҳу ла тафроҳ инна аллааҳа ла йуҳиббу алфариҳийна
                Вайбтағи фийма атака аллааҳу аддара алахирата вала танса насийбака мина аддунйа вааҳсин кама аҳсана аллааҳу илайка вала табғи алфасада фий аларди инна аллааҳа ла йуҳиббу алмуфсидийна
                Қала иннама утийтуҳу ааала ааилмин ааиндий ауалам йааалам анна аллааҳа қад аҳлака мин қаблиҳи мина алқуруни ман ҳува ашадду минҳу қувватан вааксару жамааан вала йусалу ааан сунубиҳиму алмужримуна
                Фахаража ааала қаумиҳи фий зийнатиҳи қала аллазийна йурийдуна алҳайата аддунйа йа лайта лана мисла ма утийа қаруну иннаҳу ласу ҳассин ааасиймин
                Вақала аллазийна уту алааилма вайлакум сауабу аллааҳи хайрун лиман амана ваааамила салиҳан вала йулаққаҳа илла ассабируна
                Фахасафна биҳи вабидариҳи аларда фама кана лаҳу мин фиатин йансурунаҳу мин дуни аллааҳи вама кана мина алмунтасирийна
                Ваасбаҳа аллазийна таманнау маканаҳу биаламси йақулуна вайкаанна аллааҳа йабсуту арризқа лиман йашао мин ааибадиҳи вайақдиру лаула ан манна аллааҳу ааалайна лахасафа бина вайкааннаҳу ла йуфлиҳу алкафируна
                Тилка аддару алахирату нажааалуҳа лиллазийна ла йурийдуна ааулувван фий аларди вала фасадан ваалааақибату лилмуттақийна
                Ман жаа биалҳасанати фалаҳу хайрун минҳа ваман жаа биалссаййиати фала йужза аллазийна ааамилу ассаййиати илла ма кану йааамалуна
                Инна аллазий фарада ааалайка алқурана лараддука ила маааадин қул роббий аааламу ман жаа биалҳуда ваман ҳува фий далалин мубийнин
                Вама кунта таржу ан йулқа илайка алкитабу илла роҳматан мин роббика фала такунанна саҳийран лилкафирийна
                Вала йасуддуннака ааан айати аллааҳи бааада ис онзилат илайка ваодаау ила роббика вала такунанна мина алмушрикийна
                Вала тадаау маааа аллааҳи илаҳан ахара ла илаҳа илла ҳува куллу шайин ҳаликун илла важҳаҳу лаҳу алҳукму вайлайҳи туржааауна
            """.trimIndent(),
        ),
        Surah(
            id = 29,
            arabicName = "العنكبوت",
            latinName = "Al-'Ankabut",
            transliteration = """
                Алифламмийм
                Аҳасиба аннасу ан йутраку ан йақулу аманна ваҳум ла йуфтануна
                Валақад фатанна аллазийна мин қаблиҳим фалайаааламанна аллааҳу аллазийна садақу валайаааламанна алкасибийна
                Ам ҳасиба аллазийна йааамалуна ассаййиати ан йасбиқуна саа ма йаҳкумуна
                Ман кана йаржу лиқаа аллааҳи файнна ажала аллааҳи лаатин ваҳува ассамийаау алааалийму
                Ваман жаҳада файннама йужаҳиду линафсиҳи инна аллааҳа лағаниййун ааани алаааламийна
                Вааллазийна аману ваааамилу ассалиҳати ланукаффиранна ааанҳум саййиатиҳим валанажзийаннаҳум аҳсана аллазий кану йааамалуна
                Вауассайна алинсана бивалидайҳи ҳуснан вайн жаҳадака литушрика бий ма лайса лака биҳи ааилмун фала тутиааҳума илаййа маржиааукум фаонаббиокум бима кунтум тааамалуна
                Вааллазийна аману ваааамилу ассалиҳати ланудхиланнаҳум фий ассалиҳийна
                Вамина аннаси ман йақулу аманна биаллааҳи файса усийа фий аллааҳи жаааала фитната аннаси каааасаби аллааҳи валайн жаа насрун мин роббика лайақулунна инна кунна маааакум ауалайса аллааҳу биааалама бима фий судури алаааламийна
                Валайаааламанна аллааҳу аллазийна аману валайаааламанна алмунафиқийна
                Вақала аллазийна кафару лиллазийна аману иттабиаау сабийлана валнаҳмил хатайакум вама ҳум биҳамилийна мин хатайаҳум мин шайин иннаҳум лакасибуна
                Валайаҳмилунна асқалаҳум ваасқалан маааа асқалиҳим валайусалунна йаума алқийамати ааамма кану йафтаруна
                Валақад арсална нуҳан ила қаумиҳи фалабиса фийҳим алфа санатин илла хамсийна аааман фаахасаҳуму аттуфану ваҳум салимуна
                Фаанжайнаҳу ваашаба ассафийнати важаааалнаҳа айатан лилаааламийна
                Вайброҳийма ис қала лиқаумиҳи оаабуду аллааҳа вайттақуҳу саликум хайрун лакум ин кунтум таааламуна
                Иннама тааабудуна мин дуни аллааҳи аусанан ватахлуқуна ифкан инна аллазийна тааабудуна мин дуни аллааҳи ла йамликуна лакум ризқан файбтағу ааинда аллааҳи арризқа ваоаабудуҳу ваошкуру лаҳу илайҳи туржааауна
                Вайн тукассибу фақад кассаба омамун мин қабликум вама ааала аррасули илла албалағу алмубийну
                Ауалам йарау кайфа йубдио аллааҳу алхалқа сумма йуааийдуҳу инна салика ааала аллааҳи йасийрун
                Қул сийру фий аларди фаонсуру кайфа бадаа алхалқа сумма аллааҳу йуншио аннашата алахирата инна аллааҳа ааала кулли шайин қадийрун
                Йуааассибу ман йашао вайарҳаму ман йашао вайлайҳи туқлабуна
                Вама антум бимуаажизийна фий аларди вала фий ассамай вама лакум мин дуни аллааҳи мин валиййин вала насийрин
                Вааллазийна кафару биайати аллааҳи валиқайҳи олайка йайсу мин роҳматий ваолайка лаҳум ааасабун алиймун
                Фама кана жауаба қаумиҳи илла ан қалу оқтулуҳу ау ҳарриқуҳу фаанжаҳу аллааҳу мина аннари инна фий салика лаайатин лиқаумин йуминуна
                Вақала иннама иттахастум мин дуни аллааҳи аусанан мауаддата байникум фий алҳайати аддунйа сумма йаума алқийамати йакфуру бааадукум бибааадин вайалааану бааадукум бааадан вамауакуму аннару вама лакум мин насирийна
                Фаамана лаҳу лутун вақала инний муҳажирун ила роббий иннаҳу ҳува алааазийзу алҳакийму
                Вауаҳабна лаҳу ишақа вайааақуба важаааална фий сурриййатиҳи аннубуввата ваалкитаба ваатайнаҳу ажроҳу фий аддунйа вайннаҳу фий алахирати ламина ассалиҳийна
                Валутан ис қала лиқаумиҳи иннакум лататуна алфаҳишата ма сабақакум биҳа мин аҳадин мина алаааламийна
                Айннакум лататуна аррижала ватақтааауна ассабийла вататуна фий надийкуму алмункара фама кана жауаба қаумиҳи илла ан қалу итина биааасаби аллааҳи ин кунта мина ассадиқийна
                Қала робби онсурний ааала алқауми алмуфсидийна
                Валамма жаат русулуна иброҳийма биалбушра қалу инна муҳлику аҳли ҳасиҳи алқарйати инна аҳлаҳа кану салимийна
                Қала инна фийҳа лутан қалу наҳну аааламу биман фийҳа ланунажжийаннаҳу вааҳлаҳу илла имраатаҳу канат мина алғабирийна
                Валамма ан жаат русулуна лутан сийа биҳим вадақа биҳим сарааан вақалу ла тахаф вала таҳзан инна мунажжука вааҳлака илла имраатака канат мина алғабирийна
                Инна мунзилуна ааала аҳли ҳасиҳи алқарйати рижзан мина ассамай бима кану йафсуқуна
                Валақад таракна минҳа айатан баййинатан лиқаумин йааақилуна
                Вайла мадйана ахаҳум шуааайбан фақала йа қауми оаабуду аллааҳа ваоржу алйаума алахира вала тааасау фий аларди муфсидийна
                Факассабуҳу фаахасасуму арражфату фаасбаҳу фий дариҳим жасимийна
                Ваааадан васамуда вақад табаййана лакум мин масакиниҳим вазаййана лаҳуму ашшайтану ааамалаҳум фасаддаҳум ааани ассабийли вакану мустабсирийна
                Вақаруна вафирааауна ваҳамана валақад жааҳум муса биалбаййинати файстакбару фий аларди вама кану сабиқийна
                Факуллан ахасна бисанбиҳи фаминҳум ман арсална ааалайҳи ҳасибан ваминҳум ман ахасасу ассайҳату ваминҳум ман хасафна биҳи аларда ваминҳум ман ағрақна вама кана аллааҳу лийаслимаҳум валакин кану анфусаҳум йаслимуна
                Масалу аллазийна иттахасу мин дуни аллааҳи аулийаа камасали алааанкабути иттахасат байтан вайнна ауҳана албуйути лабайту алааанкабути лау кану йаааламуна
                Инна аллааҳа йаааламу ма йадаауна мин дуниҳи мин шайин ваҳува алааазийзу алҳакийму
                Ватилка аламсалу надрибуҳа лилннаси вама йааақилуҳа илла алааалимуна
                Халақа аллааҳу ассамауати вааларда биалҳаққи инна фий салика лаайатан лилмуминийна
                Отлу ма уҳийа илайка мина алкитаби ваақими ассалата инна ассалата танҳа ааани алфаҳшай ваалмункари валасикру аллааҳи акбару вааллааҳу йаааламу ма таснааауна
                Вала тужадилу аҳла алкитаби илла биаллатий ҳийа аҳсану илла аллазийна саламу минҳум вақулу аманна биаллазий онзила илайна ваонзила илайкум вайлаҳуна вайлаҳукум ваҳидун ванаҳну лаҳу муслимуна
                Вакасалика анзална илайка алкитаба фааллазийна атайнаҳуму алкитаба йуминуна биҳи вамин ҳаолай ман йумину биҳи вама йажҳаду биайатина илла алкафируна
                Вама кунта татлу мин қаблиҳи мин китабин вала тахуттуҳу бийамийника исан лайртаба алмубтилуна
                Бал ҳува айатун баййинатун фий судури аллазийна уту алааилма вама йажҳаду биайатина илла ассалимуна
                Вақалу лаула онзила ааалайҳи айатун мин роббиҳи қул иннама алайату ааинда аллааҳи вайннама ана насийрун мубийнун
                Ауалам йакфиҳим анна анзална ааалайка алкитаба йутла ааалайҳим инна фий салика лароҳматан васикра лиқаумин йуминуна
                Қул кафа биаллааҳи байний вабайнакум шаҳийдан йаааламу ма фий ассамауати вааларди вааллазийна аману биалбатили вакафару биаллааҳи олайка ҳуму алхасируна
                Вайастааажилунака биалааасаби валаула ажалун мусамман лажааҳуму алааасабу валайатийаннаҳум бағтатан ваҳум ла йашаауруна
                Йастааажилунака биалааасаби вайнна жаҳаннама ламуҳийтатун биалкафирийна
                Йаума йағшаҳуму алааасабу мин фауқиҳим вамин таҳти аржулиҳим вайақулу суқу ма кунтум тааамалуна
                Йа ааибадийа аллазийна аману инна ардий васиааатун файййайа фаоаабудуни
                Куллу нафсин сайқату алмаути сумма илайна туржааауна
                Вааллазийна аману ваааамилу ассалиҳати ланубаувианнаҳум мина алжаннати ғурафан тажрий мин таҳтиҳа аланҳару халидийна фийҳа ниаама ажру алааамилийна
                Аллазийна сабару ваааала роббиҳим йатауаккалуна
                Вакааййин мин даббатин ла таҳмилу ризқаҳа аллааҳу йарзуқуҳа вайййакум ваҳува ассамийаау алааалийму
                Валайн саалтаҳум ман халақа ассамауати вааларда васаххара ашшамса ваалқамара лайақулунна аллааҳу фаанна йуфакуна
                Аллааҳу йабсуту арризқа лиман йашао мин ааибадиҳи вайақдиру лаҳу инна аллааҳа бикулли шайин ааалиймун
                Валайн саалтаҳум ман наззала мина ассамай маан фааҳйа биҳи аларда мин бааади маутиҳа лайақулунна аллааҳу қули алҳамду лиллаҳи бал аксаруҳум ла йааақилуна
                Вама ҳасиҳи алҳайату аддунйа илла лаҳвун валааайбун вайнна аддара алахирата лаҳийа алҳайауану лау кану йаааламуна
                Файса ракибу фий алфулки дааааву аллааҳа мухлисийна лаҳу аддийна фаламма нажжаҳум ила албарри иса ҳум йушрикуна
                Лийакфуру бима атайнаҳум валийатаматтааау фасауфа йаааламуна
                Ауалам йарау анна жаааална ҳараман аминан вайутахаттафу аннасу мин ҳаулиҳим афабиалбатили йуминуна вабиниаамати аллааҳи йакфуруна
                Ваман асламу миммани ифтара ааала аллааҳи касибан ау кассаба биалҳаққи ламма жааҳу алайса фий жаҳаннама масван лилкафирийна
                Вааллазийна жаҳаду фийна ланаҳдийаннаҳум субулана вайнна аллааҳа ламаааа алмуҳсинийна
            """.trimIndent(),
        ),
        Surah(
            id = 30,
            arabicName = "الروم",
            latinName = "Ar-Rum",
            transliteration = """
                Алифламмийм
                Ғулибати арруму
                Фий адна аларди ваҳум мин бааади ғалабиҳим сайағлибуна
                Фий бидааи синийна лиллаҳи аламру мин қаблу вамин баааду вайаумайсин йафроҳу алмуминуна
                Бинасри аллааҳи йансуру ман йашао ваҳува алааазийзу арроҳийму
                Вааада аллааҳи ла йухлифу аллааҳу вааадаҳу валакинна аксара аннаси ла йаааламуна
                Йаааламуна саҳиран мина алҳайати аддунйа ваҳум ааани алахирати ҳум ғафилуна
                Ауалам йатафаккару фий анфусиҳим ма халақа аллааҳу ассамауати вааларда вама байнаҳума илла биалҳаққи ваажалин мусамман вайнна касийран мина аннаси билиқай роббиҳим лакафируна
                Ауалам йасийру фий аларди файансуру кайфа кана ааақибату аллазийна мин қаблиҳим кану ашадда минҳум қувватан ваасару аларда ваааамаруҳа аксара мимма ааамаруҳа важаасум русулуҳум биалбаййинати фама кана аллааҳу лийаслимаҳум валакин кану анфусаҳум йаслимуна
                Сумма кана ааақибата аллазийна асау ассуа ан кассабу биайати аллааҳи вакану биҳа йастаҳзиуна
                Аллааҳу йабдао алхалқа сумма йуааийдуҳу сумма илайҳи туржааауна
                Вайаума тақуму ассаааату йублису алмужримуна
                Валам йакун лаҳум мин шуракайҳим шуфаааао вакану бишуракайҳим кафирийна
                Вайаума тақуму ассаааату йаумайсин йатафаррақуна
                Фаамма аллазийна аману ваааамилу ассалиҳати фаҳум фий раудатин йуҳбаруна
                Ваамма аллазийна кафару вакассабу биайатина валиқай алахирати фаолайка фий алааасаби муҳдаруна
                Фасубҳана аллааҳи ҳийна тумсуна ваҳийна тусбиҳуна
                Валаҳу алҳамду фий ассамауати вааларди ваааашиййан ваҳийна тусҳируна
                Йухрижу алҳаййа мина алмаййити вайухрижу алмаййита мина алҳаййи вайуҳйий аларда бааада маутиҳа вакасалика тухражуна
                Вамин айатиҳи ан халақакум мин туробин сумма иса антум башарун танташируна
                Вамин айатиҳи ан халақа лакум мин анфусикум азважан литаскуну илайҳа важаааала байнакум мауаддатан вароҳматан инна фий салика лаайатин лиқаумин йатафаккаруна
                Вамин айатиҳи халқу ассамауати вааларди вайхтилафу алсинатикум ваалваникум инна фий салика лаайатин лилааалимийна
                Вамин айатиҳи манамукум биаллайли ваалннаҳари вайбтиғаокум мин фадлиҳи инна фий салика лаайатин лиқаумин йасмааауна
                Вамин айатиҳи йурийкуму албарқа хауфан ватамаааан вайуназзилу мина ассамай маан файуҳйий биҳи аларда бааада маутиҳа инна фий салика лаайатин лиқаумин йааақилуна
                Вамин айатиҳи ан тақума ассамао вааларду биамриҳи сумма иса даааакум дааауатан мина аларди иса антум тахружуна
                Валаҳу ман фий ассамауати вааларди куллун лаҳу қанитуна
                Ваҳува аллазий йабдао алхалқа сумма йуааийдуҳу ваҳува аҳвану ааалайҳи валаҳу алмасалу алааала фий ассамауати вааларди ваҳува алааазийзу алҳакийму
                Дароба лакум масалан мин анфусикум ҳал лакум ми мма малакат айманукум мин шуракаа фий ма разақнакум фаантум фийҳи сауаон тахафунаҳум кахийфатикум анфусакум касалика нуфассилу алайати лиқаумин йааақилуна
                Бали иттабаааа аллазийна саламу аҳвааҳум биғайри ааилмин фаман йаҳдий ман адалла аллааҳу вама лаҳум мин насирийна
                Фаақим важҳака лилддийни ҳанийфан фитрата аллааҳи аллатий фатара аннаса ааалайҳа ла табдийла лихалқи аллааҳи салика аддийну алқаййиму валакинна аксара аннаси ла йаааламуна
                Мунийбийна илайҳи вайттақуҳу ваақийму ассалата вала такуну мина алмушрикийна
                Мина аллазийна фаррақу дийнаҳум вакану шийаааан куллу ҳизбин бима ладайҳим фариҳуна
                Вайса масса аннаса дуррун даааав роббаҳум мунийбийна илайҳи сумма иса асақаҳум минҳу роҳматан иса фарийқун минҳум бироббиҳим йушрикуна
                Лийакфуру бима атайнаҳум фатаматтааау фасауфа таааламуна
                Ам анзална ааалайҳим султанан фаҳува йатакалламу бима кану биҳи йушрикуна
                Вайса асақна аннаса роҳматан фариҳу биҳа вайн тусибҳум саййиатун бима қаддамат айдийҳим иса ҳум йақнатуна
                Ауалам йарау анна аллааҳа йабсуту арризқа лиман йашао вайақдиру инна фий салика лаайатин лиқаумин йуминуна
                Фаати са алқурба ҳаққаҳу ваалмискийна вайбна ассабийли салика хайрун лиллазийна йурийдуна важҳа аллааҳи ваолайка ҳуму алмуфлиҳуна
                Вама атайтум мин рибан лийарбува фий амвали аннаси фала йарбу ааинда аллааҳи вама атайтум мин закатин турийдуна важҳа аллааҳи фаолайка ҳуму алмудааифуна
                Аллааҳу аллазий халақакум сумма разақакум сумма йумийтукум сумма йуҳйийкум ҳал мин шуракайкум ман йафааалу мин саликум мин шайин субҳанаҳу ватаааала ааамма йушрикуна
                Саҳара алфасаду фий албарри ваалбаҳри бима касабат айдий аннаси лийусийқаҳум бааада аллазий ааамилу лааааллааҳум йаржиаауна
                Қул сийру фий аларди фаонсуру кайфа кана ааақибату аллазийна мин қаблу кана аксаруҳум мушрикийна
                Фаақим важҳака лилддийни алқаййими мин қабли ан йатийа йаумун ла марадда лаҳу мина аллааҳи йаумайсин йассаддааауна
                Ман кафара фаааалайҳи куфруҳу ваман ааамила салиҳан фалианфусиҳим йамҳадуна
                Лийажзийа аллазийна аману ваааамилу ассалиҳати мин фадлиҳи иннаҳу ла йуҳиббу алкафирийна
                Вамин айатиҳи ан йурсила аррийаҳа мубашширатин валийусийқакум мин роҳматиҳи валитажрийа алфулку биамриҳи валитабтағу мин фадлиҳи валааааллакум ташкуруна
                Валақад арсална мин қаблика русулан ила қаумиҳим фажауҳум биалбаййинати файнтақамна мина аллазийна ажраму вакана ҳаққан ааалайна насру алмуминийна
                Аллааҳу аллазий йурсилу аррийаҳа фатусийру саҳабан файабсутуҳу фий ассамай кайфа йашао вайажааалуҳу кисафан фатара алвадқа йахружу мин хилалиҳи файса асаба биҳи ман йашао мин ааибадиҳи иса ҳум йастабшируна
                Вайн кану мин қабли ан йуназзала ааалайҳим мин қаблиҳи ламублисийна
                Фаонсур ила асари роҳмати аллааҳи кайфа йуҳйий аларда бааада маутиҳа инна салика ламуҳйий алмаута ваҳува ааала кулли шайин қадийрун
                Валайн арсална рийҳан фараавҳу мусфарран ласаллу мин бааадиҳи йакфуруна
                Файннака ла тусмиаау алмаута вала тусмиаау ассумма аддуаааа иса валлау мудбирийна
                Вама анта биҳади алааумйи ааан далалатиҳим ин тусмиаау илла ман йумину биайатина фаҳум муслимуна
                Аллааҳу аллазий халақакум мин дааафин сумма жаааала мин бааади дааафин қувватан сумма жаааала мин бааади қувватин дааафан вашайбатан йахлуқу ма йашао ваҳува алааалийму алқадийру
                Вайаума тақуму ассаааату йуқсиму алмужримуна ма лабису ғайра саааатин касалика кану йуфакуна
                Вақала аллазийна уту алааилма ваалиймана лақад лабистум фий китаби аллааҳи ила йауми албаааси фаҳаса йауму албаааси валакиннакум кунтум ла таааламуна
                Файаумайсин ла йанфааау аллазийна саламу мааасиратуҳум вала ҳум йустааатабуна
                Валақад даробна лилннаси фий ҳаса алқурани мин кулли масалин валайн житаҳум биайатин лайақуланна аллазийна кафару ин антум илла мубтилуна
                Касалика йатбааау аллааҳу ааала қулуби аллазийна ла йаааламуна
                Файсбир инна вааада аллааҳи ҳаққун вала йастахиффаннака аллазийна ла йуқинуна
            """.trimIndent(),
        ),
        Surah(
            id = 31,
            arabicName = "لقمان",
            latinName = "Luqman",
            transliteration = """
                Алифламмийм
                Тилка айату алкитаби алҳакийми
                Ҳудан вароҳматан лилмуҳсинийна
                Аллазийна йуқиймуна ассалата вайутуна аззаката ваҳум биалахирати ҳум йуқинуна
                Олайка ааала ҳудан мин роббиҳим ваолайка ҳуму алмуфлиҳуна
                Вамина аннаси ман йаштарий лаҳва алҳадийси лийудилла ааан сабийли аллааҳи биғайри ааилмин вайаттахисаҳа ҳузуван олайка лаҳум ааасабун муҳийнун
                Вайса тутла ааалайҳи айатуна валла мустакбиран каан лам йасмаааҳа каанна фий осунайҳи вақран фабашширҳу биааасабин алиймин
                Инна аллазийна аману ваааамилу ассалиҳати лаҳум жаннату аннаааийми
                Халидийна фийҳа вааада аллааҳи ҳаққан ваҳува алааазийзу алҳакийму
                Халақа ассамауати биғайри ааамадин тараунаҳа ваалқа фий аларди рауасийа ан тамийда бикум вабасса фийҳа мин кулли даббатин ваанзална мина ассамай маан фаанбатна фийҳа мин кулли заужин кариймин
                Ҳаса халқу аллааҳи фааруний маса халақа аллазийна мин дуниҳи бали ассалимуна фий далалин мубийнин
                Валақад атайна луқмана алҳикмата ани ошкур лиллаҳи ваман йашкур файннама йашкуру линафсиҳи ваман кафара файнна аллааҳа ғаниййун ҳамийдун
                Вайс қала луқману лийбниҳи ваҳува йааайсуҳу йа бунаййа ла тушрик биаллааҳи инна ашширка ласулмун ааасиймун
                Вауассайна алинсана бивалидайҳи ҳамаласу оммуҳу ваҳнан ааала ваҳнин вафисалуҳу фий ааамайни ани ошкур лий валивалидайка илаййа алмасийру
                Вайн жаҳадака ааала ан тушрика бий ма лайса лака биҳи ааилмун фала тутиааҳума васаҳибҳума фий аддунйа маааруфан вайттабиаа сабийла ман анаба илаййа сумма илаййа маржиааукум фаонаббиокум бима кунтум тааамалуна
                Йа бунаййа иннаҳа ин таку мисқала ҳаббатин мин хардалин фатакун фий сахратин ау фий ассамауати ау фий аларди йати биҳа аллааҳу инна аллааҳа латийфун хабийрун
                Йа бунаййа ақими ассалата вамур биалмаааруфи вайнҳа ааани алмункари вайсбир ааала ма асабака инна салика мин ааазми аломури
                Вала тусааааайр хаддака лилннаси вала тамши фий аларди мароҳан инна аллааҳа ла йуҳиббу кулла мухталин фахурин
                Вайқсид фий машйика ваоғдуд мин саутика инна анкара аласвати ласауту алҳамийри
                Алам тарау анна аллааҳа саххара лакум ма фий ассамауати вама фий аларди ваасбаға ааалайкум ниааамаҳу саҳиратан вабатинатан вамина аннаси ман йужадилу фий аллааҳи биғайри ааилмин вала ҳудан вала китабин мунийрин
                Вайса қийла лаҳуму иттабиаау ма анзала аллааҳу қалу бал наттабиаау ма важадна ааалайҳи абаана ауалау кана ашшайтану йадаауҳум ила ааасаби ассаааийри
                Ваман йуслим важҳаҳу ила аллааҳи ваҳува муҳсинун фақади истамсака биалааурвати алвусқа вайла аллааҳи ааақибату аломури
                Ваман кафара фала йаҳзунка куфруҳу илайна маржиаауҳум фанунаббиоҳум бима ааамилу инна аллааҳа ааалиймун бисати ассудури
                Нуматтиаауҳум қалийлан сумма надтарруҳум ила ааасабин ғалийсин
                Валайн саалтаҳум ман халақа ассамауати вааларда лайақулунна аллааҳу қули алҳамду лиллаҳи бал аксаруҳум ла йаааламуна
                Лиллаҳи ма фий ассамауати вааларди инна аллааҳа ҳува алғаниййу алҳамийду
                Валау аннама фий аларди мин шажаратин ақламун ваалбаҳру йамуддуҳу мин бааадиҳи сабааату абҳурин ма нафидат калимату аллааҳи инна аллааҳа ааазийзун ҳакиймун
                Ма халқукум вала бааасукум илла канафсин ваҳидатин инна аллааҳа самийааун басийрун
                Алам тара анна аллааҳа йулижу аллайла фий аннаҳари вайулижу аннаҳара фий аллайли васаххара ашшамса ваалқамара куллун йажрий ила ажалин мусамман ваанна аллааҳа бима тааамалуна хабийрун
                Салика бианна аллааҳа ҳува алҳаққу ваанна ма йадаауна мин дуниҳи албатилу ваанна аллааҳа ҳува алааалиййу алкабийру
                Алам тара анна алфулка тажрий фий албаҳри биниаамати аллааҳи лийурийакум мин айатиҳи инна фий салика лаайатин ликулли саббарин шакурин
                Вайса ғашийаҳум маужун каалссулали дааааву аллааҳа мухлисийна лаҳу аддийна фаламма нажжаҳум ила албарри фаминҳум муқтасидун вама йажҳаду биайатина илла куллу хаттарин кафурин
                Йа аййуҳа аннасу иттақу роббакум вайхшау йауман ла йажзий валидун ааан валадиҳи вала маулудун ҳува жазин ааан валидиҳи шайан инна вааада аллааҳи ҳаққун фала тағурраннакуму алҳайату аддунйа вала йағурраннакум биаллааҳи алғаруру
                Инна аллааҳа ааиндаҳу ааилму ассаааати вайуназзилу алғайса вайаааламу ма фий аларҳами вама тадрий нафсун маса таксибу ғадан вама тадрий нафсун биаййи ардин тамуту инна аллааҳа ааалиймун хабийрун
            """.trimIndent(),
        ),
        Surah(
            id = 32,
            arabicName = "السجدة",
            latinName = "As-Sajdah",
            transliteration = """
                Алифламмийм
                Танзийлу алкитаби ла райба фийҳи мин робби алаааламийна
                Ам йақулуна ифтароҳу бал ҳува алҳаққу мин роббика литунсира қауман ма атаҳум мин насийрин мин қаблика лааааллааҳум йаҳтадуна
                Аллааҳу аллазий халақа ассамауати вааларда вама байнаҳума фий ситтати аййамин сумма истауа ааала алааарши ма лакум мин дуниҳи мин валиййин вала шафийааин афала татасаккаруна
                Йудаббиру аламра мина ассамай ила аларди сумма йаааружу илайҳи фий йаумин кана миқдаруҳу алфа санатин мимма тааауддуна
                Салика ааалиму алғайби ваалшшаҳадати алааазийзу арроҳийму
                Аллазий аҳсана кулла шайин халақаҳу вабадаа халқа алинсани мин тийнин
                Сумма жаааала наслаҳу мин сулалатин мин майн маҳийнин
                Сумма сауваҳу ванафаха фийҳи мин руҳиҳи важаааала лакуму ассамааа ваалабсара ваалафидата қалийлан ма ташкуруна
                Вақалу айса далална фий аларди айнна лафий халқин жадийдин бал ҳум билиқай роббиҳим кафируна
                Қул йатауаффакум малаку алмаути аллазий вуккила бикум сумма ила роббикум туржааауна
                Валау тара иси алмужримуна накису руусиҳим ааинда роббиҳим роббана абсарна васамиаана фааржиаана нааамал салиҳан инна муқинуна
                Валау шина лаатайна кулла нафсин ҳудаҳа валакин ҳаққа алқаулу минний лаамлаанна жаҳаннама мина алжиннати ваалннаси ажмаааийна
                Фасуқу бима насийтум лиқаа йаумикум ҳаса инна насийнакум васуқу ааасаба алхулди бима кунтум тааамалуна
                Иннама йумину биайатина аллазийна иса суккиру биҳа харру сужжадан васаббаҳу биҳамди роббиҳим ваҳум ла йастакбируна
                Татажафа жунубуҳум ааани алмадажиааи йадаауна роббаҳум хауфан ватамаааан вамимма разақнаҳум йунфиқуна
                Фала таааламу нафсун ма охфийа лаҳум мин қуррати ааайунин жазаан бима кану йааамалуна
                Афаман кана муминан каман кана фасиқан ла йастаууна
                Амма аллазийна аману ваааамилу ассалиҳати фалаҳум жаннату алмауа нузулан бима кану йааамалуна
                Ваамма аллазийна фасақу фамауаҳуму аннару куллама араду ан йахружу минҳа оааийду фийҳа вақийла лаҳум суқу ааасаба аннари аллазий кунтум биҳи тукассибуна
                Валанусийқаннаҳум мина алааасаби аладна дуна алааасаби алакбари лааааллааҳум йаржиаауна
                Ваман асламу мимман суккира биайати роббиҳи сумма ааарада ааанҳа инна мина алмужримийна мунтақимуна
                Валақад атайна муса алкитаба фала такун фий мирйатин мин лиқайҳи важаааалнаҳу ҳудан либаний исраийла
                Важаааална минҳум аймматан йаҳдуна биамрина ламма сабару вакану биайатина йуқинуна
                Инна роббака ҳува йафсилу байнаҳум йаума алқийамати фийма кану фийҳи йахталифуна
                Ауалам йаҳди лаҳум кам аҳлакна мин қаблиҳим мина алқуруни йамшуна фий масакиниҳим инна фий салика лаайатин афала йасмааауна
                Ауалам йарау анна насуқу алмаа ила аларди алжурузи фанухрижу биҳи зарааан такулу минҳу анааамуҳум ваанфусуҳум афала йубсируна
                Вайақулуна мата ҳаса алфасу ин кунтум садиқийна
                Қул йаума алфаси ла йанфааау аллазийна кафару иймануҳум вала ҳум йунсаруна
                Фаааарид ааанҳум вайнтасир иннаҳум мунтасируна
            """.trimIndent(),
        ),
        Surah(
            id = 33,
            arabicName = "الأحزاب",
            latinName = "Al-Ahzab",
            transliteration = """
                Йа аййуҳа аннабиййу иттақи аллааҳа вала тутиааи алкафирийна ваалмунафиқийна инна аллааҳа кана ааалийман ҳакийман
                Вайттабиаа ма йуҳа илайка мин роббика инна аллааҳа кана бима тааамалуна хабийран
                Ватауаккал ааала аллааҳи вакафа биаллааҳи вакийлан
                Ма жаааала аллааҳу лиражулин мин қалбайни фий жауфиҳи вама жаааала азважакуму аллаий тусаҳируна минҳунна оммаҳатикум вама жаааала адааийаакум абнаакум саликум қаулукум биафваҳикум вааллааҳу йақулу алҳаққа ваҳува йаҳдий ассабийла
                Одаауҳум лиабайҳим ҳува ақсату ааинда аллааҳи файн лам таааламу абааҳум файхванукум фий аддийни вамауалийкум валайса ааалайкум жунаҳун фийма ахтатум биҳи валакин ма тааааммадат қулубукум вакана аллааҳу ғафуран роҳийман
                Аннабиййу аула биалмуминийна мин анфусиҳим ваазважуҳу оммаҳатуҳум ваолу аларҳами бааадуҳум аула бибааадин фий китаби аллааҳи мина алмуминийна ваалмуҳажирийна илла ан тафааалу ила аулийайкум маааруфан кана салика фий алкитаби мастуран
                Вайс ахасна мина аннабиййийна мийсақаҳум ваминка вамин нуҳин вайброҳийма вамуса ваааийса ибни марйама ваахасна минҳум мийсақан ғалийсан
                Лийасала ассадиқийна ааан сидқиҳим вааааадда лилкафирийна ааасабан алийман
                Йа аййуҳа аллазийна аману оскуру ниаамата аллааҳи ааалайкум ис жааткум жунудун фаарсална ааалайҳим рийҳан важунудан лам тарауҳа вакана аллааҳу бима тааамалуна басийран
                Ис жаукум мин фауқикум вамин асфала минкум вайс зағати алабсару вабалағати алқулубу алҳанажира ватасуннуна биаллааҳи ассунуна
                Ҳуналика ибтулийа алмуминуна вазулзилу зилзалан шадийдан
                Вайс йақулу алмунафиқуна вааллазийна фий қулубиҳим марадун ма ваааадана аллааҳу варасулуҳу илла ғуруран
                Вайс қалат тайфатун минҳум йа аҳла йасриба ла муқама лакум файржиаау вайастасину фарийқун минҳуму аннабиййа йақулуна инна буйутана ааауратун вама ҳийа биааауратин ин йурийдуна илла фираран
                Валау духилат ааалайҳим мин ақтариҳа сумма суилу алфитната лаатауҳа вама талаббасу биҳа илла йасийран
                Валақад кану аааҳаду аллааҳа мин қаблу ла йуваллуна аладбара вакана аааҳду аллааҳи масулан
                Қул лан йанфаааакуму алфирару ин фарартум мина алмаути ауи алқатли вайсан ла туматтааауна илла қалийлан
                Қул ман са аллазий йааасимукум мина аллааҳи ин арада бикум суан ау арада бикум роҳматан вала йажидуна лаҳум мин дуни аллааҳи валиййан вала насийран
                Қад йаааламу аллааҳу алмуаааувиқийна минкум ваалқайлийна лийхваниҳим ҳалумма илайна вала йатуна албаса илла қалийлан
                Ашиҳҳатан ааалайкум файса жаа алхауфу раайтаҳум йансуруна илайка тадуру ааайунуҳум кааллазий йуғша ааалайҳи мина алмаути файса саҳаба алхауфу салақукум биалсинатин ҳидадин ашиҳҳатан ааала алхайри олайка лам йумину фааҳбата аллааҳу ааамалаҳум вакана салика ааала аллааҳи йасийран
                Йаҳсабуна алаҳзаба лам йасҳабу вайн йати алаҳзабу йауадду лау аннаҳум бадуна фий алааароби йасалуна ааан анбайкум валау кану фийкум ма қаталу илла қалийлан
                Лақад кана лакум фий расули аллааҳи осватун ҳасанатун лиман кана йаржу аллааҳа ваалйаума алахира васакара аллааҳа касийран
                Валамма раа алмуминуна алаҳзаба қалу ҳаса ма ваааадана аллааҳу варасулуҳу васадақа аллааҳу варасулуҳу вама задаҳум илла ийманан ватаслийман
                Мина алмуминийна рижалун садақу ма аааҳаду аллааҳа ааалайҳи фаминҳум ман қада наҳбаҳу ваминҳум ман йантасиру вама баддалу табдийлан
                Лийажзийа аллааҳу ассадиқийна бисидқиҳим вайуааассиба алмунафиқийна ин шаа ау йатуба ааалайҳим инна аллааҳа кана ғафуран роҳийман
                Варадда аллааҳу аллазийна кафару биғайсиҳим лам йаналу хайран вакафа аллааҳу алмуминийна алқитала вакана аллааҳу қауиййан ааазийзан
                Ваанзала аллазийна саҳаруҳум мин аҳли алкитаби мин сайасийҳим вақасафа фий қулубиҳиму арруааба фарийқан тақтулуна ватасируна фарийқан
                Вааврасакум ардаҳум вадийароҳум ваамвалаҳум ваардан лам татауҳа вакана аллааҳу ааала кулли шайин қадийран
                Йа аййуҳа аннабиййу қул лиазважика ин кунтунна туридна алҳайата аддунйа вазийнатаҳа фатаааалайна оматтиаакунна ваосарриҳкунна сароҳан жамийлан
                Вайн кунтунна туридна аллааҳа варасулаҳу ваалддара алахирата файнна аллааҳа аааадда лилмуҳсинати минкунна ажран ааасийман
                Йа нисаа аннабиййи ман йати минкунна бифаҳишатин мубаййинатин йудааааф лаҳа алааасабу диаафайни вакана салика ааала аллааҳи йасийран
                Ваман йақнут минкунна лиллаҳи варасулиҳи ватааамал салиҳан нутиҳа ажроҳа марратайни ваааатадна лаҳа ризқан карийман
                Йа нисаа аннабиййи ластунна кааҳадин мина аннисай ини иттақайтунна фала тахдааана биалқаули файатмаааа аллазий фий қалбиҳи марадун вақулна қаулан маааруфан
                Вақарна фий буйутикунна вала табарражна табарружа алжаҳилиййати алула ваақимна ассалата ваатийна аззаката ваатиаана аллааҳа варасулаҳу иннама йурийду аллааҳу лийусҳиба ааанкуму аррижса аҳла албайти вайутаҳҳиракум тасийран
                Ваоскурна ма йутла фий буйутикунна мин айати аллааҳи ваалҳикмати инна аллааҳа кана латийфан хабийран
                Инна алмуслимийна ваалмуслимати ваалмуминийна ваалмуминати ваалқанитийна ваалқанитати ваалссадиқийна ваалссадиқати ваалссабирийна ваалссабирати ваалхашиааийна ваалхашиааати ваалмутасаддиқийна ваалмутасаддиқати ваалссаймийна ваалссаймати ваалҳафисийна фуружаҳум ваалҳафисати ваалссакирийна аллааҳа касийран ваалссакирати аааадда аллааҳу лаҳум мағфиратан ваажран ааасийман
                Вама кана лимуминин вала муминатин иса қада аллааҳу варасулуҳу амран ан йакуна лаҳуму алхийарату мин амриҳим ваман йаааси аллааҳа варасулаҳу фақад далла далалан мубийнан
                Вайс тақулу лиллазий анааама аллааҳу ааалайҳи ваанааамта ааалайҳи амсик ааалайка заужака вайттақи аллааҳа ватухфий фий нафсика ма аллааҳу мубдийҳи ватахша аннаса вааллааҳу аҳаққу ан тахшаҳу фаламма қада зайдун минҳа ватаран зауважнакаҳа ликай ла йакуна ааала алмуминийна ҳаражун фий азважи адааийайҳим иса қадау минҳунна ватаран вакана амру аллааҳи мафааулан
                Ма кана ааала аннабиййи мин ҳаражин фийма фарада аллааҳу лаҳу сунната аллааҳи фий аллазийна халау мин қаблу вакана амру аллааҳи қадаран мақдуран
                Аллазийна йубаллиғуна рисалати аллааҳи вайахшаунаҳу вала йахшауна аҳадан илла аллааҳа вакафа биаллааҳи ҳасийбан
                Ма кана муҳаммадун аба аҳадин мин рижаликум валакин расула аллааҳи вахатама аннабиййийна вакана аллааҳу бикулли шайин ааалийман
                Йа аййуҳа аллазийна аману оскуру аллааҳа сикран касийран
                Васаббиҳуҳу букратан ваасийлан
                Ҳува аллазий йусаллий ааалайкум вамалайкатуҳу лийухрижакум мина ассулумати ила аннури вакана биалмуминийна роҳийман
                Таҳиййатуҳум йаума йалқаунаҳу саламун вааааадда лаҳум ажран карийман
                Йа аййуҳа аннабиййу инна арсалнака шаҳидан вамубашширан ванасийран
                Вадаааййан ила аллааҳи бийсниҳи васиражан мунийран
                Вабашшири алмуминийна бианна лаҳум мина аллааҳи фадлан кабийран
                Вала тутиааи алкафирийна ваалмунафиқийна вадааа асаҳум ватауаккал ааала аллааҳи вакафа биаллааҳи вакийлан
                Йа аййуҳа аллазийна аману иса накаҳтуму алмуминати сумма таллақтумуҳунна мин қабли ан тамассуҳунна фама лакум ааалайҳинна мин ааиддатин тааатаддунаҳа фаматтиаауҳунна васарриҳуҳунна сароҳан жамийлан
                Йа аййуҳа аннабиййу инна аҳлална лака азважака аллатий атайта ожуроҳунна вама малакат йамийнука мимма афаа аллааҳу ааалайка вабанати аааммика вабанати ааамматика вабанати халика вабанати халатика аллатий ҳажарна маааака ваймраатан муминатан ин ваҳабат нафсаҳа лилннабиййи ин арада аннабиййу ан йастанкиҳаҳа халисатан лака мин дуни алмуминийна қад ааалимна ма фарадна ааалайҳим фий азважиҳим вама малакат аймануҳум ликайла йакуна ааалайка ҳаражун вакана аллааҳу ғафуран роҳийман
                Туржий ман ташао минҳунна ватувий илайка ман ташао вамани ибтағайта мимман ааазалта фала жунаҳа ааалайка салика адна ан тақарра ааайунуҳунна вала йаҳзанна вайардайна бима атайтаҳунна куллуҳунна вааллааҳу йаааламу ма фий қулубикум вакана аллааҳу ааалийман ҳалийман
                Ла йаҳиллу лака аннисао мин баааду вала ан табаддала биҳинна мин азважин валау ааажабака ҳуснуҳунна илла ма малакат йамийнука вакана аллааҳу ааала кулли шайин рақийбан
                Йа аййуҳа аллазийна аману ла тадхулу буйута аннабиййи илла ан йусана лакум ила таааамин ғайра насирийна инаҳу валакин иса дуааийтум фаодхулу файса таааймтум файнташиру вала мустанисийна лиҳадийсин инна саликум кана йусий аннабиййа файастаҳйий минкум вааллааҳу ла йастаҳйий мина алҳаққи вайса саалтумуҳунна матаааан файсалуҳунна мин варай ҳижабин саликум асару лиқулубикум вақулубиҳинна вама кана лакум ан тусу расула аллааҳи вала ан танкиҳу азважаҳу мин бааадиҳи абадан инна саликум кана ааинда аллааҳи ааасийман
                Ин тубду шайан ау тухфуҳу файнна аллааҳа кана бикулли шайин ааалийман
                Ла жунаҳа ааалайҳинна фий абайҳинна вала абнайҳинна вала ихваниҳинна вала абнай ихваниҳинна вала абнай ахауатиҳинна вала нисайҳинна вала ма малакат аймануҳунна вайттақийна аллааҳа инна аллааҳа кана ааала кулли шайин шаҳийдан
                Инна аллааҳа вамалайкатаҳу йусаллуна ааала аннабиййи йа аййуҳа аллазийна аману саллу ааалайҳи васаллиму таслийман
                Инна аллазийна йусуна аллааҳа варасулаҳу лаааанаҳуму аллааҳу фий аддунйа ваалахирати вааааадда лаҳум ааасабан муҳийнан
                Вааллазийна йусуна алмуминийна ваалмуминати биғайри ма иктасабу фақади иҳтамалу буҳтанан вайсман мубийнан
                Йа аййуҳа аннабиййу қул лиазважика вабанатика ванисай алмуминийна йуднийна ааалайҳинна мин жалабийбиҳинна салика адна ан йуаарафна фала йусайна вакана аллааҳу ғафуран роҳийман
                Лайн лам йантаҳи алмунафиқуна вааллазийна фий қулубиҳим марадун ваалмуржифуна фий алмадийнати лануғрийаннака биҳим сумма ла йужауирунака фийҳа илла қалийлан
                Малааунийна айнама суқифу охису вақуттилу тақтийлан
                Сунната аллааҳи фий аллазийна халау мин қаблу валан тажида лисуннати аллааҳи табдийлан
                Йасалука аннасу ааани ассаааати қул иннама ааилмуҳа ааинда аллааҳи вама йудрийка лаааалла ассаааата такуну қарийбан
                Инна аллааҳа лаааана алкафирийна вааааадда лаҳум саааийран
                Халидийна фийҳа абадан ла йажидуна валиййан вала насийран
                Йаума туқаллабу вужуҳуҳум фий аннари йақулуна йа лайтана атааана аллааҳа ваатааана аррасула
                Вақалу роббана инна атааана садатана вакубараана фаадаллуна ассабийла
                Роббана атиҳим диаафайни мина алааасаби вайлааанҳум лааанан кабийран
                Йа аййуҳа аллазийна аману ла такуну кааллазийна асау муса фабаррааҳу аллааҳу мимма қалу вакана ааинда аллааҳи важийҳан
                Йа аййуҳа аллазийна аману иттақу аллааҳа вақулу қаулан садийдан
                Йуслиҳ лакум ааамалакум вайағфир лакум сунубакум ваман йутиааи аллааҳа варасулаҳу фақад фаза фаузан ааасийман
                Инна ааарадна аламаната ааала ассамауати вааларди ваалжибали фаабайна ан йаҳмилнаҳа ваашфақна минҳа ваҳамалаҳа алинсану иннаҳу кана салуман жаҳулан
                Лийуааассиба аллааҳу алмунафиқийна ваалмунафиқати ваалмушрикийна ваалмушрикати вайатуба аллааҳу ааала алмуминийна ваалмуминати вакана аллааҳу ғафуран роҳийман
            """.trimIndent(),
        ),
        Surah(
            id = 34,
            arabicName = "سبإ",
            latinName = "Saba",
            transliteration = """
                Алҳамду лиллаҳи аллазий лаҳу ма фий ассамауати вама фий аларди валаҳу алҳамду фий алахирати ваҳува алҳакийму алхабийру
                Йаааламу ма йалижу фий аларди вама йахружу минҳа вама йанзилу мина ассамай вама йаааружу фийҳа ваҳува арроҳийму алғафуру
                Вақала аллазийна кафару ла татийна ассаааату қул бала вароббий лататийаннакум ааалими алғайби ла йааазубу ааанҳу мисқалу сарратин фий ассамауати вала фий аларди вала асғару мин салика вала акбару илла фий китабин мубийнин
                Лийажзийа аллазийна аману ваааамилу ассалиҳати олайка лаҳум мағфиратун варизқун кариймун
                Вааллазийна саааав фий айатина муааажизийна олайка лаҳум ааасабун мин рижзин алиймин
                Вайара аллазийна уту алааилма аллазий онзила илайка мин роббика ҳува алҳаққа вайаҳдий ила сирати алааазийзи алҳамийди
                Вақала аллазийна кафару ҳал надуллукум ааала ражулин йунаббиокум иса муззиқтум кулла мумаззақин иннакум лафий халқин жадийдин
                Афтара ааала аллааҳи касибан ам биҳи жиннатун бали аллазийна ла йуминуна биалахирати фий алааасаби ваалддалали албаааийди
                Афалам йарау ила ма байна айдийҳим вама халфаҳум мина ассамай вааларди ин наша нахсиф биҳиму аларда ау нусқит ааалайҳим кисафан мина ассамай инна фий салика лаайатан ликулли ааабдин мунийбин
                Валақад атайна даууда минна фадлан йа жибалу аувибий мааааҳу ваалттайра вааланна лаҳу алҳадийда
                Ани иаамал сабиғатин вақаддир фий ассарди вайаамалу салиҳан инний бима тааамалуна басийрун
                Валисулаймана аррийҳа ғудуввуҳа шаҳрун варауаҳуҳа шаҳрун ваасална лаҳу ааайна алқитри вамина алжинни ман йааамалу байна йадайҳи бийсни роббиҳи ваман йазиғ минҳум ааан амрина нусиқҳу мин ааасаби ассаааийри
                Йааамалуна лаҳу ма йашао мин маҳарийба ватамасийла важифанин каалжауаби вақудурин расийатин иаамалу ала даууда шукран вақалийлун мин ааибадийа ашшакуру
                Фаламма қадайна ааалайҳи алмаута ма даллааҳум ааала маутиҳи илла даббату аларди такулу минсаатаҳу фаламма харра табаййанати алжинну ан лау кану йаааламуна алғайба ма лабису фий алааасаби алмуҳийни
                Лақад кана лисабайн фий масканиҳим айатун жаннатани ааан йамийнин вашималин кулу мин ризқи роббикум ваошкуру лаҳу балдатун таййибатун вароббун ғафурун
                Фаааараду фаарсална ааалайҳим сайла алааарими вабаддалнаҳум бижаннатайҳим жаннатайни сауатай окулин хамтин вааслин вашайин мин сидрин қалийлин
                Салика жазайнаҳум бима кафару ваҳал нужазий илла алкафура
                Важаааална байнаҳум вабайна алқура аллатий баракна фийҳа қуран саҳиратан вақаддарна фийҳа ассайра сийру фийҳа лайалийа вааййаман аминийна
                Фақалу роббана бааайд байна асфарина васаламу анфусаҳум фажаааалнаҳум аҳадийса вамаззақнаҳум кулла мумаззақин инна фий салика лаайатин ликулли саббарин шакурин
                Валақад саддақа ааалайҳим иблийсу саннаҳу файттабааауҳу илла фарийқан мина алмуминийна
                Вама кана лаҳу ааалайҳим мин султанин илла линааалама ман йумину биалахирати мимман ҳува минҳа фий шаккин вароббука ааала кулли шайин ҳафийсун
                Қули одаау аллазийна заааамтум мин дуни аллааҳи ла йамликуна мисқала сарратин фий ассамауати вала фий аларди вама лаҳум фийҳима мин ширкин вама лаҳу минҳум мин саҳийрин
                Вала танфааау ашшафаааату ааиндаҳу илла лиман асина лаҳу ҳатта иса фуззиааа ааан қулубиҳим қалу маса қала роббукум қалу алҳаққа ваҳува алааалиййу алкабийру
                Қул ман йарзуқукум мина ассамауати вааларди қули аллааҳу вайнна ау иййакум лаааала ҳудан ау фий далалин мубийнин
                Қул ла тусалуна ааамма ажрамна вала нусалу ааамма тааамалуна
                Қул йажмааау байнана роббуна сумма йафтаҳу байнана биалҳаққи ваҳува алфаттаҳу алааалийму
                Қул арунийа аллазийна алҳақтум биҳи шуракаа калла бал ҳува аллааҳу алааазийзу алҳакийму
                Вама арсалнака илла каффатан лилннаси башийран ванасийран валакинна аксара аннаси ла йаааламуна
                Вайақулуна мата ҳаса алваааду ин кунтум садиқийна
                Қул лакум мийаааду йаумин ла тастахируна ааанҳу саааатан вала тастақдимуна
                Вақала аллазийна кафару лан нумина биҳаса алқурани вала биаллазий байна йадайҳи валау тара иси ассалимуна мауқуфуна ааинда роббиҳим йаржиаау бааадуҳум ила бааадин алқаула йақулу аллазийна истудааифу лиллазийна истакбару лаула антум лакунна муминийна
                Қала аллазийна истакбару лиллазийна истудааифу анаҳну сададнакум ааани алҳуда бааада ис жаакум бал кунтум мужримийна
                Вақала аллазийна истудааифу лиллазийна истакбару бал макру аллайли ваалннаҳари ис тамурунана ан накфура биаллааҳи ванажааала лаҳу андадан ваасарру аннадамата ламма рааву алааасаба важаааална алағлала фий ааанақи аллазийна кафару ҳал йужзауна илла ма кану йааамалуна
                Вама арсална фий қарйатин мин насийрин илла қала мутрафуҳа инна бима орсилтум биҳи кафируна
                Вақалу наҳну аксару амвалан ваавладан вама наҳну бимуааассабийна
                Қул инна роббий йабсуту арризқа лиман йашао вайақдиру валакинна аксара аннаси ла йаааламуна
                Вама амвалукум вала ауладукум биаллатий туқаррибукум ааиндана зулфа илла ман амана ваааамила салиҳан фаолайка лаҳум жазао аддиаафи бима ааамилу ваҳум фий алғуруфати аминуна
                Вааллазийна йасааауна фий айатина муааажизийна олайка фий алааасаби муҳдаруна
                Қул инна роббий йабсуту арризқа лиман йашао мин ааибадиҳи вайақдиру лаҳу вама анфақтум мин шайин фаҳува йухлифуҳу ваҳува хайру арразиқийна
                Вайаума йаҳшуруҳум жамийааан сумма йақулу лилмалайкати аҳаолай иййакум кану йааабудуна
                Қалу субҳанака анта валиййуна мин дуниҳим бал кану йааабудуна алжинна аксаруҳум биҳим муминуна
                Фаалйаума ла йамлику бааадукум либааадин нафааан вала дарран ванақулу лиллазийна саламу суқу ааасаба аннари аллатий кунтум биҳа тукассибуна
                Вайса тутла ааалайҳим айатуна баййинатин қалу ма ҳаса илла ражулун йурийду ан йасуддакум ааамма кана йааабуду абаокум вақалу ма ҳаса илла ифкун муфтаран вақала аллазийна кафару лилҳаққи ламма жааҳум ин ҳаса илла сиҳрун мубийнун
                Вама атайнаҳум мин кутубин йадрусунаҳа вама арсална илайҳим қаблака мин насийрин
                Вакассаба аллазийна мин қаблиҳим вама балағу миаашара ма атайнаҳум факассабу русулий факайфа кана накийри
                Қул иннама ааайсукум биваҳидатин ан тақуму лиллаҳи масна вафурада сумма татафаккару ма бисаҳибикум мин жиннатин ин ҳува илла насийрун лакум байна йадай ааасабин шадийдин
                Қул ма саалтукум мин ажрин фаҳува лакум ин ажрийа илла ааала аллааҳи ваҳува ааала кулли шайин шаҳийдун
                Қул инна роббий йақсифу биалҳаққи ааалламу алғуйуби
                Қул жаа алҳаққу вама йубдио албатилу вама йуааийду
                Қул ин далалту файннама адиллу ааала нафсий вайни иҳтадайту фабима йуҳий илаййа роббий иннаҳу самийааун қарийбун
                Валау тара ис фазиаау фала фаута ваохису мин маканин қарийбин
                Вақалу аманна биҳи ваанна лаҳуму аттанауушу мин маканин баааийдин
                Вақад кафару биҳи мин қаблу вайақсифуна биалғайби мин маканин баааийдин
                Ваҳийла байнаҳум вабайна ма йаштаҳуна кама фуааила биашйааайҳим мин қаблу иннаҳум кану фий шаккин мурийбин
            """.trimIndent(),
        ),
        Surah(
            id = 35,
            arabicName = "فاطر",
            latinName = "Fatir",
            transliteration = """
                Алҳамду лиллаҳи фатири ассамауати вааларди жааайли алмалайкати русулан олий ажниҳатин масна васуласа варубаааа йазийду фий алхалқи ма йашао инна аллааҳа ааала кулли шайин қадийрун
                Ма йафтаҳи аллааҳу лилннаси мин роҳматин фала мумсика лаҳа вама йумсик фала мурсила лаҳу мин бааадиҳи ваҳува алааазийзу алҳакийму
                Йа аййуҳа аннасу оскуру ниаамата аллааҳи ааалайкум ҳал мин халиқин ғайру аллааҳи йарзуқукум мина ассамай вааларди ла илаҳа илла ҳува фаанна туфакуна
                Вайн йукассибука фақад куссибат русулун мин қаблика вайла аллааҳи туржааау аломуру
                Йа аййуҳа аннасу инна вааада аллааҳи ҳаққун фала тағурраннакуму алҳайату аддунйа вала йағурраннакум биаллааҳи алғаруру
                Инна ашшайтана лакум ааадуввун файттахисуҳу ааадувван иннама йадаау ҳизбаҳу лийакуну мин ашаби ассаааийри
                Аллазийна кафару лаҳум ааасабун шадийдун вааллазийна аману ваааамилу ассалиҳати лаҳум мағфиратун ваажрун кабийрун
                Афаман зуййина лаҳу суо ааамалиҳи фарааҳу ҳасанан файнна аллааҳа йудиллу ман йашао вайаҳдий ман йашао фала тасҳаб нафсука ааалайҳим ҳасаратин инна аллааҳа ааалиймун бима йаснааауна
                Вааллааҳу аллазий арсала аррийаҳа фатусийру саҳабан фасуқнаҳу ила баладин маййитин фааҳйайна биҳи аларда бааада маутиҳа касалика аннушуру
                Ман кана йурийду алааиззата фалиллаҳи алааиззату жамийааан илайҳи йасаааду алкалиму аттаййибу ваалааамалу ассалиҳу йарфааауҳу вааллазийна йамкуруна ассаййиати лаҳум ааасабун шадийдун вамакру олайка ҳува йабуру
                Вааллааҳу халақакум мин туробин сумма мин нутфатин сумма жаааалакум азважан вама таҳмилу мин онса вала тадааау илла биааилмиҳи вама йуаааммару мин муаааммарин вала йунқасу мин ааумуриҳи илла фий китабин инна салика ааала аллааҳи йасийрун
                Вама йастауий албаҳрани ҳаса ааасбун фуратун сайғун шаробуҳу ваҳаса милҳун ожажун вамин куллин такулуна лаҳман тариййан ватастахрижуна ҳилйатан талбасунаҳа ватара алфулка фийҳи мауахира литабтағу мин фадлиҳи валааааллакум ташкуруна
                Йулижу аллайла фий аннаҳари вайулижу аннаҳара фий аллайли васаххара ашшамса ваалқамара куллун йажрий лиажалин мусамман саликуму аллааҳу роббукум лаҳу алмулку вааллазийна тадаауна мин дуниҳи ма йамликуна мин қитмийрин
                Ин тадаауҳум ла йасмааау дуаааакум валау самиаау ма истажабу лакум вайаума алқийамати йакфуруна биширкикум вала йунаббиока мислу хабийрин
                Йа аййуҳа аннасу антуму алфуқарао ила аллааҳи вааллааҳу ҳува алғаниййу алҳамийду
                Ин йаша йусҳибкум вайати бихалқин жадийдин
                Вама салика ааала аллааҳи биааазийзин
                Вала тазиру вазиратун визра охра вайн тадаау мусқалатун ила ҳимлиҳа ла йуҳмал минҳу шайон валау кана са қурба иннама тунсиру аллазийна йахшауна роббаҳум биалғайби ваақаму ассалата ваман тазакка файннама йатазакка линафсиҳи вайла аллааҳи алмасийру
                Вама йастауий алааама ваалбасийру
                Вала ассулумату вала аннуру
                Вала ассиллу вала алҳаруру
                Вама йастауий алаҳйао вала аламвату инна аллааҳа йусмиаау ман йашао вама анта бимусмиааин ман фий алқубури
                Ин анта илла насийрун
                Инна арсалнака биалҳаққи башийран ванасийран вайн мин омматин илла хала фийҳа насийрун
                Вайн йукассибука фақад кассаба аллазийна мин қаблиҳим жаасум русулуҳум биалбаййинати вабиалззубури вабиалкитаби алмунийри
                Сумма ахасту аллазийна кафару факайфа кана накийри
                Алам тара анна аллааҳа анзала мина ассамай маан фаахражна биҳи самаратин мухталифан алвануҳа вамина алжибали жудадун бийдун ваҳумрун мухталифун алвануҳа вағаробийбу судун
                Вамина аннаси ваалддауабби вааланааами мухталифун алвануҳу касалика иннама йахша аллааҳа мин ааибадиҳи алаауламао инна аллааҳа ааазийзун ғафурун
                Инна аллазийна йатлуна китаба аллааҳи ваақаму ассалата ваанфақу мимма разақнаҳум сирран вааааланийатан йаржуна тижаратан лан табура
                Лийуваффийаҳум ожуроҳум вайазийдаҳум мин фадлиҳи иннаҳу ғафурун шакурун
                Вааллазий ауҳайна илайка мина алкитаби ҳува алҳаққу мусаддиқан лима байна йадайҳи инна аллааҳа биааибадиҳи лахабийрун басийрун
                Сумма аурасна алкитаба аллазийна истафайна мин ааибадина фаминҳум салимун линафсиҳи ваминҳум муқтасидун ваминҳум сабиқун биалхайрати бийсни аллааҳи салика ҳува алфадлу алкабийру
                Жаннату аааднин йадхулунаҳа йуҳаллауна фийҳа мин асауира мин саҳабин валулуан валибасуҳум фийҳа ҳарийрун
                Вақалу алҳамду лиллаҳи аллазий асҳаба ааанна алҳазана инна роббана лағафурун шакурун
                Аллазий аҳаллана дара алмуқамати мин фадлиҳи ла йамассуна фийҳа насабун вала йамассуна фийҳа луғубун
                Вааллазийна кафару лаҳум нару жаҳаннама ла йуқда ааалайҳим файамуту вала йухаффафу ааанҳум мин ааасабиҳа касалика нажзий кулла кафурин
                Ваҳум йастарихуна фийҳа роббана ахрижна нааамал салиҳан ғайра аллазий кунна нааамалу ауалам нуаааммиркум ма йатасаккару фийҳи ман тасаккара важаакуму аннасийру фасуқу фама лилссалимийна мин насийрин
                Инна аллааҳа ааалиму ғайби ассамауати вааларди иннаҳу ааалиймун бисати ассудури
                Ҳува аллазий жаааалакум халайфа фий аларди фаман кафара фаааалайҳи куфруҳу вала йазийду алкафирийна куфруҳум ааинда роббиҳим илла мақтан вала йазийду алкафирийна куфруҳум илла хасаран
                Қул араайтум шуракаакуму аллазийна тадаауна мин дуни аллааҳи аруний маса халақу мина аларди ам лаҳум ширкун фий ассамауати ам атайнаҳум китабан фаҳум ааала баййинатин минҳу бал ин йааайду ассалимуна бааадуҳум бааадан илла ғуруран
                Инна аллааҳа йумсику ассамауати вааларда ан тазула валайн залата ин амсакаҳума мин аҳадин мин бааадиҳи иннаҳу кана ҳалийман ғафуран
                Ваақсаму биаллааҳи жаҳда айманиҳим лайн жааҳум насийрун лайакунунна аҳда мин иҳда аломами фаламма жааҳум насийрун ма задаҳум илла нуфуран
                Истикбаран фий аларди вамакра ассаййий вала йаҳийқу алмакру ассаййио илла биаҳлиҳи фаҳал йансуруна илла сунната алаувалийна фалан тажида лисуннати аллааҳи табдийлан валан тажида лисуннати аллааҳи таҳвийлан
                Ауалам йасийру фий аларди файансуру кайфа кана ааақибату аллазийна мин қаблиҳим вакану ашадда минҳум қувватан вама кана аллааҳу лийуаажизаҳу мин шайин фий ассамауати вала фий аларди иннаҳу кана ааалийман қадийран
                Валау йуахису аллааҳу аннаса бима касабу ма тарака ааала саҳриҳа мин даббатин валакин йуаххируҳум ила ажалин мусамман файса жаа ажалуҳум файнна аллааҳа кана биааибадиҳи басийран
            """.trimIndent(),
        ),
        Surah(
            id = 36,
            arabicName = "يس",
            latinName = "Ya-Sin",
            transliteration = """
                                Йаа Сиийн
                                Валқуръаанил ҳакиим
                                Иннака ламинал-мурсалиин
                                Ъалаа сироотим мустақиим
                                Танзиилал-ъазиизир роҳийм
                                Литунзира қауман маа унзира аабааухум фаҳум ғоофилуун
                                Лақад ҳаққал-қавлу ъалаа аксариҳим фаҳум лаа йуъминуун
                                Иннаа жаъалнаа фии аъноқиҳим ағлаалан фаҳия ила-л-азқоони фаҳум муқмаҳуун
                                Ва жаъална мин байна айдийҳим саддан ва мин холфиҳим саддан фа ағшайнаҳум фаҳум лаа юбсируун
                                Ва саваа'ун ъалайҳим а-анзартахум ам лам тунзирҳум лаа йуъминуун
                                Иннамаа тунзиру маниттабаъа-ззикро ва хашилар-роҳмаана билғайб фа башширҳу бимагфиротин ва ажрин карийм
                                Иннаа нахну нухйил мавтаа ва нактубу маа қоддаму ва аасаараҳум ва кулла шайъин аҳсоинайҳу фии имамин мубиин
                                Вазриб лаҳум масалан асҳабал-қарийяти из жааҳа-л-мурсалуун
                                Из арсална илайҳим иснайни факаззабуҳума фа ъаззазнаа бисаалис фақоолуу иннаа илайкум мурсалуун
                                Қоолуу маа антум иллаа башарун мислунаа ва маа анзаляр-роҳмаану мин шайъин ин антум иллаа такзибуун
                                Қоолуу роббунаа йаъламу иннаа илайкум ламурсалуун
                                Ва маа ъалайнаа иллал-балаагул мубиин
                                Қоолуу иннаа татоййарна бикум лаин лам тантаҳу ланаржуманнакум ва лаямассакум миннаа ъазаабун алиим
                                Қоолуу тоойрокум маъаакум а-ин зуккиртум бал антум қоумум мусрифуун
                                Ва жааа мин ақсол-мадийнати ражулуун ясъа қоола яа қавм иттабиъул-мурсалиин
                                Иттабиъуу ман лаа йас'алуккум ажран ва ҳум мухтадуун
                                Ва маалийа лаа аъбудул-лазии фатарний ва илайҳи туржаъуун
                                Аааттахизу мин дууниҳи аалиҳатан ин йуридниир-роҳмаану биддуррин лаа туғни ъанний шафаъатухум шайъан ва лаа юнқизуун
                                Иннии изан лафии долалим мубиин
                                Иннии ааманту бироббикум фассамиъуун
                                Қийла удхулил-жанна қоола яа лайта қавмии йаъламуун
                                Бимаа ғофара лийя роббий ва жаъаланий минал-мукрамиин
                                Ва маа анзальнаа ъалаа қаумии мин баъдиҳи мин жундим-мин ассамааи ва маа куннаа мунзилиин
                                Ин каанат иллаа сайҳатан вааҳидатан фа изаа ҳум хаамидуун
                                Яа ҳасраатан ъала-л-ъибаад маа йаатииҳим мин росулин иллаа каануу биҳи йастаҳзиъуун
                                Алам яроу кам аҳлакнаа қаблахум минал-қурууни аннаҳум илайҳим лаа яржиъуун
                                Ва ин куллун лламаа жамииун ладайна мухдаруун
                                Ва аайатун лаҳумул ардул-майтату аҳяйнааҳа ва ахрожна минҳаа ҳаббан фа минҳу йаакулуун
                                Ва жаъална фииҳаа жаннаатим мин нахлин ва аънаабин ва фажжарна фииҳа минал-ъуюун
                                Лияакулуу мин самариҳи ва маа амалатҳу айдийҳим афалаа йашкуруун
                                Субҳанал-лазии халақал-азваажа куллахаа миммаа тунбитул-ард ва мин анфусиҳим ва миммаа лаа йаъламуун
                                Ва аайатун лаҳумул-лайлу наслаху минҳу-н-наҳаар фа изаа ҳум музлимун
                                Вашшамсу тажрий лимустақаррин лаҳаа заа ликтақдирул-ъазиизил ъалиим
                                Валқамара қаддарнааҳу манаазила ҳаттаа ъаада кал-ъуржунил қадийм
                                Лашшамсу янбағии лаҳаа ан тудрика-л-қамара ва лял-лайлу саабиқан-наҳаар ва куллун фии фалакин ясбахуун
                                Ва аайатун лаҳум аннаа ҳамаллаа зуррийятаҳум фил-фулкил машҳуун
                                Ва халақна лаҳум мин мислиҳи маа яркабуун
                                Ва ин нашаъ нуғриқҳум фалаа сарииха лаҳум ва лаа ҳум юнқизуун
                                Иллаа раҳматам миннаа ва матааъан илаа ҳиин
                                Ва изаа қийла лаҳум уттақуу маа байна айдийкум ва маа холфакум лаъаллакум турҳамуун
                                Ва маа таатииҳим мин аайатим-мин аайаати роббиҳим иллаа каануу ъанҳо муъризуун
                                Ва изаа қийла лаҳум анфиқуу миммаа разақакумуллооҳу қоолал-лазиина кафаруу лиллазиина ааману анутъиму ман лав йашаауллооҳу атъамаҳу ин антум иллаа фии долалим мубиин
                                Ва яқуулуун матаа ҳаазал-ваъду ин кунтум соодиқиин
                                Маа йанзуруун иллаа сайҳатан вааҳидатан таъхузуҳум ва ҳум йахсимуун
                                Фалаа йастатииъууна тавсийатан ва лаа илаа аҳлиҳим яржиъуун
                                Ва нуфиха фис-суур фа изаа ҳум минал-аждаси илаа роббиҳим йансилуун
                                Қоолуу яа вайланаа ман бааъасанаа мин марқадинааҳаазаа маа ваъадар-роҳмаану ва садақал-мурсалуун
                                Ин каанат иллаа сайҳатан вааҳидатан фа изаа ҳум жамииун ладайна мухдаруун
                                Фалйавма лаа тузламу нафсун шайъаа ва лаа тужзауна иллаа маа кунтум таъмалуун
                                Инна асҳаабал-жаннати-лйавма фии шуллин фаакихуун
                                Ҳум ва азваажуҳум фии зилаалин ъалал-арааики мутакиуун
                                Лаҳум фииҳаа фаакиҳатун ва лаҳум маа йаддаъуун
                                Салаамун қоолан мир-роббир роҳийм
                                Вамтаазул-йавма аййуҳал-мужримун
                                Алам аъҳад илайкум яа баний Аадам аллаа таъбудуш-шайтоона иннаҳу лакум ъадууввум мубиин
                                Ва аниъбудунии ҳаазаа сироотум мустақиим
                                Валақад адалла минкум жибиллан касийран афалам такуунуу таъқилуун
                                Ҳаазиҳи Жаҳаннамул-латии кунтум тууъадуун
                                Иславҳаа-лйавма бимаа кунтум такфуруун
                                Алйавма нахтиму ъалаа афвааҳиҳим ва тукаллимунаа айдийҳим ва ташҳаду арджулоҳум бимаа каану яксибуун
                                Ва лав нашаа ла томасна ъалаа аъюниҳим фастабақус-сироота фа аннаа юбсируун
                                Ва лав нашаа ла масахнаа ҳум ъалаа маканатиҳим фа маа статоъуу мадиййан ва лаа яржиъуун
                                Ва маннуъаммирҳу нунаккисҳу фил-халқ афалаа йаъқилуун
                                Ва маа алламнаҳуш-шиъра ва маа янбағий лаҳу ин ҳува иллаа зикрув-Қуръанун мубиин
                                Лиюнзира ман каана ҳаййан ва йаҳиққал-қавлу ъалаа-л-каафирин
                                Авалам ярав аннаа халақна лаҳум миммаа амилат айдийнаа анаааман фаҳум лаҳаа мааликун
                                Ва заллалнааҳаа лаҳум фа минҳаа ракубуҳум ва минҳаа йаъкулуун
                                Ва лаҳум фииҳаа манаафиу ва машаариб афалаа йашкуруун
                                Ваттахазуу мин дуунуллооҳи аалиҳатан лаъаллахум йунсаруун
                                Лаа йастатииъууна насроҳум ва ҳум лаҳум жундум муҳдаруун
                                Фа лаа йаҳзунка қавлуҳум иннаа наъламу маа юсиррун ва маа йаълинуун
                                Авалам ярал-инсаану аннаа халақнаҳу мин нутфатин фа изаа ҳува хасиймум мубиин
                                Ва дароба ланаа масалан ва насийа холқаҳу қоола ман йуҳйил-ъизоома ва ҳия рамим
                                Қул йуҳйиҳал-лазии аншааҳаа авваля марраҳ ва ҳува бикулли холқин ъалиим
                                Аллазии жаъала лакум мин аш-шажарил-ахзари нааран фа изаа антум минҳу тууқидуун
                                Авалайса-л-лазии халақас-самааваати вал-арзо биқаадирин ъалаа ан йахлуқамислахум балаа ва ҳува-л-халлаағул ъалиим
                                Иннамаа амруҳу изаа араада шайъан ай яқуула лаҳу кун фаякуун
                                Фасубҳанал-лазии бийадиҳи малакууту кулли шайъин ва илайҳи туржаъуун
            """.trimIndent(),
        ),
        Surah(
            id = 37,
            arabicName = "الصافات",
            latinName = "As-Saffat",
            transliteration = """
                Ваалссаффати саффан
                Фаалззажирати зажран
                Фаалтталийати сикран
                Инна илаҳакум лауаҳидун
                Роббу ассамауати вааларди вама байнаҳума вароббу алмашариқи
                Инна заййанна ассамаа аддунйа бизийнатин алкауакиби
                Ваҳифсан мин кулли шайтанин маридин
                Ла йассаммааауна ила алмалай алааала вайуқсафуна мин кулли жанибин
                Дуҳуран валаҳум ааасабун васибун
                Илла ман хатифа алхатфата фаатбааааҳу шиҳабун сақибун
                Файстафтиҳим аҳум ашадду халқан ам ман халақна инна халақнаҳум мин тийнин лазибин
                Бал ааажибта вайасхаруна
                Вайса суккиру ла йаскуруна
                Вайса раав айатан йастасхируна
                Вақалу ин ҳаса илла сиҳрун мубийнун
                Айса митна вакунна туробан вааайсаман айнна ламабааусуна
                Ауаабаона алаувалуна
                Қул наааам ваантум дахируна
                Файннама ҳийа зажратун ваҳидатун файса ҳум йансуруна
                Вақалу йа вайлана ҳаса йауму аддийни
                Ҳаса йауму алфасли аллазий кунтум биҳи тукассибуна
                Оҳшуру аллазийна саламу ваазважаҳум вама кану йааабудуна
                Мин дуни аллааҳи файҳдуҳум ила сирати алжаҳийми
                Вақифуҳум иннаҳум масулуна
                Ма лакум ла танасаруна
                Бал ҳуму алйаума мустаслимуна
                Ваақбала бааадуҳум ааала бааадин йатасаалуна
                Қалу иннакум кунтум татунана ааани алйамийни
                Қалу бал лам такуну муминийна
                Вама кана лана ааалайкум мин султанин бал кунтум қауман тағийна
                Фаҳаққа ааалайна қаулу роббина инна ласайқуна
                Фаағвайнакум инна кунна ғауийна
                Файннаҳум йаумайсин фий алааасаби муштарикуна
                Инна касалика нафааалу биалмужримийна
                Иннаҳум кану иса қийла лаҳум ла илаҳа илла аллааҳу йастакбируна
                Вайақулуна айнна латарику алиҳатина лишааайрин мажнунин
                Бал жаа биалҳаққи васаддақа алмурсалийна
                Иннакум ласайқу алааасаби алалийми
                Вама тужзауна илла ма кунтум тааамалуна
                Илла ааибада аллааҳи алмухласийна
                Олайка лаҳум ризқун мааалумун
                Фауакиҳу ваҳум мукрамуна
                Фий жаннати аннаааийми
                Ааала сурурин мутақабилийна
                Йутафу ааалайҳим бикасин мин маааийнин
                Байдаа лассатин лилшшарибийна
                Ла фийҳа ғаулун вала ҳум ааанҳа йунзафуна
                Вааайндаҳум қасирату аттарфи ааийнун
                Кааннаҳунна байдун макнунун
                Фаақбала бааадуҳум ааала бааадин йатасаалуна
                Қала қайлун минҳум инний кана лий қарийнун
                Йақулу айннака ламина алмусаддиқийна
                Айса митна вакунна туробан вааайсаман айнна ламадийнуна
                Қала ҳал антум мутталиаауна
                Файтталаааа фарааҳу фий сауай алжаҳийми
                Қала тааллааҳи ин кидта латурдийни
                Валаула ниаамату роббий лакунту мина алмуҳдарийна
                Афама наҳну бимаййитийна
                Илла маутатана алула вама наҳну бимуааассабийна
                Инна ҳаса лаҳува алфаузу алааасийму
                Лимисли ҳаса фалйааамали алааамилуна
                Асалика хайрун нузулан ам шажарату аззаққуми
                Инна жаааалнаҳа фитнатан лилссалимийна
                Иннаҳа шажаратун тахружу фий асли алжаҳийми
                Талаауҳа кааннаҳу руусу ашшайатийни
                Файннаҳум лаакилуна минҳа фамалиуна минҳа албутуна
                Сумма инна лаҳум ааалайҳа лашаубан мин ҳамиймин
                Сумма инна маржиаааҳум лайла алжаҳийми
                Иннаҳум алфау абааҳум даллийна
                Фаҳум ааала асариҳим йуҳрааауна
                Валақад далла қаблаҳум аксару алаувалийна
                Валақад арсална фийҳим мунсирийна
                Фаонсур кайфа кана ааақибату алмунсарийна
                Илла ааибада аллааҳи алмухласийна
                Валақад надана нуҳун фаланиаама алмужийбуна
                Ванажжайнаҳу вааҳлаҳу мина алкарби алааасийми
                Важаааална сурриййатаҳу ҳуму албақийна
                Ватаракна ааалайҳи фий алахирийна
                Саламун ааала нуҳин фий алаааламийна
                Инна касалика нажзий алмуҳсинийна
                Иннаҳу мин ааибадина алмуминийна
                Сумма ағрақна алахарийна
                Вайнна мин шийааатиҳи лайброҳийма
                Ис жаа роббаҳу биқалбин салиймин
                Ис қала лиабийҳи вақаумиҳи маса тааабудуна
                Айфкан алиҳатан дуна аллааҳи турийдуна
                Фама саннукум биробби алаааламийна
                Фанасара насратан фий аннужуми
                Фақала инний сақиймун
                Фатауаллау ааанҳу мудбирийна
                Фараға ила алиҳатиҳим фақала ала такулуна
                Ма лакум ла тантиқуна
                Фараға ааалайҳим дарбан биалйамийни
                Фаақбалу илайҳи йазиффуна
                Қала атааабудуна ма танҳитуна
                Вааллааҳу халақакум вама тааамалуна
                Қалу ибну лаҳу бунйанан фаалқуҳу фий алжаҳийми
                Фаараду биҳи кайдан фажаааалнаҳуму аласфалийна
                Вақала инний саҳибун ила роббий сайаҳдийни
                Робби ҳаб лий мина ассалиҳийна
                Фабашшарнаҳу биғуламин ҳалиймин
                Фаламма балаға мааааҳу ассааайа қала йа бунаййа инний ара фий алманами анний асбаҳука фаонсур маса тара қала йа абати ифааал ма тумару сатажидуний ин шаа аллааҳу мина ассабирийна
                Фаламма аслама ваталлааҳу лилжабийни
                Ванадайнаҳу ан йа иброҳийму
                Қад саддақта арруйа инна касалика нажзий алмуҳсинийна
                Инна ҳаса лаҳува албалао алмубийну
                Вафадайнаҳу бисибҳин ааасиймин
                Ватаракна ааалайҳи фий алахирийна
                Саламун ааала иброҳийма
                Касалика нажзий алмуҳсинийна
                Иннаҳу мин ааибадина алмуминийна
                Вабашшарнаҳу бийшақа набиййан мина ассалиҳийна
                Вабаракна ааалайҳи ваааала ишақа вамин сурриййатиҳима муҳсинун васалимун линафсиҳи мубийнун
                Валақад мананна ааала муса ваҳаруна
                Ванажжайнаҳума вақаумаҳума мина алкарби алааасийми
                Ванасарнаҳум факану ҳуму алғалибийна
                Ваатайнаҳума алкитаба алмустабийна
                Ваҳадайнаҳума ассирата алмустақийма
                Ватаракна ааалайҳима фий алахирийна
                Саламун ааала муса ваҳаруна
                Инна касалика нажзий алмуҳсинийна
                Иннаҳума мин ааибадина алмуминийна
                Вайнна илйаса ламина алмурсалийна
                Ис қала лиқаумиҳи ала таттақуна
                Атадаауна бааалан ватасаруна аҳсана алхалиқийна
                Аллааҳа роббакум варобба абайкуму алаувалийна
                Факассабуҳу файннаҳум ламуҳдаруна
                Илла ааибада аллааҳи алмухласийна
                Ватаракна ааалайҳи фий алахирийна
                Саламун ааала ил йасийна
                Инна касалика нажзий алмуҳсинийна
                Иннаҳу мин ааибадина алмуминийна
                Вайнна лутан ламина алмурсалийна
                Ис нажжайнаҳу вааҳлаҳу ажмаааийна
                Илла ааажузан фий алғабирийна
                Сумма даммарна алахарийна
                Вайннакум латамурруна ааалайҳим мусбиҳийна
                Вабиаллайли афала тааақилуна
                Вайнна йунуса ламина алмурсалийна
                Ис абақа ила алфулки алмашҳуни
                Фасаҳама факана мина алмузадийна
                Файлтақамаҳу алҳуту ваҳува мулиймун
                Фалаула аннаҳу кана мина алмусаббиҳийна
                Лалабиса фий батниҳи ила йауми йубааасуна
                Фанабаснаҳу биалааарай ваҳува сақиймун
                Ваанбатна ааалайҳи шажаратан мин йақтийнин
                Ваарсалнаҳу ила миати алфин ау йазийдуна
                Фааману фаматтааанаҳум ила ҳийнин
                Файстафтиҳим алироббика албанату валаҳуму албануна
                Ам халақна алмалайката инасан ваҳум шаҳидуна
                Ала иннаҳум мин ифкиҳим лайақулуна
                Валада аллааҳу вайннаҳум лакасибуна
                Астафа албанати ааала албанийна
                Ма лакум кайфа таҳкумуна
                Афала тасаккаруна
                Ам лакум султанун мубийнун
                Фату бикитабикум ин кунтум садиқийна
                Важаааалу байнаҳу вабайна алжиннати насабан валақад ааалимати алжиннату иннаҳум ламуҳдаруна
                Субҳана аллааҳи ааамма йасифуна
                Илла ааибада аллааҳи алмухласийна
                Файннакум вама тааабудуна
                Ма антум ааалайҳи бифатинийна
                Илла ман ҳува сали алжаҳийми
                Вама минна илла лаҳу мақамун мааалумун
                Вайнна ланаҳну ассаффуна
                Вайнна ланаҳну алмусаббиҳуна
                Вайн кану лайақулуна
                Лау анна ааиндана сикран мина алаувалийна
                Лакунна ааибада аллааҳи алмухласийна
                Факафару биҳи фасауфа йаааламуна
                Валақад сабақат калиматуна лиааибадина алмурсалийна
                Иннаҳум лаҳуму алмансуруна
                Вайнна жундана лаҳуму алғалибуна
                Фатауалла ааанҳум ҳатта ҳийнин
                Ваабсирҳум фасауфа йубсируна
                Афабиааасабина йастааажилуна
                Файса назала бисаҳатиҳим фасаа сабаҳу алмунсарийна
                Ватауалла ааанҳум ҳатта ҳийнин
                Ваабсир фасауфа йубсируна
                Субҳана роббика робби алааиззати ааамма йасифуна
                Васаламун ааала алмурсалийна
                Ваалҳамду лиллаҳи робби алаааламийна
            """.trimIndent(),
        ),
        Surah(
            id = 38,
            arabicName = "ص",
            latinName = "Sad",
            transliteration = """
                Сад ваалқурани сий ассикри
                Бали аллазийна кафару фий ааиззатин вашиқақин
                Кам аҳлакна мин қаблиҳим мин қарнин фанадау валата ҳийна манасин
                Ваааажибу ан жааҳум мунсирун минҳум вақала алкафируна ҳаса саҳирун кассабун
                Ажаааала алалиҳата илаҳан ваҳидан инна ҳаса лашайон ааужабун
                Вайнталақа алмалао минҳум ани имшу вайсбиру ааала алиҳатикум инна ҳаса лашайон йураду
                Ма самиаана биҳаса фий алмиллати алахирати ин ҳаса илла ихтилақун
                Аонзила ааалайҳи ассикру мин байнина бал ҳум фий шаккин мин сикрий бал ламма йасуқу ааасаби
                Ам ааиндаҳум хазайну роҳмати роббика алааазийзи алваҳҳаби
                Ам лаҳум мулку ассамауати вааларди вама байнаҳума фалйартақу фий аласбаби
                Жундун ма ҳуналика маҳзумун мина алаҳзаби
                Кассабат қаблаҳум қауму нуҳин ваааадун вафирааауну су алаутади
                Васамуду вақауму лутин ваашабу алайкати олайка алаҳзабу
                Ин куллун илла кассаба аррусула фаҳаққа ааиқаби
                Вама йансуру ҳаолай илла сайҳатан ваҳидатан ма лаҳа мин фауақин
                Вақалу роббана ааажжил лана қиттана қабла йауми алҳисаби
                Исбир ааала ма йақулуна ваоскур ааабдана даууда са алайди иннаҳу аувабун
                Инна саххарна алжибала мааааҳу йусаббиҳна биалааашиййи ваалишрақи
                Ваалттайра маҳшуратан куллун лаҳу аувабун
                Вашададна мулкаҳу ваатайнаҳу алҳикмата вафасла алхитаби
                Ваҳал атака набао алхасми ис тасаувару алмиҳроба
                Ис дахалу ааала даууда фафазиааа минҳум қалу ла тахаф хасмани баға бааадуна ааала бааадин фаоҳкум байнана биалҳаққи вала туштит вайҳдина ила сауай ассирати
                Инна ҳаса ахий лаҳу тисааун ватисаауна нааажатан валийа нааажатун ваҳидатун фақала акфилнийҳа вааааззаний фий алхитаби
                Қала лақад саламака бисуали нааажатика ила ниааажиҳи вайнна касийран мина алхулатай лайабғий бааадуҳум ааала бааадин илла аллазийна аману ваааамилу ассалиҳати вақалийлун ма ҳум васанна даууду аннама фатаннаҳу файстағфара роббаҳу вахарра ракиааан ваанаба
                Фағафарна лаҳу салика вайнна лаҳу ааиндана лазулфа ваҳусна маабин
                Йа даууду инна жаааалнака халийфатан фий аларди фаоҳкум байна аннаси биалҳаққи вала таттабиааи алҳауа файудиллака ааан сабийли аллааҳи инна аллазийна йадиллуна ааан сабийли аллааҳи лаҳум ааасабун шадийдун бима насу йаума алҳисаби
                Вама халақна ассамаа вааларда вама байнаҳума батилан салика санну аллазийна кафару фауайлун лиллазийна кафару мина аннари
                Ам нажааалу аллазийна аману ваааамилу ассалиҳати каалмуфсидийна фий аларди ам нажааалу алмуттақийна каалфужжари
                Китабун анзалнаҳу илайка мубаракун лийаддаббару айатиҳи валийатасаккара олу алалбаби
                Вауаҳабна лидаууда сулаймана ниаама алааабду иннаҳу аувабун
                Ис ааурида ааалайҳи биалааашиййи ассафинату алжийаду
                Фақала инний аҳбабту ҳубба алхайри ааан сикри роббий ҳатта тауарат биалҳижаби
                Руддуҳа ааалаййа фатафиқа машан биалссуқи ваалааанақи
                Валақад фатанна сулаймана ваалқайна ааала курсиййиҳи жасадан сумма анаба
                Қала робби иғфир лий ваҳаб лий мулкан ла йанбағий лиаҳадин мин бааадий иннака анта алваҳҳабу
                Фасаххарна лаҳу аррийҳа тажрий биамриҳи рухаан ҳайсу асаба
                Ваалшшайатийна кулла баннайн вағаувасин
                Ваахарийна муқарранийна фий аласфади
                Ҳаса ааатаона фаомнун ау амсик биғайри ҳисабин
                Вайнна лаҳу ааиндана лазулфа ваҳусна маабин
                Ваоскур ааабдана аййуба ис нада роббаҳу анний массанийа ашшайтану бинусбин ваааасабин
                Оркуд бирижлика ҳаса муғтасалун баридун вашаробун
                Вауаҳабна лаҳу аҳлаҳу вамислаҳум мааааҳум роҳматан минна васикра лиолий алалбаби
                Вахус бийадика диғсан файдриб биҳи вала таҳнас инна важаднаҳу сабиран ниаама алааабду иннаҳу аувабун
                Ваоскур ааибадана иброҳийма вайшақа вайааақуба олий алайдий ваалабсари
                Инна ахласнаҳум бихалисатин сикра аддари
                Вайннаҳум ааиндана ламина алмустафайна алахйари
                Ваоскур исмаааийла вайлйасаааа васа алкифли вакуллун мина алахйари
                Ҳаса сикрун вайнна лилмуттақийна лаҳусна маабин
                Жаннати аааднин муфаттаҳатан лаҳуму алабвабу
                Муттакиийна фийҳа йадаауна фийҳа бифакиҳатин касийратин вашаробин
                Вааайндаҳум қасирату аттарфи атробун
                Ҳаса ма туааадуна лийауми алҳисаби
                Инна ҳаса ларизқуна ма лаҳу мин нафадин
                Ҳаса вайнна лилттағийна лашарра маабин
                Жаҳаннама йаслаунаҳа фабиса алмиҳаду
                Ҳаса фалйасуқуҳу ҳамиймун вағассақун
                Ваахару мин шаклиҳи азважун
                Ҳаса фаужун муқтаҳимун маааакум ла марҳабан биҳим иннаҳум салу аннари
                Қалу бал антум ла марҳабан бикум антум қаддамтумуҳу лана фабиса алқарару
                Қалу роббана ман қаддама лана ҳаса фазизу ааасабан диаафан фий аннари
                Вақалу ма лана ла нара рижалан кунна нааауддуҳум мина алашрари
                Аттахаснаҳум сихриййан ам зағат ааанҳуму алабсару
                Инна салика лаҳаққун тахасуму аҳли аннари
                Қул иннама ана мунсирун вама мин илаҳин илла аллааҳу алваҳиду алқаҳҳару
                Роббу ассамауати вааларди вама байнаҳума алааазийзу алғаффару
                Қул ҳува набаон ааасиймун
                Антум ааанҳу муааридуна
                Ма кана лийа мин ааилмин биалмалай алааала ис йахтасимуна
                Ин йуҳа илаййа илла аннама ана насийрун мубийнун
                Ис қала роббука лилмалайкати инний халиқун башаран мин тийнин
                Файса саувайтуҳу ванафахту фийҳи мин руҳий фақааау лаҳу сажидийна
                Фасажада алмалайкату куллуҳум ажмааауна
                Илла иблийса истакбара вакана мина алкафирийна
                Қала йа иблийсу ма манаааака ан тасжуда лима халақту бийадаййа астакбарта ам кунта мина алааалийна
                Қала ана хайрун минҳу халақтаний мин нарин вахалақтаҳу мин тийнин
                Қала фаохруж минҳа файннака ражиймун
                Вайнна ааалайка лааанатий ила йауми аддийни
                Қала робби фаансирний ила йауми йубааасуна
                Қала файннака мина алмунсарийна
                Ила йауми алвақти алмааалуми
                Қала фабиааиззатика лаоғвийаннаҳум ажмаааийна
                Илла ааибадака минҳуму алмухласийна
                Қала фаалҳаққу ваалҳаққа ақулу
                Лаамлаанна жаҳаннама минка вамимман табиааака минҳум ажмаааийна
                Қул ма асалукум ааалайҳи мин ажрин вама ана мина алмутакаллифийна
                Ин ҳува илла сикрун лилаааламийна
                Валатаааламунна набааҳу бааада ҳийнин
            """.trimIndent(),
        ),
        Surah(
            id = 39,
            arabicName = "الزمر",
            latinName = "Az-Zumar",
            transliteration = """
                Танзийлу алкитаби мина аллааҳи алааазийзи алҳакийми
                Инна анзална илайка алкитаба биалҳаққи фаоаабуди аллааҳа мухлисан лаҳу аддийна
                Ала лиллаҳи аддийну алхалису вааллазийна иттахасу мин дуниҳи аулийаа ма нааабудуҳум илла лийуқаррибуна ила аллааҳи зулфа инна аллааҳа йаҳкуму байнаҳум фий ма ҳум фийҳи йахталифуна инна аллааҳа ла йаҳдий ман ҳува касибун каффарун
                Лау арада аллааҳу ан йаттахиса валадан лайстафа мимма йахлуқу ма йашао субҳанаҳу ҳува аллааҳу алваҳиду алқаҳҳару
                Халақа ассамауати вааларда биалҳаққи йукаувиру аллайла ааала аннаҳари вайукаувиру аннаҳара ааала аллайли васаххара ашшамса ваалқамара куллун йажрий лиажалин мусамман ала ҳува алааазийзу алғаффару
                Халақакум мин нафсин ваҳидатин сумма жаааала минҳа заужаҳа ваанзала лакум мина аланааами саманийата азважин йахлуқукум фий бутуни оммаҳатикум халқан мин бааади халқин фий сулуматин саласин саликуму аллааҳу роббукум лаҳу алмулку ла илаҳа илла ҳува фаанна тусрафуна
                Ин такфуру файнна аллааҳа ғаниййун ааанкум вала йарда лиааибадиҳи алкуфра вайн ташкуру йардаҳу лакум вала тазиру вазиратун визра охра сумма ила роббикум маржиааукум файунаббиокум бима кунтум тааамалуна иннаҳу ааалиймун бисати ассудури
                Вайса масса алинсана дуррун даааа роббаҳу мунийбан илайҳи сумма иса хаувалаҳу ниааматан минҳу насийа ма кана йадаау илайҳи мин қаблу важаааала лиллаҳи андадан лийудилла ааан сабийлиҳи қул таматтааа бикуфрика қалийлан иннака мин ашаби аннари
                Амман ҳува қанитун анаа аллайли сажидан вақайман йаҳсару алахирата вайаржу роҳмата роббиҳи қул ҳал йастауий аллазийна йаааламуна вааллазийна ла йаааламуна иннама йатасаккару олу алалбаби
                Қул йа ааибади аллазийна аману иттақу роббакум лиллазийна аҳсану фий ҳасиҳи аддунйа ҳасанатун ваарду аллааҳи васиааатун иннама йуваффа ассабируна ажроҳум биғайри ҳисабин
                Қул инний омирту ан ааабуда аллааҳа мухлисан лаҳу аддийна
                Ваомирту лиан акуна аувала алмуслимийна
                Қул инний ахафу ин ааасайту роббий ааасаба йаумин ааасиймин
                Қули аллааҳа ааабуду мухлисан лаҳу дийний
                Фаоаабуду ма шитум мин дуниҳи қул инна алхасирийна аллазийна хасиру анфусаҳум вааҳлийҳим йаума алқийамати ала салика ҳува алхусрану алмубийну
                Лаҳум мин фауқиҳим сулалун мина аннари вамин таҳтиҳим сулалун салика йухаувифу аллааҳу биҳи ааибадаҳу йа ааибади файттақуни
                Вааллазийна ижтанабу аттағута ан йааабудуҳа ваанабу ила аллааҳи лаҳуму албушра фабашшир ааибади
                Аллазийна йастамиаауна алқаула файаттабиаауна аҳсанаҳу олайка аллазийна ҳадаҳуму аллааҳу ваолайка ҳум олу алалбаби
                Афаман ҳаққа ааалайҳи калимату алааасаби афаанта тунқису ман фий аннари
                Лакини аллазийна иттақау роббаҳум лаҳум ғурафун мин фауқиҳа ғурафун мабниййатун тажрий мин таҳтиҳа аланҳару вааада аллааҳи ла йухлифу аллааҳу алмийааада
                Алам тара анна аллааҳа анзала мина ассамай маан фасалакаҳу йанабийааа фий аларди сумма йухрижу биҳи зарааан мухталифан алвануҳу сумма йаҳийжу фатароҳу мусфарран сумма йажааалуҳу ҳутаман инна фий салика ласикра лиолий алалбаби
                Афаман шароҳа аллааҳу садроҳу лилислами фаҳува ааала нурин мин роббиҳи фауайлун лилқасийати қулубуҳум мин сикри аллааҳи олайка фий далалин мубийнин
                Аллааҳу наззала аҳсана алҳадийси китабан муташабиҳан масанийа тақшааайрру минҳу жулуду аллазийна йахшауна роббаҳум сумма талийну жулудуҳум вақулубуҳум ила сикри аллааҳи салика ҳуда аллааҳи йаҳдий биҳи ман йашао ваман йудлили аллааҳу фама лаҳу мин ҳадин
                Афаман йаттақий биважҳиҳи суа алааасаби йаума алқийамати вақийла лилссалимийна суқу ма кунтум таксибуна
                Кассаба аллазийна мин қаблиҳим фаатаҳуму алааасабу мин ҳайсу ла йашаауруна
                Фаасақаҳуму аллааҳу алхизйа фий алҳайати аддунйа валаааасабу алахирати акбару лау кану йаааламуна
                Валақад даробна лилннаси фий ҳаса алқурани мин кулли масалин лааааллааҳум йатасаккаруна
                Қуранан аааробиййан ғайра сий ааиважин лааааллааҳум йаттақуна
                Дароба аллааҳу масалан ражулан фийҳи шуракао муташакисуна варажулан саламан лиражулин ҳал йастауийани масалан алҳамду лиллаҳи бал аксаруҳум ла йаааламуна
                Иннака маййитун вайннаҳум маййитуна
                Сумма иннакум йаума алқийамати ааинда роббикум тахтасимуна
                Фаман асламу мимман касаба ааала аллааҳи вакассаба биалссидқи ис жааҳу алайса фий жаҳаннама масван лилкафирийна
                Вааллазий жаа биалссидқи васаддақа биҳи олайка ҳуму алмуттақуна
                Лаҳум ма йашауна ааинда роббиҳим салика жазао алмуҳсинийна
                Лийукаффира аллааҳу ааанҳум асваа аллазий ааамилу вайажзийаҳум ажроҳум биаҳсани аллазий кану йааамалуна
                Алайса аллааҳу бикафин ааабдаҳу вайухаувифунака биаллазийна мин дуниҳи ваман йудлили аллааҳу фама лаҳу мин ҳадин
                Ваман йаҳди аллааҳу фама лаҳу мин мудиллин алайса аллааҳу биааазийзин сий интиқамин
                Валайн саалтаҳум ман халақа ассамауати вааларда лайақулунна аллааҳу қул афараайтум ма тадаауна мин дуни аллааҳи ин араданийа аллааҳу бидуррин ҳал ҳунна кашифату дурриҳи ау араданий бироҳматин ҳал ҳунна мумсикату роҳматиҳи қул ҳасбийа аллааҳу ааалайҳи йатауаккалу алмутауаккилуна
                Қул йа қауми иаамалу ааала маканатикум инний ааамилун фасауфа таааламуна
                Ман йатийҳи ааасабун йухзийҳи вайаҳиллу ааалайҳи ааасабун муқиймун
                Инна анзална ааалайка алкитаба лилннаси биалҳаққи фамани иҳтада фалинафсиҳи ваман далла файннама йадиллу ааалайҳа вама анта ааалайҳим бивакийлин
                Аллааҳу йатауаффа аланфуса ҳийна маутиҳа вааллатий лам тамут фий манамиҳа файумсику аллатий қада ааалайҳа алмаута вайурсилу алохра ила ажалин мусамман инна фий салика лаайатин лиқаумин йатафаккаруна
                Ами иттахасу мин дуни аллааҳи шуфааааа қул ауалау кану ла йамликуна шайан вала йааақилуна
                Қул лиллаҳи ашшафаааату жамийааан лаҳу мулку ассамауати вааларди сумма илайҳи туржааауна
                Вайса сукира аллааҳу ваҳдаҳу ишмааззат қулубу аллазийна ла йуминуна биалахирати вайса сукира аллазийна мин дуниҳи иса ҳум йастабшируна
                Қули аллааҳумма фатира ассамауати вааларди ааалима алғайби ваалшшаҳадати анта таҳкуму байна ааибадика фий ма кану фийҳи йахталифуна
                Валау анна лиллазийна саламу ма фий аларди жамийааан вамислаҳу мааааҳу лайфтадау биҳи мин суи алааасаби йаума алқийамати вабада лаҳум мина аллааҳи ма лам йакуну йаҳтасибуна
                Вабада лаҳум саййиату ма касабу ваҳақа биҳим ма кану биҳи йастаҳзиуна
                Файса масса алинсана дуррун даааана сумма иса хаувалнаҳу ниааматан минна қала иннама утийтуҳу ааала ааилмин бал ҳийа фитнатун валакинна аксароҳум ла йаааламуна
                Қад қалаҳа аллазийна мин қаблиҳим фама ағна ааанҳум ма кану йаксибуна
                Фаасабаҳум саййиату ма касабу вааллазийна саламу мин ҳаолай сайусийбуҳум саййиату ма касабу вама ҳум бимуаажизийна
                Ауалам йаааламу анна аллааҳа йабсуту арризқа лиман йашао вайақдиру инна фий салика лаайатин лиқаумин йуминуна
                Қул йа ааибадийа аллазийна асрафу ааала анфусиҳим ла тақнату мин роҳмати аллааҳи инна аллааҳа йағфиру ассунуба жамийааан иннаҳу ҳува алғафуру арроҳийму
                Ваанийбу ила роббикум вааслиму лаҳу мин қабли ан йатийакуму алааасабу сумма ла тунсаруна
                Вайттабиаау аҳсана ма онзила илайкум мин роббикум мин қабли ан йатийакуму алааасабу бағтатан ваантум ла ташаауруна
                Ан тақула нафсун йа ҳасрата ааала ма фарратту фий жанби аллааҳи вайн кунту ламина ассахирийна
                Ау тақула лау анна аллааҳа ҳаданий лакунту мина алмуттақийна
                Ау тақула ҳийна тара алааасаба лау анна лий карратан фаакуна мина алмуҳсинийна
                Бала қад жаатка айатий факассабта биҳа вайстакбарта вакунта мина алкафирийна
                Вайаума алқийамати тара аллазийна касабу ааала аллааҳи вужуҳуҳум мусваддатун алайса фий жаҳаннама масван лилмутакаббирийна
                Вайунажжий аллааҳу аллазийна иттақау бимафазатиҳим ла йамассуҳуму ассуо вала ҳум йаҳзануна
                Аллааҳу халиқу кулли шайин ваҳува ааала кулли шайин вакийлун
                Лаҳу мақалийду ассамауати вааларди вааллазийна кафару биайати аллааҳи олайка ҳуму алхасируна
                Қул афағайра аллааҳи тамурунний ааабуду аййуҳа алжаҳилуна
                Валақад уҳийа илайка вайла аллазийна мин қаблика лайн ашракта лайаҳбатанна ааамалука валатакунанна мина алхасирийна
                Бали аллааҳа фаоаабуд вакун мина ашшакирийна
                Вама қадару аллааҳа ҳаққа қадриҳи вааларду жамийааан қабдатуҳу йаума алқийамати ваалссамауату матвиййатун бийамийниҳи субҳанаҳу ватаааала ааамма йушрикуна
                Вануфиха фий ассури фасааайқа ман фий ассамауати ваман фий аларди илла ман шаа аллааҳу сумма нуфиха фийҳи охра файса ҳум қийамун йансуруна
                Ваашрақати аларду бинури роббиҳа вауудиааа алкитабу важийа биалннабиййийна ваалшшуҳадай вақудийа байнаҳум биалҳаққи ваҳум ла йусламуна
                Ваууффийат куллу нафсин ма ааамилат ваҳува аааламу бима йафааалуна
                Васийқа аллазийна кафару ила жаҳаннама зумаран ҳатта иса жауҳа футиҳат абвабуҳа вақала лаҳум хазанатуҳа алам йатикум русулун минкум йатлуна ааалайкум айати роббикум вайунсирунакум лиқаа йаумикум ҳаса қалу бала валакин ҳаққат калимату алааасаби ааала алкафирийна
                Қийла одхулу абваба жаҳаннама халидийна фийҳа фабиса масва алмутакаббирийна
                Васийқа аллазийна иттақау роббаҳум ила алжаннати зумаран ҳатта иса жауҳа вафутиҳат абвабуҳа вақала лаҳум хазанатуҳа саламун ааалайкум тибтум фаодхулуҳа халидийна
                Вақалу алҳамду лиллаҳи аллазий садақана вааадаҳу вааврасана аларда натабаувао мина алжаннати ҳайсу нашао фаниаама ажру алааамилийна
                Ватара алмалайката ҳаффийна мин ҳаули алааарши йусаббиҳуна биҳамди роббиҳим вақудийа байнаҳум биалҳаққи вақийла алҳамду лиллаҳи робби алаааламийна
            """.trimIndent(),
        ),
        Surah(
            id = 40,
            arabicName = "غافر",
            latinName = "Ghafir",
            transliteration = """
                Ҳамийм
                Танзийлу алкитаби мина аллааҳи алааазийзи алааалийми
                Ғафири ассанби вақабили аттауби шадийди алааиқаби сий аттаули ла илаҳа илла ҳува илайҳи алмасийру
                Ма йужадилу фий айати аллааҳи илла аллазийна кафару фала йағрурка тақаллубуҳум фий албилади
                Кассабат қаблаҳум қауму нуҳин ваалаҳзабу мин бааадиҳим ваҳаммат куллу омматин бирасулиҳим лийахусуҳу важадалу биалбатили лийузиду биҳи алҳаққа фаахастуҳум факайфа кана ааиқаби
                Вакасалика ҳаққат калимату роббика ааала аллазийна кафару аннаҳум ашабу аннари
                Аллазийна йаҳмилуна алааарша ваман ҳаулаҳу йусаббиҳуна биҳамди роббиҳим вайуминуна биҳи вайастағфируна лиллазийна аману роббана васиаата кулла шайин роҳматан вааайлман файғфир лиллазийна табу вайттабааау сабийлака вақиҳим ааасаба алжаҳийми
                Роббана ваадхилҳум жаннати аааднин аллатий ваааадтаҳум ваман салаҳа мин абайҳим ваазважиҳим васурриййатиҳим иннака анта алааазийзу алҳакийму
                Вақиҳиму ассаййиати ваман тақи ассаййиати йаумайсин фақад роҳимтаҳу васалика ҳува алфаузу алааасийму
                Инна аллазийна кафару йунадауна ламақту аллааҳи акбару мин мақтикум анфусакум ис тудааауна ила алиймани фатакфуруна
                Қалу роббана аматтана иснатайни вааҳйайтана иснатайни файаатарафна бисунубина фаҳал ила хуружин мин сабийлин
                Саликум бианнаҳу иса дуааийа аллааҳу ваҳдаҳу кафартум вайн йушрак биҳи тумину фаалҳукму лиллаҳи алааалиййи алкабийри
                Ҳува аллазий йурийкум айатиҳи вайуназзилу лакум мина ассамай ризқан вама йатасаккару илла ман йунийбу
                Фаодаау аллааҳа мухлисийна лаҳу аддийна валау кариҳа алкафируна
                Рафийаау аддаражати су алааарши йулқий арруҳа мин амриҳи ааала ман йашао мин ааибадиҳи лийунсира йаума атталақи
                Йаума ҳум баризуна ла йахфа ааала аллааҳи минҳум шайон лимани алмулку алйаума лиллаҳи алваҳиди алқаҳҳари
                Алйаума тужза куллу нафсин бима касабат ла сулма алйаума инна аллааҳа сарийаау алҳисаби
                Ваансирҳум йаума алазифати иси алқулубу лада алҳанажири касимийна ма лилссалимийна мин ҳамиймин вала шафийааин йутааау
                Йаааламу хайната алааайуни вама тухфий ассудуру
                Вааллааҳу йақдий биалҳаққи вааллазийна йадаауна мин дуниҳи ла йақдуна бишайин инна аллааҳа ҳува ассамийаау албасийру
                Ауа лам йасийру фий аларди файансуру кайфа кана ааақибату аллазийна кану мин қаблиҳим кану ҳум ашадда минҳум қувватан ваасаран фий аларди фаахасаҳуму аллааҳу бисунубиҳим вама кана лаҳум мина аллааҳи мин вақин
                Салика бианнаҳум канат татийҳим русулуҳум биалбаййинати факафару фаахасаҳуму аллааҳу иннаҳу қауиййун шадийду алааиқаби
                Валақад арсална муса биайатина васултанин мубийнин
                Ила фирааауна ваҳамана вақаруна фақалу саҳирун кассабун
                Фаламма жааҳум биалҳаққи мин ааиндина қалу оқтулу абнаа аллазийна аману мааааҳу вайстаҳйу нисааҳум вама кайду алкафирийна илла фий далалин
                Вақала фирааауну саруний ақтул муса валйадаау роббаҳу инний ахафу ан йубаддила дийнакум ау ан йусҳира фий аларди алфасада
                Вақала муса инний ааусту бироббий вароббикум мин кулли мутакаббирин ла йумину бийауми алҳисаби
                Вақала ражулун муминун мин али фирааауна йактуму ийманаҳу атақтулуна ражулан ан йақула роббиййа аллааҳу вақад жаакум биалбаййинати мин роббикум вайн йаку касибан фаааалайҳи касибуҳу вайн йаку садиқан йусибкум баааду аллазий йааайдукум инна аллааҳа ла йаҳдий ман ҳува мусрифун кассабун
                Йа қауми лакуму алмулку алйаума саҳирийна фий аларди фаман йансуруна мин баси аллааҳи ин жаана қала фирааауну ма орийкум илла ма ара вама аҳдийкум илла сабийла аррашади
                Вақала аллазий амана йа қауми инний ахафу ааалайкум мисла йауми алаҳзаби
                Мисла даби қауми нуҳин ваааадин васамуда вааллазийна мин бааадиҳим вама аллааҳу йурийду сулман лилааибади
                Вайа қауми инний ахафу ааалайкум йаума аттанади
                Йаума туваллуна мудбирийна ма лакум мина аллааҳи мин ааасимин ваман йудлили аллааҳу фама лаҳу мин ҳадин
                Валақад жаакум йусуфу мин қаблу биалбаййинати фама зилтум фий шаккин мимма жаакум биҳи ҳатта иса ҳалака қултум лан йабаааса аллааҳу мин бааадиҳи расулан касалика йудиллу аллааҳу ман ҳува мусрифун муртабун
                Аллазийна йужадилуна фий айати аллааҳи биғайри султанин атаҳум кабура мақтан ааинда аллааҳи вааайнда аллазийна аману касалика йатбааау аллааҳу ааала кулли қалби мутакаббирин жаббарин
                Вақала фирааауну йа ҳаману ибни лий сарҳан лааааллий аблуғу аласбаба
                Асбаба ассамауати фаатталиааа ила илаҳи муса вайнний лаасуннуҳу касибан вакасалика зуййина лифирааауна суо ааамалиҳи васудда ааани ассабийли вама кайду фирааауна илла фий табабин
                Вақала аллазий амана йа қауми иттабиаауни аҳдикум сабийла аррашади
                Йа қауми иннама ҳасиҳи алҳайату аддунйа матаааун вайнна алахирата ҳийа дару алқарари
                Ман ааамила саййиатан фала йужза илла мислаҳа ваман ааамила салиҳан мин сакарин ау онса ваҳува муминун фаолайка йадхулуна алжанната йурзақуна фийҳа биғайри ҳисабин
                Вайа қауми ма лий адааукум ила аннажати ватадааунаний ила аннари
                Тадааунаний лиакфура биаллааҳи ваошрика биҳи ма лайса лий биҳи ааилмун ваана адааукум ила алааазийзи алғаффари
                Ла жарама аннама тадааунаний илайҳи лайса лаҳу дааауатун фий аддунйа вала фий алахирати ваанна мараддана ила аллааҳи ваанна алмусрифийна ҳум ашабу аннари
                Фасатаскуруна ма ақулу лакум ваофаувиду амрий ила аллааҳи инна аллааҳа басийрун биалааибади
                Фауақаҳу аллааҳу саййиати ма макару ваҳақа биали фирааауна суо алааасаби
                Аннару йуаарадуна ааалайҳа ғудувван ваааашиййан вайаума тақуму ассаааату адхилу ала фирааауна ашадда алааасаби
                Вайс йатаҳажжуна фий аннари файақулу аддуааафао лиллазийна истакбару инна кунна лакум табаааан фаҳал антум муғнуна ааанна насийбан мина аннари
                Қала аллазийна истакбару инна куллун фийҳа инна аллааҳа қад ҳакама байна алааибади
                Вақала аллазийна фий аннари лихазанати жаҳаннама одаау роббакум йухаффиф ааанна йауман мина алааасаби
                Қалу ауалам таку татийкум русулукум биалбаййинати қалу бала қалу фаодаау вама дуааао алкафирийна илла фий далалин
                Инна ланансуру русулана вааллазийна аману фий алҳайати аддунйа вайаума йақуму алашҳаду
                Йаума ла йанфааау ассалимийна мааасиратуҳум валаҳуму аллааанату валаҳум суо аддари
                Валақад атайна муса алҳуда вааврасна баний исраийла алкитаба
                Ҳудан васикра лиолий алалбаби
                Файсбир инна вааада аллааҳи ҳаққун вайстағфир лисанбика васаббиҳ биҳамди роббика биалааашиййи ваалибкари
                Инна аллазийна йужадилуна фий айати аллааҳи биғайри султанин атаҳум ин фий судуриҳим илла кибрун ма ҳум бибалиғийҳи файстааайс биаллааҳи иннаҳу ҳува ассамийаау албасийру
                Лахалқу ассамауати вааларди акбару мин халқи аннаси валакинна аксара аннаси ла йаааламуна
                Вама йастауий алааама ваалбасийру вааллазийна аману ваааамилу ассалиҳати вала алмусийо қалийлан ма татасаккаруна
                Инна ассаааата лаатийатун ла райба фийҳа валакинна аксара аннаси ла йуминуна
                Вақала роббукуму одаауний астажиб лакум инна аллазийна йастакбируна ааан ааибадатий сайадхулуна жаҳаннама дахирийна
                Аллааҳу аллазий жаааала лакуму аллайла литаскуну фийҳи ваалннаҳара мубсиран инна аллааҳа ласу фадлин ааала аннаси валакинна аксара аннаси ла йашкуруна
                Саликуму аллааҳу роббукум халиқу кулли шайин ла илаҳа илла ҳува фаанна туфакуна
                Касалика йуфаку аллазийна кану биайати аллааҳи йажҳадуна
                Аллааҳу аллазий жаааала лакуму аларда қараран ваалссамаа бинаан васауваракум фааҳсана суваракум варазақакум мина аттаййибати саликуму аллааҳу роббукум фатабарака аллааҳу роббу алаааламийна
                Ҳува алҳаййу ла илаҳа илла ҳува фаодаауҳу мухлисийна лаҳу аддийна алҳамду лиллаҳи робби алаааламийна
                Қул инний нуҳийту ан ааабуда аллазийна тадаауна мин дуни аллааҳи ламма жаанийа албаййинату мин роббий ваомирту ан ослима лиробби алаааламийна
                Ҳува аллазий халақакум мин туробин сумма мин нутфатин сумма мин ааалақатин сумма йухрижукум тифлан сумма литаблуғу ашуддакум сумма литакуну шуйухан ваминкум ман йутауаффа мин қаблу валитаблуғу ажалан мусамман валааааллакум тааақилуна
                Ҳува аллазий йуҳйий вайумийту файса қада амран файннама йақулу лаҳу кун файакуну
                Алам тара ила аллазийна йужадилуна фий айати аллааҳи анна йусрафуна
                Аллазийна кассабу биалкитаби вабима арсална биҳи русулана фасауфа йаааламуна
                Иси алағлалу фий ааанақиҳим ваалссаласилу йушабуна
                Фий алҳамийми сумма фий аннари йусжаруна
                Сумма қийла лаҳум айна ма кунтум тушрикуна
                Мин дуни аллааҳи қалу даллу ааанна бал лам накун надаау мин қаблу шайан касалика йудиллу аллааҳу алкафирийна
                Саликум бима кунтум тафроҳуна фий аларди биғайри алҳаққи вабима кунтум тамроҳуна
                Одхулу абваба жаҳаннама халидийна фийҳа фабиса масва алмутакаббирийна
                Файсбир инна вааада аллааҳи ҳаққун файмма нурийаннака бааада аллазий нааайдуҳум ау натауаффайаннака файлайна йуржааауна
                Валақад арсална русулан мин қаблика минҳум ман қасасна ааалайка ваминҳум ман лам нақсус ааалайка вама кана лирасулин ан йатийа биайатин илла бийсни аллааҳи файса жаа амру аллааҳи қудийа биалҳаққи вахасира ҳуналика алмубтилуна
                Аллааҳу аллазий жаааала лакуму аланааама литаркабу минҳа ваминҳа такулуна
                Валакум фийҳа манафиаау валитаблуғу ааалайҳа ҳажатан фий судурикум ваааалайҳа ваааала алфулки туҳмалуна
                Вайурийкум айатиҳи фааййа айати аллааҳи тункируна
                Афалам йасийру фий аларди файансуру кайфа кана ааақибату аллазийна мин қаблиҳим кану аксара минҳум ваашадда қувватан ваасаран фий аларди фама ағна ааанҳум ма кану йаксибуна
                Фаламма жаасум русулуҳум биалбаййинати фариҳу бима ааиндаҳум мина алааилми ваҳақа биҳим ма кану биҳи йастаҳзиуна
                Фаламма раав басана қалу аманна биаллааҳи ваҳдаҳу вакафарна бима кунна биҳи мушрикийна
                Фалам йаку йанфааауҳум иймануҳум ламма раав басана сунната аллааҳи аллатий қад халат фий ааибадиҳи вахасира ҳуналика алкафируна
            """.trimIndent(),
        ),
        Surah(
            id = 41,
            arabicName = "فصلت",
            latinName = "Fussilat",
            transliteration = """
                Ҳамийм
                Танзийлун мина арроҳмани арроҳийми
                Китабун фуссилат айатуҳу қуранан аааробиййан лиқаумин йаааламуна
                Башийран ванасийран фаааарада аксаруҳум фаҳум ла йасмааауна
                Вақалу қулубуна фий акиннатин мимма тадаауна илайҳи вафий асанина вақрун вамин байнина вабайника ҳижабун файаамал иннана ааамилуна
                Қул иннама ана башарун мислукум йуҳа илаййа аннама илаҳукум илаҳун ваҳидун файстақийму илайҳи вайстағфируҳу вауайлун лилмушрикийна
                Аллазийна ла йутуна аззаката ваҳум биалахирати ҳум кафируна
                Инна аллазийна аману ваааамилу ассалиҳати лаҳум ажрун ғайру мамнунин
                Қул айннакум латакфуруна биаллазий халақа аларда фий йаумайни ватажааалуна лаҳу андадан салика роббу алаааламийна
                Важаааала фийҳа рауасийа мин фауқиҳа вабарака фийҳа вақаддара фийҳа ақватаҳа фий арбаааати аййамин сауаан лилссайлийна
                Сумма истауа ила ассамай ваҳийа духанун фақала лаҳа валиларди итийа тауааан ау карҳан қалата атайна тайааийна
                Фақадаҳунна сабааа самауатин фий йаумайни ваавҳа фий кулли самайн амроҳа вазаййанна ассамаа аддунйа бимасабийҳа ваҳифсан салика тақдийру алааазийзи алааалийми
                Файн ааараду фуқул ансартукум сааайқатан мисла сааайқати ааадин васамуда
                Ис жаасуму аррусулу мин байни айдийҳим вамин халфиҳим алла тааабуду илла аллааҳа қалу лау шаа роббуна лаанзала малайкатан файнна бима орсилтум биҳи кафируна
                Фаамма ааадун файстакбару фий аларди биғайри алҳаққи вақалу ман ашадду минна қувватан ауалам йарау анна аллааҳа аллазий халақаҳум ҳува ашадду минҳум қувватан вакану биайатина йажҳадуна
                Фаарсална ааалайҳим рийҳан сарсаран фий аййамин наҳисатин линусийқаҳум ааасаба алхизйи фий алҳайати аддунйа валаааасабу алахирати ахза ваҳум ла йунсаруна
                Ваамма самуду фаҳадайнаҳум файстаҳаббу алааама ааала алҳуда фаахасасум сааайқату алааасаби алҳуни бима кану йаксибуна
                Ванажжайна аллазийна аману вакану йаттақуна
                Вайаума йуҳшару ааадао аллааҳи ила аннари фаҳум йузааауна
                Ҳатта иса ма жауҳа шаҳида ааалайҳим самаауҳум ваабсаруҳум важулудуҳум бима кану йааамалуна
                Вақалу лижулудиҳим лима шаҳидтум ааалайна қалу антақана аллааҳу аллазий антақа кулла шайин ваҳува халақакум аувала марратин вайлайҳи туржааауна
                Вама кунтум тастатируна ан йашҳада ааалайкум самааукум вала абсарукум вала жулудукум валакин санантум анна аллааҳа ла йаааламу касийран мимма тааамалуна
                Васаликум саннукуму аллазий санантум бироббикум ардакум фаасбаҳтум мина алхасирийна
                Файн йасбиру фаалннару масван лаҳум вайн йастааатибу фама ҳум мина алмуаатабийна
                Вақаййадна лаҳум қуранаа фазаййану лаҳум ма байна айдийҳим вама халфаҳум ваҳаққа ааалайҳиму алқаулу фий омамин қад халат мин қаблиҳим мина алжинни ваалинси иннаҳум кану хасирийна
                Вақала аллазийна кафару ла тасмааау лиҳаса алқурани вайлғау фийҳи лааааллакум тағлибуна
                Фаланусийқанна аллазийна кафару ааасабан шадийдан валанажзийаннаҳум асваа аллазий кану йааамалуна
                Салика жазао ааадай аллааҳи аннару лаҳум фийҳа дару алхулди жазаан бима кану биайатина йажҳадуна
                Вақала аллазийна кафару роббана арина аллазайни адаллана мина алжинни ваалинси нажааалҳума таҳта ақдамина лийакуна мина аласфалийна
                Инна аллазийна қалу роббуна аллааҳу сумма истақаму татаназзалу ааалайҳиму алмалайкату алла тахафу вала таҳзану ваабширу биалжаннати аллатий кунтум туааадуна
                Наҳну аулийаокум фий алҳайати аддунйа вафий алахирати валакум фийҳа ма таштаҳий анфусукум валакум фийҳа ма таддааауна
                Нузулан мин ғафурин роҳиймин
                Ваман аҳсану қаулан мимман даааа ила аллааҳи ваааамила салиҳан вақала иннаний мина алмуслимийна
                Вала тастауий алҳасанату вала ассаййиату идфааа биаллатий ҳийа аҳсану файса аллазий байнака вабайнаҳу ааадауатун кааннаҳу валиййун ҳамиймун
                Вама йулаққаҳа илла аллазийна сабару вама йулаққаҳа илла су ҳассин ааасиймин
                Ваймма йанзағаннака мина ашшайтани назғун файстааайс биаллааҳи иннаҳу ҳува ассамийаау алааалийму
                Вамин айатиҳи аллайлу ваалннаҳару ваалшшамсу ваалқамару ла тасжуду лилшшамси вала лилқамари ваосжуду лиллаҳи аласий халақаҳунна ин кунтум иййаҳу тааабудуна
                Файни истакбару фааллазийна ааинда роббика йусаббиҳуна лаҳу биаллайли ваалннаҳари ваҳум ла йасамуна
                Вамин айатиҳи аннака тара аларда хашиааатан файса анзална ааалайҳа алмаа иҳтаззат варобат инна аллазий аҳйаҳа ламуҳйий алмаута иннаҳу ааала кулли шайин қадийрун
                Инна аллазийна йулҳидуна фий айатина ла йахфауна ааалайна афаман йулқа фий аннари хайрун ам ман йатий аминан йаума алқийамати иаамалу ма шитум иннаҳу бима тааамалуна басийрун
                Инна аллазийна кафару биалссикри ламма жааҳум вайннаҳу лакитабун ааазийзун
                Ла йатийҳи албатилу мин байни йадайҳи вала мин халфиҳи танзийлун мин ҳакиймин ҳамийдин
                Ма йуқалу лака илла ма қад қийла лилррусули мин қаблика инна роббака ласу мағфиратин васу ааиқабин алиймин
                Валау жаааалнаҳу қуранан ааажамиййан лақалу лаула фуссилат айатуҳу аааажамиййун вааааробиййун қул ҳува лиллазийна аману ҳудан вашифаон вааллазийна ла йуминуна фий асаниҳим вақрун ваҳува ааалайҳим аааман олайка йунадауна мин маканин баааийдин
                Валақад атайна муса алкитаба файхтулифа фийҳи валаула калиматун сабақат мин роббика лақудийа байнаҳум вайннаҳум лафий шаккин минҳу мурийбин
                Ман ааамила салиҳан фалинафсиҳи ваман асаа фаааалайҳа вама роббука бисалламин лилааабийди
                Илайҳи йурадду ааилму ассаааати вама тахружу мин самаратин мин акмамиҳа вама таҳмилу мин онса вала тадааау илла биааилмиҳи вайаума йунадийҳим айна шуракаий қалу асаннака ма минна мин шаҳийдин
                Вадалла ааанҳум ма кану йадаауна мин қаблу васанну ма лаҳум мин маҳийсин
                Ла йасаму алинсану мин дуааай алхайри вайн массаҳу ашшарру файаусун қанутун
                Валайн асақнаҳу роҳматан минна мин бааади дарраа массасу лайақуланна ҳаса лий вама асунну ассаааата қайматан валайн ружиаату ила роббий инна лий ааиндаҳу лалҳусна фаланунаббианна аллазийна кафару бима ааамилу валанусийқаннаҳум мин ааасабин ғалийсин
                Вайса анааамна ааала алинсани ааарада ванаа бижанибиҳи вайса массаҳу ашшарру фасу дуааайн ааарийдин
                Қул араайтум ин кана мин ааинди аллааҳи сумма кафартум биҳи ман адаллу мимман ҳува фий шиқақин баааийдин
                Санурийҳим айатина фий алафақи вафий анфусиҳим ҳатта йатабаййана лаҳум аннаҳу алҳаққу ауалам йакфи бироббика аннаҳу ааала кулли шайин шаҳийдун
                Ала иннаҳум фий мирйатин мин лиқай роббиҳим ала иннаҳу бикулли шайин муҳийтун
            """.trimIndent(),
        ),
        Surah(
            id = 42,
            arabicName = "الشورى",
            latinName = "Ash-Shuraa",
            transliteration = """
                Ҳамийм
                Ааайнсийнқаф
                Касалика йуҳий илайка вайла аллазийна мин қаблика аллааҳу алааазийзу алҳакийму
                Лаҳу ма фий ассамауати вама фий аларди ваҳува алааалиййу алааасийму
                Такаду ассамауату йатафаттарна мин фауқиҳинна ваалмалайкату йусаббиҳуна биҳамди роббиҳим вайастағфируна лиман фий аларди ала инна аллааҳа ҳува алғафуру арроҳийму
                Вааллазийна иттахасу мин дуниҳи аулийаа аллааҳу ҳафийсун ааалайҳим вама анта ааалайҳим бивакийлин
                Вакасалика ауҳайна илайка қуранан аааробиййан литунсира омма алқура ваман ҳаулаҳа ватунсира йаума алжамааи ла райба фийҳи фарийқун фий алжаннати вафарийқун фий ассаааийри
                Валау шаа аллааҳу лажаааалаҳум омматан ваҳидатан валакин йудхилу ман йашао фий роҳматиҳи ваалссалимуна ма лаҳум мин валиййин вала насийрин
                Ами иттахасу мин дуниҳи аулийаа фааллааҳу ҳува алвалиййу ваҳува йуҳйий алмаута ваҳува ааала кулли шайин қадийрун
                Вама ихталафтум фийҳи мин шайин фаҳукмуҳу ила аллааҳи саликуму аллааҳу роббий ааалайҳи тауаккалту вайлайҳи онийбу
                Фатиру ассамауати вааларди жаааала лакум мин анфусикум азважан вамина аланааами азважан йасраокум фийҳи лайса камислиҳи шайон ваҳува ассамийаау албасийру
                Лаҳу мақалийду ассамауати вааларди йабсуту арризқа лиман йашао вайақдиру иннаҳу бикулли шайин ааалиймун
                Шараааа лакум мина аддийни ма васса биҳи нуҳан вааллазий ауҳайна илайка вама вассайна биҳи иброҳийма вамуса ваааийса ан ақийму аддийна вала татафаррақу фийҳи кабура ааала алмушрикийна ма тадаауҳум илайҳи аллааҳу йажтабий илайҳи ман йашао вайаҳдий илайҳи ман йунийбу
                Вама тафаррақу илла мин бааади ма жааҳуму алааилму бағйан байнаҳум валаула калиматун сабақат мин роббика ила ажалин мусамман лақудийа байнаҳум вайнна аллазийна урису алкитаба мин бааадиҳим лафий шаккин минҳу мурийбин
                Фалисалика фаодаау вайстақим кама омирта вала таттабиаа аҳвааҳум вақул аманту бима анзала аллааҳу мин китабин ваомирту лиааадила байнакум аллааҳу роббуна вароббукум лана ааамалуна валакум ааамалукум ла ҳужжата байнана вабайнакуму аллааҳу йажмааау байнана вайлайҳи алмасийру
                Вааллазийна йуҳажжуна фий аллааҳи мин бааади ма истужийба лаҳу ҳужжатуҳум даҳидатун ааинда роббиҳим ваааалайҳим ғадабун валаҳум ааасабун шадийдун
                Аллааҳу аллазий анзала алкитаба биалҳаққи ваалмийзани вама йудрийка лаааалла ассаааата қарийбун
                Йастааажилу биҳа аллазийна ла йуминуна биҳа вааллазийна аману мушфиқуна минҳа вайаааламуна аннаҳа алҳаққу ала инна аллазийна йумаруна фий ассаааати лафий далалин баааийдин
                Аллааҳу латийфун биааибадиҳи йарзуқу ман йашао ваҳува алқауиййу алааазийзу
                Ман кана йурийду ҳарса алахирати назид лаҳу фий ҳарсиҳи ваман кана йурийду ҳарса аддунйа нутиҳи минҳа вама лаҳу фий алахирати мин насийбин
                Ам лаҳум шуракао шарааау лаҳум мина аддийни ма лам йасан биҳи аллааҳу валаула калимату алфасли лақудийа байнаҳум вайнна ассалимийна лаҳум ааасабун алиймун
                Тара ассалимийна мушфиқийна мимма касабу ваҳува вақиааун биҳим вааллазийна аману ваааамилу ассалиҳати фий раудати алжаннати лаҳум ма йашауна ааинда роббиҳим салика ҳува алфадлу алкабийру
                Салика аллазий йубашширу аллааҳу ааибадаҳу аллазийна аману ваааамилу ассалиҳати қул ла асалукум ааалайҳи ажран илла алмауаддата фий алқурба ваман йақтариф ҳасанатан назид лаҳу фийҳа ҳуснан инна аллааҳа ғафурун шакурун
                Ам йақулуна ифтара ааала аллааҳи касибан файн йашай аллааҳу йахтим ааала қалбика вайамҳу аллааҳу албатила вайуҳиққу алҳаққа бикалиматиҳи иннаҳу ааалиймун бисати ассудури
                Ваҳува аллазий йақбалу аттаубата ааан ааибадиҳи вайааафу ааани ассаййиати вайаааламу ма тафааалуна
                Вайастажийбу аллазийна аману ваааамилу ассалиҳати вайазийдуҳум мин фадлиҳи ваалкафируна лаҳум ааасабун шадийдун
                Валау басата аллааҳу арризқа лиааибадиҳи лабағау фий аларди валакин йуназзилу биқадарин ма йашао иннаҳу биааибадиҳи хабийрун басийрун
                Ваҳува аллазий йуназзилу алғайса мин бааади ма қанату вайаншуру роҳматаҳу ваҳува алвалиййу алҳамийду
                Вамин айатиҳи халқу ассамауати вааларди вама басса фийҳима мин даббатин ваҳува ааала жамааиҳим иса йашао қадийрун
                Вама асабакум мин мусийбатин фабима касабат айдийкум вайааафу ааан касийрин
                Вама антум бимуаажизийна фий аларди вама лакум мин дуни аллааҳи мин валиййин вала насийрин
                Вамин айатиҳи алжауари фий албаҳри каалааалами
                Ин йаша йускини аррийҳа файаслална рауакида ааала саҳриҳи инна фий салика лаайатин ликулли саббарин шакурин
                Ау йубиқҳунна бима касабу вайааафу ааан касийрин
                Вайааалама аллазийна йужадилуна фий айатина ма лаҳум мин маҳийсин
                Фама утийтум мин шайин фаматааау алҳайати аддунйа вама ааинда аллааҳи хайрун ваабқа лиллазийна аману ваааала роббиҳим йатауаккалуна
                Вааллазийна йажтанибуна кабайра алисми ваалфауаҳиша вайса ма ғадибу ҳум йағфируна
                Вааллазийна истажабу лироббиҳим ваақаму ассалата ваамруҳум шура байнаҳум вамимма разақнаҳум йунфиқуна
                Вааллазийна иса асабаҳуму албағйу ҳум йантасируна
                Важазао саййиатин саййиатун мислуҳа фаман ааафа вааслаҳа фаажруҳу ааала аллааҳи иннаҳу ла йуҳиббу ассалимийна
                Валамани интасара бааада сулмиҳи фаолайка ма ааалайҳим мин сабийлин
                Иннама ассабийлу ааала аллазийна йаслимуна аннаса вайабғуна фий аларди биғайри алҳаққи олайка лаҳум ааасабун алиймун
                Валаман сабара вағафара инна салика ламин ааазми аломури
                Ваман йудлили аллааҳу фама лаҳу мин валиййин мин бааадиҳи ватара ассалимийна ламма рааву алааасаба йақулуна ҳал ила мараддин мин сабийлин
                Ватароҳум йуаарадуна ааалайҳа хашиааийна мина ассулли йансуруна мин тарфин хафиййин вақала аллазийна аману инна алхасирийна аллазийна хасиру анфусаҳум вааҳлийҳим йаума алқийамати ала инна ассалимийна фий ааасабин муқиймин
                Вама кана лаҳум мин аулийаа йансурунаҳум мин дуни аллааҳи ваман йудлили аллааҳу фама лаҳу мин сабийлин
                Истажийбу лироббикум мин қабли ан йатийа йаумун ла марадда лаҳу мина аллааҳи ма лакум мин малжайн йаумайсин вама лакум мин накийрин
                Файн ааараду фама арсалнака ааалайҳим ҳафийсан ин ааалайка илла албалағу вайнна иса асақна алинсана минна роҳматан фариҳа биҳа вайн тусибҳум саййиатун бима қаддамат айдийҳим файнна алинсана кафурун
                Лиллаҳи мулку ассамауати вааларди йахлуқу ма йашао йаҳабу лиман йашао инасан вайаҳабу лиман йашао ассукура
                Ау йузаувижуҳум сукранан вайнасан вайажааалу ман йашао ааақийман иннаҳу ааалиймун қадийрун
                Вама кана либашарин ан йукаллимаҳу аллааҳу илла ваҳйан ау мин варай ҳижабин ау йурсила расулан файуҳийа бийсниҳи ма йашао иннаҳу ааалиййун ҳакиймун
                Вакасалика ауҳайна илайка руҳан мин амрина ма кунта тадрий ма алкитабу вала алийману валакин жаааалнаҳу нуран наҳдий биҳи ман нашао мин ааибадина вайннака латаҳдий ила сиратин мустақиймин
                Сирати аллааҳи аллазий лаҳу ма фий ассамауати вама фий аларди ала ила аллааҳи тасийру аломуру
            """.trimIndent(),
        ),
        Surah(
            id = 43,
            arabicName = "الزخرف",
            latinName = "Az-Zukhruf",
            transliteration = """
                Ҳамийм
                Ваалкитаби алмубийни
                Инна жаааалнаҳу қуранан аааробиййан лааааллакум тааақилуна
                Вайннаҳу фий омми алкитаби ладайна лаааалиййун ҳакиймун
                Афанадрибу ааанкуму ассикра сафҳан ан кунтум қауман мусрифийна
                Вакам арсална мин набиййин фий алаувалийна
                Вама йатийҳим мин набиййин илла кану биҳи йастаҳзиуна
                Фааҳлакна ашадда минҳум батшан вамада масалу алаувалийна
                Валайн саалтаҳум ман халақа ассамауати вааларда лайақулунна халақаҳунна алааазийзу алааалийму
                Аллазий жаааала лакуму аларда маҳдан важаааала лакум фийҳа субулан лааааллакум таҳтадуна
                Вааллазий наззала мина ассамай маан биқадарин фааншарна биҳи балдатан майтан касалика тухражуна
                Вааллазий халақа алазважа куллаҳа важаааала лакум мина алфулки вааланааами ма таркабуна
                Литастауу ааала суҳуриҳи сумма таскуру ниаамата роббикум иса истауайтум ааалайҳи ватақулу субҳана аллазий саххара лана ҳаса вама кунна лаҳу муқринийна
                Вайнна ила роббина ламунқалибуна
                Важаааалу лаҳу мин ааибадиҳи жузан инна алинсана лакафурун мубийнун
                Ами иттахаса мимма йахлуқу банатин ваасфакум биалбанийна
                Вайса бушшира аҳадуҳум бима дароба лилрроҳмани масалан салла важҳуҳу мусваддан ваҳува касиймун
                Ауаман йунашшао фий алҳилйати ваҳува фий алхисами ғайру мубийнин
                Важаааалу алмалайката аллазийна ҳум ааибаду арроҳмани инасан ашаҳиду халқаҳум сатуктабу шаҳадатуҳум вайусалуна
                Вақалу лау шаа арроҳману ма ааабаднаҳум ма лаҳум бисалика мин ааилмин ин ҳум илла йахрусуна
                Ам атайнаҳум китабан мин қаблиҳи фаҳум биҳи мустамсикуна
                Бал қалу инна важадна абаана ааала омматин вайнна ааала асариҳим муҳтадуна
                Вакасалика ма арсална мин қаблика фий қарйатин мин насийрин илла қала мутрафуҳа инна важадна абаана ааала омматин вайнна ааала асариҳим муқтадуна
                Қала ауалау житукум биаҳда мимма важадтум ааалайҳи абаакум қалу инна бима орсилтум биҳи кафируна
                Файнтақамна минҳум фаонсур кайфа кана ааақибату алмукассибийна
                Вайс қала иброҳийму лиабийҳи вақаумиҳи иннаний бараон мимма тааабудуна
                Илла аллазий фатараний файннаҳу сайаҳдийни
                Важаааалаҳа калиматан бақийатан фий ааақибиҳи лааааллааҳум йаржиаауна
                Бал маттааату ҳаолай ваабааҳум ҳатта жааҳуму алҳаққу варасулун мубийнун
                Валамма жааҳуму алҳаққу қалу ҳаса сиҳрун вайнна биҳи кафируна
                Вақалу лаула нуззила ҳаса алқурану ааала ражулин мина алқарйатайни ааасиймун
                Аҳум йақсимуна роҳмата роббика наҳну қасамна байнаҳум маааийшатаҳум фий алҳайати аддунйа варафааана бааадаҳум фауқа бааадин даражатин лийаттахиса бааадуҳум бааадан сухриййан вароҳмату роббика хайрун мимма йажмааауна
                Валаула ан йакуна аннасу омматан ваҳидатан лажаааална лиман йакфуру биалрроҳмани либуйутиҳим суқуфан мин фиддатин вамаааарижа ааалайҳа йасҳаруна
                Валибуйутиҳим абвабан васуруран ааалайҳа йаттакиуна
                Вазухруфан вайн куллу салика ламма матааау алҳайати аддунйа ваалахирату ааинда роббика лилмуттақийна
                Ваман йааашу ааан сикри арроҳмани нуқаййид лаҳу шайтанан фаҳува лаҳу қарийнун
                Вайннаҳум лайасуддунаҳум ааани ассабийли вайаҳсабуна аннаҳум муҳтадуна
                Ҳатта иса жаана қала йа лайта байний вабайнака буаада алмашриқайни фабиса алқарийну
                Валан йанфаааакуму алйаума ис саламтум аннакум фий алааасаби муштарикуна
                Афаанта тусмиаау ассумма ау таҳдий алааумйа ваман кана фий далалин мубийнин
                Файмма насҳабанна бика файнна минҳум мунтақимуна
                Ау нурийаннака аллазий вааааднаҳум файнна ааалайҳим муқтадируна
                Файстамсик биаллазий уҳийа илайка иннака ааала сиратин мустақиймин
                Вайннаҳу ласикрун лака валиқаумика васауфа тусалуна
                Вайсал ман арсална мин қаблика мин русулина ажаааална мин дуни арроҳмани алиҳатан йуаабадуна
                Валақад арсална муса биайатина ила фирааауна вамалайҳи фақала инний расулу робби алаааламийна
                Фаламма жааҳум биайатина иса ҳум минҳа йазакуна
                Вама нурийҳим мин айатин илла ҳийа акбару мин охтиҳа ваахаснаҳум биалааасаби лааааллааҳум йаржиаауна
                Вақалу йа аййуҳа алсаҳиру одаау лана роббака бима аааҳида ааиндака иннана ламуҳтадуна
                Фаламма кашафна ааанҳуму алааасаба иса ҳум йанкусуна
                Ванада фирааауну фий қаумиҳи қала йа қауми алайса лий мулку мисра ваҳасиҳи аланҳару тажрий мин таҳтий афала тубсируна
                Ам ана хайрун мин ҳаса аллазий ҳува маҳийнун вала йакаду йубийну
                Фалаула олқийа ааалайҳи асвиратун мин саҳабин ау жаа мааааҳу алмалайкату муқтаринийна
                Файстахаффа қаумаҳу фаатааауҳу иннаҳум кану қауман фасиқийна
                Фаламма асафуна интақамна минҳум фаағрақнаҳум ажмаааийна
                Фажаааалнаҳум салафан вамасалан лилахирийна
                Валамма дуриба ибну марйама масалан иса қаумука минҳу йасиддуна
                Вақалу аалиҳатуна хайрун ам ҳува ма даробуҳу лака илла жадалан бал ҳум қаумун хасимуна
                Ин ҳува илла ааабдун анааамна ааалайҳи важаааалнаҳу масалан либаний исраийла
                Валау нашао лажаааална минкум малайкатан фий аларди йахлуфуна
                Вайннаҳу лааайлмун лилссаааати фала тамтарунна биҳа вайттабиаауни ҳаса сиратун мустақиймун
                Вала йасудданнакуму ашшайтану иннаҳу лакум ааадуввун мубийнун
                Валамма жаа ааийса биалбаййинати қала қад житукум биалҳикмати валиобаййина лакум бааада аллазий тахталифуна фийҳи файттақу аллааҳа ваатийаауни
                Инна аллааҳа ҳува роббий вароббукум фаоаабудуҳу ҳаса сиратун мустақиймун
                Файхталафа алаҳзабу мин байниҳим фауайлун лиллазийна саламу мин ааасаби йаумин алиймин
                Ҳал йансуруна илла ассаааата ан татийаҳум бағтатан ваҳум ла йашаауруна
                Алахиллао йаумайсин бааадуҳум либааадин ааадуввун илла алмуттақийна
                Йа ааибади ла хауфун ааалайкуму алйаума вала антум таҳзануна
                Аллазийна аману биайатина вакану муслимийна
                Одхулу алжанната антум ваазважукум туҳбаруна
                Йутафу ааалайҳим бисиҳафин мин саҳабин вааквабин вафийҳа ма таштаҳийҳи аланфусу ваталассу алааайуну ваантум фийҳа халидуна
                Ватилка алжаннату аллатий уристумуҳа бима кунтум тааамалуна
                Лакум фийҳа факиҳатун касийратун минҳа такулуна
                Инна алмужримийна фий ааасаби жаҳаннама халидуна
                Ла йуфаттару ааанҳум ваҳум фийҳи мублисуна
                Вама саламнаҳум валакин кану ҳуму ассалимийна
                Ванадау йа малику лийақди ааалайна роббука қала иннакум макисуна
                Лақад жинакум биалҳаққи валакинна аксаракум лилҳаққи кариҳуна
                Ам абраму амран файнна мубримуна
                Ам йаҳсабуна анна ла насмааау сирроҳум ванажваҳум бала варусулуна ладайҳим йактубуна
                Қул ин кана лилрроҳмани валадун фаана аувалу алааабидийна
                Субҳана робби ассамауати вааларди робби алааарши ааамма йасифуна
                Фасарҳум йахуду вайалааабу ҳатта йулақу йаумаҳуму аллазий йуааадуна
                Ваҳува аллазий фий ассамай илаҳун вафий аларди илаҳун ваҳува алҳакийму алааалийму
                Ватабарака аллазий лаҳу мулку ассамауати вааларди вама байнаҳума вааайндаҳу ааилму ассаааати вайлайҳи туржааауна
                Вала йамлику аллазийна йадаауна мин дуниҳи ашшафаааата илла ман шаҳида биалҳаққи ваҳум йаааламуна
                Валайн саалтаҳум ман халақаҳум лайақулунна аллааҳу фаанна йуфакуна
                Вақийлиҳи йаробби инна ҳаолай қаумун ла йуминуна
                Файсфаҳ ааанҳум вақул саламун фасауфа йаааламуна
            """.trimIndent(),
        ),
        Surah(
            id = 44,
            arabicName = "الدخان",
            latinName = "Ad-Dukhan",
            transliteration = """
                Ҳамийм
                Ваалкитаби алмубийни
                Инна анзалнаҳу фий лайлатин мубаракатин инна кунна мунсирийна
                Фийҳа йуфрақу куллу амрин ҳакиймин
                Амран мин ааиндина инна кунна мурсилийна
                Роҳматан мин роббика иннаҳу ҳува ассамийаау алааалийму
                Робби ассамауати вааларди вама байнаҳума ин кунтум муқинийна
                Ла илаҳа илла ҳува йуҳйий вайумийту роббукум вароббу абайкуму алаувалийна
                Бал ҳум фий шаккин йалааабуна
                Файртақиб йаума татий ассамао бидуханин мубийнин
                Йағша аннаса ҳаса ааасабун алиймун
                Роббана икшиф ааанна алааасаба инна муминуна
                Анна лаҳуму ассикра вақад жааҳум расулун мубийнун
                Сумма тауаллау ааанҳу вақалу муааалламун мажнунун
                Инна кашифу алааасаби қалийлан иннакум ааайдуна
                Йаума набтишу албатшата алкубра инна мунтақимуна
                Валақад фатанна қаблаҳум қаума фирааауна важааҳум расулун кариймун
                Ан адду илаййа ааибада аллааҳи инний лакум расулун амийнун
                Ваан ла тааалу ааала аллааҳи инний атийкум бисултанин мубийнин
                Вайнний ааусту бироббий вароббикум ан таржумуни
                Вайн лам тумину лий файаатазилуни
                Фадаааа роббаҳу анна ҳаолай қаумун мужримуна
                Фаасри биааибадий лайлан иннакум муттабааауна
                Ваотруки албаҳра роҳван иннаҳум жундун муғрақуна
                Кам тараку мин жаннатин вааауйунин
                Вазуруааин вамақамин кариймин
                Ванаааматин кану фийҳа факиҳийна
                Касалика ваавраснаҳа қауман ахарийна
                Фама бакат ааалайҳиму ассамао вааларду вама кану мунсарийна
                Валақад нажжайна баний исраийла мина алааасаби алмуҳийни
                Мин фирааауна иннаҳу кана ааалийан мина алмусрифийна
                Валақади ихтарнаҳум ааала ааилмин ааала алаааламийна
                Ваатайнаҳум мина алайати ма фийҳи балаон мубийнун
                Инна ҳаолай лайақулуна
                Ин ҳийа илла маутатуна алула вама наҳну бимуншарийна
                Фату биабайна ин кунтум садиқийна
                Аҳум хайрун ам қауму туббааайн вааллазийна мин қаблиҳим аҳлакнаҳум иннаҳум кану мужримийна
                Вама халақна ассамауати вааларда вама байнаҳума лааайбийна
                Ма халақнаҳума илла биалҳаққи валакинна аксароҳум ла йаааламуна
                Инна йаума алфасли мийқатуҳум ажмаааийна
                Йаума ла йуғний маулан ааан маулан шайан вала ҳум йунсаруна
                Илла ман роҳима аллааҳу иннаҳу ҳува алааазийзу арроҳийму
                Инна шажарата аззаққуми
                Тааааму аласийми
                Каалмуҳли йағлий фий албутуни
                Кағалйи алҳамийми
                Хусуҳу файаатилуҳу ила сауай алжаҳийми
                Сумма суббу фауқа расиҳи мин ааасаби алҳамийми
                Суқ иннака анта алааазийзу алкарийму
                Инна ҳаса ма кунтум биҳи тамтаруна
                Инна алмуттақийна фий мақамин амийнин
                Фий жаннатин вааауйунин
                Йалбасуна мин сундусин вайстабрақин мутақабилийна
                Касалика вазауважнаҳум биҳурин ааийнин
                Йадаауна фийҳа бикулли факиҳатин аминийна
                Ла йасуқуна фийҳа алмаута илла алмаутата алула вауақаҳум ааасаба алжаҳийми
                Фадлан мин роббика салика ҳува алфаузу алааасийму
                Файннама йассарнаҳу билисаника лааааллааҳум йатасаккаруна
                Файртақиб иннаҳум муртақибуна
            """.trimIndent(),
        ),
        Surah(
            id = 45,
            arabicName = "الجاثية",
            latinName = "Al-Jathiyah",
            transliteration = """
                Ҳамийм
                Танзийлу алкитаби мина аллааҳи алааазийзи алҳакийми
                Инна фий ассамауати вааларди лаайатин лилмуминийна
                Вафий халқикум вама йабуссу мин даббатин айатун лиқаумин йуқинуна
                Вайхтилафи аллайли ваалннаҳари вама анзала аллааҳу мина ассамай мин ризқин фааҳйа биҳи аларда бааада маутиҳа ватасрийфи аррийаҳи айатун лиқаумин йааақилуна
                Тилка айату аллааҳи натлуҳа ааалайка биалҳаққи фабиаййи ҳадийсин бааада аллааҳи ваайатиҳи йуминуна
                Вайлун ликулли аффакин асиймин
                Йасмааау айати аллааҳи тутла ааалайҳи сумма йусирру мустакбиран каан лам йасмаааҳа фабашширҳу биааасабин алиймин
                Вайса ааалима мин айатина шайан иттахасаҳа ҳузуван олайка лаҳум ааасабун муҳийнун
                Мин варайҳим жаҳаннаму вала йуғний ааанҳум ма касабу шайан вала ма иттахасу мин дуни аллааҳи аулийаа валаҳум ааасабун ааасиймун
                Ҳаса ҳудан вааллазийна кафару биайати роббиҳим лаҳум ааасабун мин рижзин алиймин
                Аллааҳу аллазий саххара лакуму албаҳра литажрийа алфулку фийҳи биамриҳи валитабтағу мин фадлиҳи валааааллакум ташкуруна
                Васаххара лакум ма фий ассамауати вама фий аларди жамийааан минҳу инна фий салика лаайатин лиқаумин йатафаккаруна
                Қул лиллазийна аману йағфиру лиллазийна ла йаржуна аййама аллааҳи лийажзийа қауман бима кану йаксибуна
                Ман ааамила салиҳан фалинафсиҳи ваман асаа фаааалайҳа сумма ила роббикум туржааауна
                Валақад атайна баний исраийла алкитаба ваалҳукма ваалннубуввата варазақнаҳум мина аттаййибати вафаддалнаҳум ааала алаааламийна
                Ваатайнаҳум баййинатин мина аламри фама ихталафу илла мин бааади ма жааҳуму алааилму бағйан байнаҳум инна роббака йақдий байнаҳум йаума алқийамати фийма кану фийҳи йахталифуна
                Сумма жаааалнака ааала шарийааатин мина аламри файттабиааҳа вала таттабиаа аҳваа аллазийна ла йаааламуна
                Иннаҳум лан йуғну ааанка мина аллааҳи шайан вайнна ассалимийна бааадуҳум аулийао бааадин вааллааҳу валиййу алмуттақийна
                Ҳаса басайру лилннаси ваҳудан вароҳматун лиқаумин йуқинуна
                Ам ҳасиба аллазийна ижтароҳу ассаййиати ан нажааалаҳум кааллазийна аману ваааамилу ассалиҳати сауаан маҳйаҳум вамаматуҳум саа ма йаҳкумуна
                Вахалақа аллааҳу ассамауати вааларда биалҳаққи валитужза куллу нафсин бима касабат ваҳум ла йусламуна
                Афараайта мани иттахаса илаҳаҳу ҳауаҳу ваадаллааҳу аллааҳу ааала ааилмин вахатама ааала самааиҳи вақалбиҳи важаааала ааала басариҳи ғишауатан фаман йаҳдийҳи мин бааади аллааҳи афала тасаккаруна
                Вақалу ма ҳийа илла ҳайатуна аддунйа намуту ванаҳйа вама йуҳликуна илла аддаҳру вама лаҳум бисалика мин ааилмин ин ҳум илла йасуннуна
                Вайса тутла ааалайҳим айатуна баййинатин ма кана ҳужжатаҳум илла ан қалу иту биабайна ин кунтум садиқийна
                Қули аллааҳу йуҳйийкум сумма йумийтукум сумма йажмаааукум ила йауми алқийамати ла райба фийҳи валакинна аксара аннаси ла йаааламуна
                Валиллаҳи мулку ассамауати вааларди вайаума тақуму ассаааату йаумайсин йахсару алмубтилуна
                Ватара кулла омматин жасийатан куллу омматин тудааа ила китабиҳа алйаума тужзауна ма кунтум тааамалуна
                Ҳаса китабуна йантиқу ааалайкум биалҳаққи инна кунна настансиху ма кунтум тааамалуна
                Фаамма аллазийна аману ваааамилу ассалиҳати файудхилуҳум роббуҳум фий роҳматиҳи салика ҳува алфаузу алмубийну
                Ваамма аллазийна кафару афалам такун айатий тутла ааалайкум файстакбартум вакунтум қауман мужримийна
                Вайса қийла инна вааада аллааҳи ҳаққун ваалссаааату ла райба фийҳа қултум ма надрий ма ассаааату ин насунну илла саннан вама наҳну бимустайқинийна
                Вабада лаҳум саййиату ма ааамилу ваҳақа биҳим ма кану биҳи йастаҳзиуна
                Вақийла алйаума нансакум кама насийтум лиқаа йаумикум ҳаса вамауакуму аннару вама лакум мин насирийна
                Саликум бианнакуму иттахастум айати аллааҳи ҳузуван вағарраткуму алҳайату аддунйа фаалйаума ла йухражуна минҳа вала ҳум йустааатабуна
                Фалиллаҳи алҳамду робби ассамауати варобби аларди робби алаааламийна
                Валаҳу алкибрийао фий ассамауати вааларди ваҳува алааазийзу алҳакийму
            """.trimIndent(),
        ),
        Surah(
            id = 46,
            arabicName = "الأحقاف",
            latinName = "Al-Ahqaf",
            transliteration = """
                Ҳамийм
                Танзийлу алкитаби мина аллааҳи алааазийзи алҳакийми
                Ма халақна ассамауати вааларда вама байнаҳума илла биалҳаққи ваажалин мусамман вааллазийна кафару ааамма онсиру муааридуна
                Қул араайтум ма тадаауна мин дуни аллааҳи аруний маса халақу мина аларди ам лаҳум ширкун фий ассамауати ийтуний бикитабин мин қабли ҳаса ау асаратин мин ааилмин ин кунтум садиқийна
                Ваман адаллу мимман йадаау мин дуни аллааҳи ман ла йастажийбу лаҳу ила йауми алқийамати ваҳум ааан дуааайҳим ғафилуна
                Вайса ҳушира аннасу кану лаҳум ааадаан вакану биааибадатиҳим кафирийна
                Вайса тутла ааалайҳим айатуна баййинатин қала аллазийна кафару лилҳаққи ламма жааҳум ҳаса сиҳрун мубийнун
                Ам йақулуна ифтароҳу қул ини ифтарайтуҳу фала тамликуна лий мина аллааҳи шайан ҳува аааламу бима туфийдуна фийҳи кафа биҳи шаҳийдан байний вабайнакум ваҳува алғафуру арроҳийму
                Қул ма кунту бидааан мина аррусули вама адрий ма йуфааалу бий вала бикум ин аттабиаау илла ма йуҳа илаййа вама ана илла насийрун мубийнун
                Қул араайтум ин кана мин ааинди аллааҳи вакафартум биҳи вашаҳида шаҳидун мин баний исраийла ааала мислиҳи фаамана вайстакбартум инна аллааҳа ла йаҳдий алқаума ассалимийна
                Вақала аллазийна кафару лиллазийна аману лау кана хайран ма сабақуна илайҳи вайс лам йаҳтаду биҳи фасайақулуна ҳаса ифкун қадиймун
                Вамин қаблиҳи китабу муса имаман вароҳматан ваҳаса китабун мусаддиқун лисанан аааробиййан лийунсира аллазийна саламу вабушра лилмуҳсинийна
                Инна аллазийна қалу роббуна аллааҳу сумма истақаму фала хауфун ааалайҳим вала ҳум йаҳзануна
                Олайка ашабу алжаннати халидийна фийҳа жазаан бима кану йааамалуна
                Вауассайна алинсана бивалидайҳи иҳсанан ҳамаласу оммуҳу курҳан вауадаааасу курҳан ваҳамлуҳу вафисалуҳу саласуна шаҳран ҳатта иса балаға ашуддаҳу вабалаға арбаааийна санатан қала робби аузиааний ан ашкура ниааматака аллатий анааамта ааалаййа ваааала валидаййа ваан ааамала салиҳан тардаҳу вааслиҳ лий фий сурриййатий инний тубту илайка вайнний мина алмуслимийна
                Олайка аллазийна натақаббалу ааанҳум аҳсана ма ааамилу ванатажауазу ааан саййиатиҳим фий ашаби алжаннати вааада ассидқи аллазий кану йуааадуна
                Вааллазий қала ливалидайҳи оффин лакума атааайданиний ан охража вақад халати алқуруну мин қаблий ваҳума йастағийсани аллааҳа вайлака амин инна вааада аллааҳи ҳаққун файақулу ма ҳаса илла асатийру алаувалийна
                Олайка аллазийна ҳаққа ааалайҳиму алқаулу фий умамин қад халат мин қаблиҳим мина алжинни ваалинси иннаҳум кану хасирийна
                Валикуллин даражатун мимма ааамилу валийуваффийаҳум ааамалаҳум ваҳум ла йусламуна
                Вайаума йуаараду аллазийна кафару ааала аннари асҳабтум таййибатикум фий ҳайатикуму аддунйа вайстамтааатум биҳа фаалйаума тужзауна ааасаба алҳуни бима кунтум тастакбируна фий аларди биғайри алҳаққи вабима кунтум тафсуқуна
                Ваоскур аха ааадин ис ансара қаумаҳу биалаҳқафи вақад халати аннусуру мин байни йадайҳи вамин халфиҳи алла тааабуду илла аллааҳа инний ахафу ааалайкум ааасаба йаумин ааасиймин
                Қалу ажитана литафикана ааан алиҳатина фатина бима тааайдуна ин кунта мина ассадиқийна
                Қала иннама алааилму ааинда аллааҳи ваобаллиғукум ма орсилту биҳи валакинний аракум қауман тажҳалуна
                Фаламма раавҳу аааридан мустақбила аудийатиҳим қалу ҳаса аааридун мумтируна бал ҳува ма истааажалтум биҳи рийҳун фийҳа ааасабун алиймун
                Тудаммиру кулла шайин биамри роббиҳа фаасбаҳу ла йура илла масакинуҳум касалика нажзий алқаума алмужримийна
                Валақад макканнаҳум фийма ин макканнакум фийҳи важаааална лаҳум самааан ваабсаран ваафидатан фама ағна ааанҳум самаауҳум вала абсаруҳум вала афидатуҳум мин шайин ис кану йажҳадуна биайати аллааҳи ваҳақа биҳим ма кану биҳи йастаҳзиуна
                Валақад аҳлакна ма ҳаулакум мина алқура васаррафна алайати лааааллааҳум йаржиаауна
                Фалаула насароҳуму аллазийна иттахасу мин дуни аллааҳи қурбанан алиҳатан бал даллу ааанҳум васалика ифкуҳум вама кану йафтаруна
                Вайс сарафна илайка нафаран мина алжинни йастамиаауна алқурана фаламма ҳадаруҳу қалу анситу фаламма қудийа валлау ила қаумиҳим мунсирийна
                Қалу йа қаумана инна самиаана китабан онзила мин бааади муса мусаддиқан лима байна йадайҳи йаҳдий ила алҳаққи вайла тарийқин мустақиймин
                Йа қаумана ажийбу даааййа аллааҳи ваамину биҳи йағфир лакум мин сунубикум вайужиркум мин ааасабин алиймин
                Ваман ла йужиб даааййа аллааҳи фалайса бимуаажизин фий аларди валайса лаҳу мин дуниҳи аулийаа олайка фий далалин мубийнин
                Ауалам йарау анна аллааҳа аллазий халақа ассамауати вааларда валам йааайа бихалқиҳинна биқадирин ааала ан йуҳйийа алмаута бала иннаҳу ааала кулли шайин қадийрун
                Вайаума йуаараду аллазийна кафару ааала аннари алайса ҳаса биалҳаққи қалу бала вароббина қала фасуқу алааасаба бима кунтум такфуруна
                Файсбир кама сабара олу алааазми мина аррусули вала тастааажил лаҳум кааннаҳум йаума йарауна ма йуааадуна лам йалбасу илла саааатан мин наҳарин балағун фаҳал йуҳлаку илла алқауму алфасиқуна
            """.trimIndent(),
        ),
        Surah(
            id = 47,
            arabicName = "محمد",
            latinName = "Muhammad",
            transliteration = """
                Аллазийна кафару васадду ааан сабийли аллааҳи адалла ааамалаҳум
                Вааллазийна аману ваааамилу ассалиҳати вааману бима нуззила ааала муҳаммадин ваҳува алҳаққу мин роббиҳим каффара ааанҳум саййиатиҳим вааслаҳа балаҳум
                Салика бианна аллазийна кафару иттабааау албатила ваанна аллазийна аману иттабааау алҳаққа мин роббиҳим касалика йадрибу аллааҳу лилннаси амсалаҳум
                Файса лақийтуму аллазийна кафару фадарба арриқаби ҳатта иса асхантумуҳум фашудду алвасақа файмма маннан баааду ваймма фидаан ҳатта тадаааа алҳарбу аузароҳа салика валау йашао аллааҳу лайнтасара минҳум валакин лийаблува бааадакум бибааадин вааллазийна қутилу фий сабийли аллааҳи фалан йудилла ааамалаҳум
                Сайаҳдийҳим вайуслиҳу балаҳум
                Вайудхилуҳуму алжанната аааррафаҳа лаҳум
                Йа аййуҳа аллазийна аману ин тансуру аллааҳа йансуркум вайусаббит ақдамакум
                Вааллазийна кафару фатааасан лаҳум ваадалла ааамалаҳум
                Салика бианнаҳум кариҳу ма анзала аллааҳу фааҳбата ааамалаҳум
                Афалам йасийру фий аларди файансуру кайфа кана ааақибату аллазийна мин қаблиҳим даммара аллааҳу ааалайҳим валилкафирийна амсалуҳа
                Салика бианна аллааҳа маула аллазийна аману ваанна алкафирийна ла маула лаҳум
                Инна аллааҳа йудхилу аллазийна аману ваааамилу ассалиҳати жаннатин тажрий мин таҳтиҳа аланҳару вааллазийна кафару йатаматтааауна вайакулуна кама такулу аланаааму ваалннару масван лаҳум
                Вакааййин мин қарйатин ҳийа ашадду қувватан мин қарйатика аллатий ахражатка аҳлакнаҳум фала насира лаҳум
                Афаман кана ааала баййинатин мин роббиҳи каман зуййина лаҳу суо ааамалиҳи вайттабааау аҳвааҳум
                Масалу алжаннати аллатий вуааида алмуттақуна фийҳа анҳарун мин майн ғайри асинин ваанҳарун мин лабанин лам йатағаййар тааамуҳу ваанҳарун мин хамрин лассатин лилшшарибийна ваанҳарун мин ааасалин мусаффан валаҳум фийҳа мин кулли ассамарати вамағфиратун мин роббиҳим каман ҳува халидун фий аннари васуқу маан ҳамийман фақаттаааа амааааҳум
                Ваминҳум ман йастамиаау илайка ҳатта иса харажу мин ааиндика қалу лиллазийна уту алааилма маса қала анифан олайка аллазийна табаааа аллааҳу ааала қулубиҳим вайттабааау аҳвааҳум
                Вааллазийна иҳтадау задаҳум ҳудан ваатаҳум тақваҳум
                Фаҳал йансуруна илла ассаааата ан татийаҳум бағтатан фақад жаа ашратуҳа фаанна лаҳум иса жаасум сикроҳум
                Файаалам аннаҳу ла илаҳа илла аллааҳу вайстағфир лисанбика валилмуминийна ваалмуминати вааллааҳу йаааламу мутақаллабакум вамасвакум
                Вайақулу аллазийна аману лаула нуззилат суратун файса онзилат суратун муҳкаматун васукира фийҳа алқиталу раайта аллазийна фий қулубиҳим марадун йансуруна илайка насара алмағшиййи ааалайҳи мина алмаути фаавла лаҳум
                Таааатун вақаулун маааруфун файса ааазама аламру фалау садақу аллааҳа лакана хайран лаҳум
                Фаҳал ааасайтум ин тауаллайтум ан туфсиду фий аларди ватуқаттиаау арҳамакум
                Олайка аллазийна лаааанаҳуму аллааҳу фаасаммаҳум ваааама абсароҳум
                Афала йатадаббаруна алқурана ам ааала қулубин ақфалуҳа
                Инна аллазийна иртадду ааала адбариҳим мин бааади ма табаййана лаҳуму алҳуда ашшайтану саувала лаҳум ваамла лаҳум
                Салика бианнаҳум қалу лиллазийна кариҳу ма наззала аллааҳу санутийааукум фий бааади аламри вааллааҳу йаааламу исрароҳум
                Факайфа иса тауаффасуму алмалайкату йадрибуна вужуҳаҳум ваадбароҳум
                Салика бианнаҳуму иттабааау ма асхата аллааҳа вакариҳу ридванаҳу фааҳбата ааамалаҳум
                Ам ҳасиба аллазийна фий қулубиҳим марадун ан лан йухрижа аллааҳу адғанаҳум
                Валау нашао лаарайнакаҳум фалаааарафтаҳум бисиймаҳум валатааарифаннаҳум фий лаҳни алқаули вааллааҳу йаааламу ааамалакум
                Валанаблуваннакум ҳатта нааалама алмужаҳидийна минкум ваалссабирийна ванаблува ахбаракум
                Инна аллазийна кафару васадду ааан сабийли аллааҳи вашаққу аррасула мин бааади ма табаййана лаҳуму алҳуда лан йадуру аллааҳа шайан васайуҳбиту ааамалаҳум
                Йа аййуҳа аллазийна аману атийаау аллааҳа ваатийаау аррасула вала тубтилу ааамалакум
                Инна аллазийна кафару васадду ааан сабийли аллааҳи сумма мату ваҳум куффарун фалан йағфира аллааҳу лаҳум
                Фала таҳину ватадаау ила ассалми ваантуму алааалауна вааллааҳу маааакум валан йатиракум ааамалакум
                Иннама алҳайату аддунйа лааайбун валаҳвун вайн тумину вататтақу йутикум ожуракум вала йасалкум амвалакум
                Ин йасалкумуҳа файуҳфикум табхалу вайухриж адғанакум
                Ҳаантум ҳаолай тудааауна литунфиқу фий сабийли аллааҳи фаминкум ман йабхалу ваман йабхал файннама йабхалу ааан нафсиҳи вааллааҳу алғаниййу ваантуму алфуқарао вайн татауаллау йастабдил қауман ғайракум сумма ла йакуну амсалакум
            """.trimIndent(),
        ),
        Surah(
            id = 48,
            arabicName = "الفتح",
            latinName = "Al-Fath",
            transliteration = """
                Инна фатаҳна лака фасан мубийнан
                Лийағфира лака аллааҳу ма тақаддама мин санбика вама тааххара вайутимма ниааматаҳу ааалайка вайаҳдийака сиратан мустақийман
                Вайансурака аллааҳу насран ааазийзан
                Ҳува аллазий анзала ассакийната фий қулуби алмуминийна лийаздаду ийманан маааа ийманиҳим валиллаҳи жунуду ассамауати вааларди вакана аллааҳу ааалийман ҳакийман
                Лийудхила алмуминийна ваалмуминати жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа вайукаффира ааанҳум саййиатиҳим вакана салика ааинда аллааҳи фаузан ааасийман
                Вайуааассиба алмунафиқийна ваалмунафиқати ваалмушрикийна ваалмушрикати ассаннийна биаллааҳи санна ассауи ааалайҳим дайрату ассауи вағадиба аллааҳу ааалайҳим валаааанаҳум вааааадда лаҳум жаҳаннама васаат масийран
                Валиллаҳи жунуду ассамауати вааларди вакана аллааҳу ааазийзан ҳакийман
                Инна арсалнака шаҳидан вамубашширан ванасийран
                Литумину биаллааҳи варасулиҳи ватуаааззируҳу ватуваққируҳу ватусаббиҳуҳу букратан ваасийлан
                Инна аллазийна йубайиааунака иннама йубайиаауна аллааҳа йаду аллааҳи фауқа айдийҳим фаман накаса файннама йанкусу ааала нафсиҳи ваман ауфа бима аааҳада ааалайҳу аллааҳа фасайутийҳи ажран ааасийман
                Сайақулу лака алмухаллафуна мина алааароби шағалатна амвалуна вааҳлуна файстағфир лана йақулуна биалсинатиҳим ма лайса фий қулубиҳим қул фаман йамлику лакум мина аллааҳи шайан ин арада бикум дарран ау арада бикум нафааан бал кана аллааҳу бима тааамалуна хабийран
                Бал санантум ан лан йанқалиба аррасулу ваалмуминуна ила аҳлийҳим абадан вазуййина салика фий қулубикум васанантум санна ассауи вакунтум қауман буран
                Ваман лам йумин биаллааҳи варасулиҳи файнна ааатадна лилкафирийна саааийран
                Валиллаҳи мулку ассамауати вааларди йағфиру лиман йашао вайуааассибу ман йашао вакана аллааҳу ғафуран роҳийман
                Сайақулу алмухаллафуна иса инталақтум ила мағанима литахусуҳа саруна наттабиаакум йурийдуна ан йубаддилу калама аллааҳи қул лан таттабиаауна касаликум қала аллааҳу мин қаблу фасайақулуна бал таҳсудунана бал кану ла йафқаҳуна илла қалийлан
                Қул лилмухаллафийна мина алааароби сатудааауна ила қаумин олий басин шадийдин туқатилунаҳум ау йуслимуна файн тутийаау йутикуму аллааҳу ажран ҳасанан вайн татауаллау кама тауаллайтум мин қаблу йуааассибкум ааасабан алийман
                Лайса ааала алааама ҳаражун вала ааала алаааражи ҳаражун вала ааала алмарийди ҳаражун ваман йутиааи аллааҳа варасулаҳу йудхилҳу жаннатин тажрий мин таҳтиҳа аланҳару ваман йатауалла йуааассибҳу ааасабан алийман
                Лақад радийа аллааҳу ааани алмуминийна ис йубайиааунака таҳта ашшажарати фаааалима ма фий қулубиҳим фаанзала алсакийната ааалайҳим ваасабаҳум фасан қарийбан
                Вамағанима касийратан йахусунаҳа вакана аллааҳу ааазийзан ҳакийман
                Ваааадакуму аллааҳу мағанима касийратан тахусунаҳа фаааажжала лакум ҳасиҳи вакаффа айдийа аннаси ааанкум валитакуна айатан лилмуминийна вайаҳдийакум сиратан мустақийман
                Ваохра лам тақдиру ааалайҳа қад аҳата аллааҳу биҳа вакана аллааҳу ааала кулли шайин қадийран
                Валау қаталакуму аллазийна кафару лауаллауу аладбара сумма ла йажидуна валиййан вала насийран
                Сунната аллааҳи аллатий қад халат мин қаблу валан тажида лисуннати аллааҳи табдийлан
                Ваҳува аллазий каффа айдийаҳум ааанкум ваайдийакум ааанҳум бибатни макката мин бааади ан асфаракум ааалайҳим вакана аллааҳу бима тааамалуна басийран
                Ҳуму аллазийна кафару васаддукум ааани алмасжиди алҳарами ваалҳадйа мааакуфан ан йаблуға маҳиллаҳу валаула рижалун муминуна ванисаон муминатун лам таааламуҳум ан татауҳум фатусийбакум минҳум маааарратун биғайри ааилмин лийудхила аллааҳу фий роҳматиҳи ман йашао лау тазаййалу лаааассабна аллазийна кафару минҳум ааасабан алийман
                Ис жаааала аллазийна кафару фий қулубиҳиму алҳамиййата ҳамиййата алжаҳилиййати фаанзала аллааҳу сакийнатаҳу ааала расулиҳи ваааала алмуминийна ваалзамаҳум калимата аттақва вакану аҳаққа биҳа вааҳлаҳа вакана аллааҳу бикулли шайин ааалийман
                Лақад садақа аллааҳу расулаҳу арруйа биалҳаққи латадхулунна алмасжида алҳарама ин шаа аллааҳу аминийна муҳаллиқийна руусакум вамуқассирийна ла тахафуна фаааалима ма лам таааламу фажаааала мин дуни салика фасан қарийбан
                Ҳува аллазий арсала расулаҳу биалҳуда вадийни алҳаққи лийусҳироҳу ааала аддийни куллиҳи вакафа биаллааҳи шаҳийдан
                Муҳаммадун расулу аллааҳи вааллазийна мааааҳу ашиддао ааала алкуффари руҳамао байнаҳум тароҳум руккаааан сужжадан йабтағуна фадлан мина аллааҳи варидванан сиймаҳум фий вужуҳиҳим мин асари ассужуди салика масалуҳум фий аттаурати вамасалуҳум фий алинжийли казарааин ахража шатаҳу фаазароҳу файстағласа файстауа ааала суқиҳи йуаажибу аззурраааа лийағийса биҳиму алкуффара ваааада аллааҳу аллазийна аману ваааамилу ассалиҳати минҳум мағфиратан ваажран ааасийман
            """.trimIndent(),
        ),
        Surah(
            id = 49,
            arabicName = "الحجرات",
            latinName = "Al-Hujurat",
            transliteration = """
                Йа аййуҳа аллазийна аману ла туқаддиму байна йадайи аллааҳи варасулиҳи вайттақу аллааҳа инна аллааҳа самийааун ааалиймун
                Йа аййуҳа аллазийна аману ла тарфааау асватакум фауқа саути аннабиййи вала тажҳару лаҳу биалқаули кажаҳри бааадикум либааадин ан таҳбата ааамалукум ваантум ла ташаауруна
                Инна аллазийна йағуддуна асватаҳум ааинда расули аллааҳи олайка аллазийна имтаҳана аллааҳу қулубаҳум лилттақва лаҳум мағфиратун ваажрун ааасиймун
                Инна аллазийна йунадунака мин варай алҳужурати аксаруҳум ла йааақилуна
                Валау аннаҳум сабару ҳатта тахружа илайҳим лакана хайран лаҳум вааллааҳу ғафурун роҳиймун
                Йа аййуҳа аллазийна аману ин жаакум фасиқун бинабайн фатабаййану ан тусийбу қауман бижаҳалатин фатусбиҳу ааала ма фаааалтум надимийна
                Вайааламу анна фийкум расула аллааҳи лау йутийааукум фий касийрин мина аламри лааааниттум валакинна аллааҳа ҳаббаба илайкуму алиймана вазаййанаҳу фий қулубикум вакарроҳа илайкуму алкуфра ваалфусуқа ваалааисйана олайка ҳуму аррашидуна
                Фадлан мина аллааҳи ваниааматан вааллааҳу ааалиймун ҳакиймун
                Вайн тайфатани мина алмуминийна иқтаталу фааслиҳу байнаҳума файн бағат иҳдаҳума ааала алохра фақатилу аллатий табғий ҳатта тафийа ила амри аллааҳи файн фаат фааслиҳу байнаҳума биалааадли ваақситу инна аллааҳа йуҳиббу алмуқситийна
                Иннама алмуминуна ихватун фааслиҳу байна ахауайкум вайттақу аллааҳа лааааллакум турҳамуна
                Йа аййуҳа аллазийна аману ла йасхар қаумун мин қаумин аааса ан йакуну хайран минҳум вала нисаон мин нисайн аааса ан йакунна хайран минҳунна вала талмизу анфусакум вала танабазу биалалқаби биса алисму алфусуқу бааада алиймани ваман лам йатуб фаолайка ҳуму ассалимуна
                Йа аййуҳа аллазийна аману ижтанибу касийран мина ассанни инна бааада ассанни исмун вала тажассасу вала йағтаб бааадукум бааадан айуҳиббу аҳадукум ан йакула лаҳма ахийҳи майтан факариҳтумуҳу вайттақу аллааҳа инна аллааҳа таувабун роҳиймун
                Йа аййуҳа аннасу инна халақнакум мин сакарин ваонса важаааалнакум шуааубан вақабайла литаааарафу инна акрамакум ааинда аллааҳи атқакум инна аллааҳа ааалиймун хабийрун
                Қалати алаааробу аманна қул лам тумину валакин қулу асламна валамма йадхули алийману фий қулубикум вайн тутийаау аллааҳа варасулаҳу ла йалиткум мин ааамаликум шайан инна аллааҳа ғафурун роҳиймун
                Иннама алмуминуна аллазийна аману биаллааҳи варасулиҳи сумма лам йартабу важаҳаду биамвалиҳим ваанфусиҳим фий сабийли аллааҳи олайка ҳуму ассадиқуна
                Қул атуаааллимуна аллааҳа бидийникум вааллааҳу йаааламу ма фий ассамауати вама фий аларди вааллааҳу бикулли шайин ааалиймун
                Йамуннуна ааалайка ан асламу қул ла тамунну ааалаййа исламакум бали аллааҳу йамунну ааалайкум ан ҳадакум лилиймани ин кунтум садиқийна
                Инна аллааҳа йаааламу ғайба ассамауати вааларди вааллааҳу басийрун бима тааамалуна
            """.trimIndent(),
        ),
        Surah(
            id = 50,
            arabicName = "ق",
            latinName = "Qaf",
            transliteration = """
                Қаф ваалқурани алмажийди
                Бал ааажибу ан жааҳум мунсирун минҳум фақала алкафируна ҳаса шайон ааажийбун
                Айса митна вакунна туробан салика ражааун баааийдун
                Қад ааалимна ма танқусу аларду минҳум вааайндана китабун ҳафийсун
                Бал кассабу биалҳаққи ламма жааҳум фаҳум фий амрин марийжин
                Афалам йансуру ила ассамай фауқаҳум кайфа банайнаҳа вазаййаннаҳа вама лаҳа мин фуружин
                Вааларда мададнаҳа ваалқайна фийҳа рауасийа ваанбатна фийҳа мин кулли заужин баҳийжин
                Табсиратан васикра ликулли ааабдин мунийбин
                Ваназзална мина ассамай маан мубаракан фаанбатна биҳи жаннатин ваҳабба алҳасийди
                Ваалннахла басиқатин лаҳа талааун надийдун
                Ризқан лилааибади вааҳйайна биҳи балдатан майтан касалика алхуружу
                Кассабат қаблаҳум қауму нуҳин ваашабу аррасси васамуду
                Ваааадун вафирааауну вайхвану лутин
                Ваашабу алайкати вақауму туббааайн куллун кассаба аррусула фаҳаққа ваааийди
                Афаааайийна биалхалқи алаували бал ҳум фий лабсин мин халқин жадийдин
                Валақад халақна алинсана ванаааламу ма тувасвису биҳи нафсуҳу ванаҳну ақробу илайҳи мин ҳабли алварийди
                Ис йаталаққа алмуталаққийани ааани алйамийни ваааани ашшимали қаааийдун
                Ма йалфису мин қаулин илла ладайҳи рақийбун ааатийдун
                Важаат сакрату алмаути биалҳаққи салика ма кунта минҳу таҳийду
                Вануфиха фий ассури салика йауму алваааийди
                Важаат куллу нафсин мааааҳа сайқун вашаҳийдун
                Лақад кунта фий ғафлатин мин ҳаса факашафна ааанка ғитаака фабасарука алйаума ҳадийдун
                Вақала қарийнуҳу ҳаса ма ладаййа ааатийдун
                Алқийа фий жаҳаннама кулла каффарин ааанийдин
                Маннааайн лилхайри муаатадин мурийбин
                Аллазий жаааала маааа аллааҳи илаҳан ахара фаалқийаҳу фий алааасаби ашшадийди
                Қала қарийнуҳу роббана ма атғайтуҳу валакин кана фий далалин баааийдин
                Қала ла тахтасиму ладаййа вақад қаддамту илайкум биалваааийди
                Ма йубаддалу алқаулу ладаййа вама ана бисалламин лилааабийди
                Йаума нақулу лижаҳаннама ҳали имталати ватақулу ҳал мин мазийдин
                Ваозлифати алжаннату лилмуттақийна ғайра баааийдин
                Ҳаса ма туааадуна ликулли аувабин ҳафийсин
                Ман хашийа арроҳмана биалғайби важаа биқалбин мунийбин
                Одхулуҳа бисаламин салика йауму алхулуди
                Лаҳум ма йашауна фийҳа валадайна мазийдун
                Вакам аҳлакна қаблаҳум мин қарнин ҳум ашадду минҳум батшан фанаққабу фий албилади ҳал мин маҳийсин
                Инна фий салика ласикра лиман кана лаҳу қалбун ау алқа ассамааа ваҳува шаҳийдун
                Валақад халақна ассамауати вааларда вама байнаҳума фий ситтати аййамин вама массана мин луғубин
                Файсбир ааала ма йақулуна васаббиҳ биҳамди роббика қабла тулуааи ашшамси вақабла алғуруби
                Вамина аллайли фасаббиҳҳу ваадбара ассужуди
                Вайстамиаа йаума йунади алмунади мин маканин қарийбин
                Йаума йасмааауна ассайҳата биалҳаққи салика йауму алхуружи
                Инна наҳну нуҳйий ванумийту вайлайна алмасийру
                Йаума ташаққақу аларду ааанҳум сираааан салика ҳашрун ааалайна йасийрун
                Наҳну аааламу бима йақулуна вама анта ааалайҳим бижаббарин фасаккир биалқурани ман йахафу ваааийди
            """.trimIndent(),
        ),
        Surah(
            id = 51,
            arabicName = "الذاريات",
            latinName = "Adh-Dhariyat",
            transliteration = """
                Ваалссарийати сарван
                Фаалҳамилати виқран
                Фаалжарийати йусран
                Фаалмуқассимати амран
                Иннама туааадуна ласадиқун
                Вайнна аддийна лауақиааун
                Ваалссамай сати алҳубуки
                Иннакум лафий қаулин мухталифин
                Йуфаку ааанҳу ман офика
                Қутила алхаррасуна
                Аллазийна ҳум фий ғамратин саҳуна
                Йасалуна аййана йауму аддийни
                Йаума ҳум ааала аннари йуфтануна
                Суқу фитнатакум ҳаса аллазий кунтум биҳи тастааажилуна
                Инна алмуттақийна фий жаннатин вааауйунин
                Ахисийна ма атаҳум роббуҳум иннаҳум кану қабла салика муҳсинийна
                Кану қалийлан мина аллайли ма йаҳжааауна
                Вабиалашари ҳум йастағфируна
                Вафий амвалиҳим ҳаққун лилссайли ваалмаҳруми
                Вафий аларди айатун лилмуқинийна
                Вафий анфусикум афала тубсируна
                Вафий ассамай ризқукум вама туааадуна
                Фауаробби ассамай вааларди иннаҳу лаҳаққун мисла ма аннакум тантиқуна
                Ҳал атака ҳадийсу дайфи иброҳийма алмукрамийна
                Ис дахалу ааалайҳи фақалу саламан қала саламун қаумун мункаруна
                Фараға ила аҳлиҳи фажаа биааижлин самийнин
                Фақарробаҳу илайҳим қала ала такулуна
                Фаавжаса минҳум хийфатан қалу ла тахаф вабашшаруҳу биғуламин ааалиймин
                Фаақбалати имраатуҳу фий сарратин фасаккат важҳаҳа вақалат ааажузун ааақиймун
                Қалу касалики қала роббуки иннаҳу ҳува алҳакийму алааалийму
                Қала фама хатбукум аййуҳа алмурсалуна
                Қалу инна орсилна ила қаумин мужримийна
                Линурсила ааалайҳим ҳижаратан мин тийнин
                Мусауваматан ааинда роббика лилмусрифийна
                Фаахражна ман кана фийҳа мина алмуминийна
                Фама важадна фийҳа ғайра байтин мина алмуслимийна
                Ватаракна фийҳа айатан лиллазийна йахафуна алааасаба алалийма
                Вафий муса ис арсалнаҳу ила фирааауна бисултанин мубийнин
                Фатауалла бирукниҳи вақала саҳирун ау мажнунун
                Фаахаснаҳу важунудаҳу фанабаснаҳум фий алйамми ваҳува мулиймун
                Вафий ааадин ис арсална ааалайҳиму аррийҳа алааақийма
                Ма тасару мин шайин атат ааалайҳи илла жааааласу каалррамийми
                Вафий самуда ис қийла лаҳум таматтааау ҳатта ҳийнин
                Фаааатау ааан амри роббиҳим фаахасасуму ассааайқату ваҳум йансуруна
                Фама истатааау мин қийамин вама кану мунтасирийна
                Вақаума нуҳин мин қаблу иннаҳум кану қауман фасиқийна
                Ваалссамаа банайнаҳа биайдин вайнна ламусиаауна
                Вааларда фарашнаҳа фаниаама алмаҳидуна
                Вамин кулли шайин халақна заужайни лааааллакум тасаккаруна
                Фафирру ила аллааҳи инний лакум минҳу насийрун мубийнун
                Вала тажааалу маааа аллааҳи илаҳан ахара инний лакум минҳу насийрун мубийнун
                Касалика ма ата аллазийна мин қаблиҳим мин расулин илла қалу саҳирун ау мажнунун
                Атауасау биҳи бал ҳум қаумун тағуна
                Фатауалла ааанҳум фама анта бималумин
                Васаккир файнна ассикра танфааау алмуминийна
                Вама халақту алжинна ваалинса илла лийааабудуни
                Ма орийду минҳум мин ризқин вама орийду ан йутааимуни
                Инна аллааҳа ҳува арраззақу су алқуввати алматийну
                Файнна лиллазийна саламу санубан мисла сануби ашабиҳим фала йастааажилуна
                Фауайлун лиллазийна кафару мин йаумиҳиму аллазий йуааадуна
            """.trimIndent(),
        ),
        Surah(
            id = 52,
            arabicName = "الطور",
            latinName = "At-Tur",
            transliteration = """
                Ваалттури
                Вакитабин мастурин
                Фий раққин маншурин
                Ваалбайти алмааамури
                Ваалссақфи алмарфуааи
                Ваалбаҳри алмасжури
                Инна ааасаба роббика лауақиааун
                Ма лаҳу мин дафиааин
                Йаума тамуру ассамао мауран
                Ватасийру алжибалу сайран
                Фауайлун йаумайсин лилмукассибийна
                Аллазийна ҳум фий хаудин йалааабуна
                Йаума йудааааауна ила нари жаҳаннама даааааан
                Ҳасиҳи аннару аллатий кунтум биҳа тукассибуна
                Афасиҳрун ҳаса ам антум ла тубсируна
                Ислауҳа файсбиру ау ла тасбиру сауаон ааалайкум иннама тужзауна ма кунтум тааамалуна
                Инна алмуттақийна фий жаннатин ванаааиймин
                Факиҳийна бима атаҳум роббуҳум вауақаҳум роббуҳум ааасаба алжаҳийми
                Кулу вайшробу ҳанийан бима кунтум тааамалуна
                Муттакиийна ааала сурурин масфуфатин вазауважнаҳум биҳурин ааийнин
                Вааллазийна аману вайттабаааасум сурриййатуҳум биийманин алҳақна биҳим сурриййатаҳум вама алатнаҳум мин ааамалиҳим мин шайин куллу имрийн бима касаба роҳийнун
                Ваамдаднаҳум бифакиҳатин валаҳмин мимма йаштаҳуна
                Йатаназааауна фийҳа касан ла лағвун фийҳа вала тасиймун
                Вайатуфу ааалайҳим ғилманун лаҳум кааннаҳум лулуон макнунун
                Ваақбала бааадуҳум ааала бааадин йатасаалуна
                Қалу инна кунна қаблу фий аҳлина мушфиқийна
                Фаманна аллааҳу ааалайна вауақана ааасаба ассамуми
                Инна кунна мин қаблу надаауҳу иннаҳу ҳува албарру арроҳийму
                Фасаккир фама анта биниаамати роббика бикаҳин вала мажнунин
                Ам йақулуна шааайрун натароббасу биҳи райба алмануни
                Қул тароббасу файнний маааакум мина алмутароббисийна
                Ам тамуруҳум аҳламуҳум биҳаса ам ҳум қаумун тағуна
                Ам йақулуна тақаувалаҳу бал ла йуминуна
                Фалйату биҳадийсин мислиҳи ин кану садиқийна
                Ам хулиқу мин ғайри шайин ам ҳуму алхалиқуна
                Ам халақу ассамауати вааларда бал ла йуқинуна
                Ам ааиндаҳум хазайну роббика ам ҳуму алмусайтируна
                Ам лаҳум сулламун йастамиаауна фийҳи фалйати мустамиаауҳум бисултанин мубийнин
                Ам лаҳу албанату валакуму албануна
                Ам тасалуҳум ажран фаҳум мин мағрамин мусқалуна
                Ам ааиндаҳуму алғайбу фаҳум йактубуна
                Ам йурийдуна кайдан фааллазийна кафару ҳуму алмакийдуна
                Ам лаҳум илаҳун ғайру аллааҳи субҳана аллааҳи ааамма йушрикуна
                Вайн йарау кисфан мина ассамай сақитан йақулу саҳабун маркумун
                Фасарҳум ҳатта йулақу йаумаҳуму аллазий фийҳи йусааақуна
                Йаума ла йуғний ааанҳум кайдуҳум шайан вала ҳум йунсаруна
                Вайнна лиллазийна саламу ааасабан дуна салика валакинна аксароҳум ла йаааламуна
                Вайсбир лиҳукми роббика файннака биааайунина васаббиҳ биҳамди роббика ҳийна тақуму
                Вамина аллайли фасаббиҳҳу вайдбара аннужуми
            """.trimIndent(),
        ),
        Surah(
            id = 53,
            arabicName = "النجم",
            latinName = "An-Najm",
            transliteration = """
                Ваалннажми иса ҳауа
                Ма далла саҳибукум вама ғауа
                Вама йантиқу ааани алҳауа
                Ин ҳува илла ваҳйун йуҳа
                Ааалламаҳу шадийду алқува
                Су мирратин файстауа
                Ваҳува биалофуқи алааала
                Сумма дана фатадалла
                Факана қаба қаусайни ау адна
                Фаавҳа ила ааабдиҳи ма ауҳа
                Ма касаба алфуаду ма раа
                Афатумарунаҳу ааала ма йара
                Валақад рааҳу назлатан охра
                Ааинда сидрати алмунтаҳа
                Ааиндаҳа жаннату алмауа
                Ис йағша ассидрата ма йағша
                Ма заға албасару вама таға
                Лақад раа мин айати роббиҳи алкубра
                Афараайтуму аллата ваалааузза
                Ваманата ассалисата алохра
                Алакуму ассакару валаҳу алонса
                Тилка исан қисматун дийза
                Ин ҳийа илла асмаон саммайтумуҳа антум ваабаокум ма анзала аллааҳу биҳа мин султанин ин йаттабиаауна илла ассанна вама таҳва аланфусу валақад жааҳум мин роббиҳиму алҳуда
                Ам лилинсани ма таманна
                Фалиллаҳи алахирату ваалула
                Вакам мин малакин фий ассамауати ла туғний шафаааатуҳум шайан илла мин бааади ан йасана аллааҳу лиман йашао вайарда
                Инна аллазийна ла йуминуна биалахирати лайусаммуна алмалайката тасмийата алонса
                Вама лаҳум биҳи мин ааилмин ин йаттабиаауна илла ассанна вайнна ассанна ла йуғний мина алҳаққи шайан
                Фаааарид ааан ман тауалла ааан сикрина валам йурид илла алҳайата аддунйа
                Салика маблағуҳум мина алааилми инна роббака ҳува аааламу биман далла ааан сабийлиҳи ваҳува аааламу бимани иҳтада
                Валиллаҳи ма фий ассамауати вама фий аларди лийажзийа аллазийна асау бима ааамилу вайажзийа аллазийна аҳсану биалҳусна
                Аллазийна йажтанибуна кабайра алисми ваалфауаҳиша илла алламама инна роббака васиаау алмағфирати ҳува аааламу бикум ис аншаакум мина аларди вайс антум ажиннатун фий бутуни оммаҳатикум фала тузакку анфусакум ҳува аааламу бимани иттақа
                Афараайта аллазий тауалла
                Ваааата қалийлан ваакда
                Ааайндаҳу ааилму алғайби фаҳува йара
                Ам лам йунабба бима фий суҳуфи муса
                Вайброҳийма аллазий ваффа
                Алла тазиру вазиратун визра охра
                Ваан лайса лилинсани илла ма саааа
                Ваанна сааайаҳу сауфа йура
                Сумма йужзаҳу алжазаа алауфа
                Ваанна ила роббика алмунтаҳа
                Вааннаҳу ҳува азака ваабка
                Вааннаҳу ҳува амата вааҳйа
                Вааннаҳу халақа аззаужайни ассакара ваалонса
                Мин нутфатин иса тумна
                Ваанна ааалайҳи аннашата алохра
                Вааннаҳу ҳува ағна ваақна
                Вааннаҳу ҳува роббу ашшиаара
                Вааннаҳу аҳлака ааадан алула
                Васамуда фама абқа
                Вақаума нуҳин мин қаблу иннаҳум кану ҳум аслама ваатға
                Ваалмутафиката аҳва
                Фағашшаҳа ма ғашша
                Фабиаййи алай роббика татамара
                Ҳаса насийрун мина аннусури алула
                Азифати алазифату
                Лайса лаҳа мин дуни аллааҳи кашифатун
                Афамин ҳаса алҳадийси тааажабуна
                Ватазакуна вала табкуна
                Ваантум самидуна
                Фаосжуду лиллаҳи ваоаабуду
            """.trimIndent(),
        ),
        Surah(
            id = 54,
            arabicName = "القمر",
            latinName = "Al-Qamar",
            transliteration = """
                Иқтаробати ассаааату вайншаққа алқамару
                Вайн йарау айатан йуаариду вайақулу сиҳрун мустамиррун
                Вакассабу вайттабааау аҳвааҳум вакуллу амрин мустақиррун
                Валақад жааҳум мина аланбай ма фийҳи муздажарун
                Ҳикматун балиғатун фама туғний аннусуру
                Фатауалла ааанҳум йаума йадаау аддааай ила шайин нукурин
                Хушшаааан абсаруҳум йахружуна мина алаждаси кааннаҳум жарадун мунташирун
                Муҳтиааийна ила аддааай йақулу алкафируна ҳаса йаумун ааасирун
                Кассабат қаблаҳум қауму нуҳин факассабу ааабдана вақалу мажнунун вайздужира
                Фадаааа роббаҳу анний мағлубун файнтасир
                Фафатаҳна абваба ассамай бимайн мунҳамирин
                Вафажжарна аларда аауйунан файлтақа алмао ааала амрин қад қудира
                Ваҳамалнаҳу ааала сати алваҳин вадусурин
                Тажрий биааайунина жазаан лиман кана куфира
                Валақад таракнаҳа айатан фаҳал мин муддакирин
                Факайфа кана ааасабий ванусури
                Валақад йассарна алқурана лилссикри фаҳал мин муддакирин
                Кассабат ааадун факайфа кана ааасабий ванусури
                Инна арсална ааалайҳим рийҳан сарсаран фий йауми наҳсин мустамиррин
                Танзиаау аннаса кааннаҳум ааажазу нахлин мунқааайрин
                Факайфа кана ааасабий ванусури
                Валақад йассарна алқурана лилссикри фаҳал мин муддакирин
                Кассабат самуду биалннусури
                Фақалу абашаран минна ваҳидан наттабиаауҳу инна исан лафий далалин васуааурин
                Аолқийа ассикру ааалайҳи мин байнина бал ҳува кассабун аширун
                Сайаааламуна ғадан мани алкассабу алаширу
                Инна мурсилу аннақати фитнатан лаҳум файртақибҳум вайстабир
                Ванаббиҳум анна алмаа қисматун байнаҳум куллу ширбин муҳтадарун
                Фанадау саҳибаҳум фатаааата фаааақара
                Факайфа кана ааасабий ванусури
                Инна арсална ааалайҳим сайҳатан ваҳидатан факану каҳашийми алмуҳтасири
                Валақад йассарна алқурана лилссикри фаҳал мин муддакирин
                Кассабат қауму лутин биалннусури
                Инна арсална ааалайҳим ҳасибан илла ала лутин нажжайнаҳум бисаҳарин
                Ниааматан мин ааиндина касалика нажзий ман шакара
                Валақад ансароҳум батшатана фатамарау биалннусури
                Валақад рауадуҳу ааан дайфиҳи фатамасна ааайунаҳум фасуқу ааасабий ванусури
                Валақад саббаҳаҳум букратан ааасабун мустақиррун
                Фасуқу ааасабий ванусури
                Валақад йассарна алқурана лилссикри фаҳал мин муддакирин
                Валақад жаа ала фирааауна аннусуру
                Кассабу биайатина куллиҳа фаахаснаҳум ахса ааазийзин муқтадирин
                Акуффарукум хайрун мин олайкум ам лакум бараатун фий аззубури
                Ам йақулуна наҳну жамийааун мунтасирун
                Сайуҳзаму алжамаау вайуваллуна аддубура
                Бали ассаааату мауааидуҳум ваалссаааату аза ваамарру
                Инна алмужримийна фий далалин васуааурин
                Йаума йушабуна фий аннари ааала вужуҳиҳим суқу масса сақара
                Инна кулла шайин халақнаҳу биқадарин
                Вама амруна илла ваҳидатун каламҳин биалбасари
                Валақад аҳлакна ашйаааакум фаҳал мин муддакирин
                Вакуллу шайин фаааалуҳу фий аззубури
                Вакуллу сағийрин вакабийрин мустатарун
                Инна алмуттақийна фий жаннатин ванаҳарин
                Фий мақааади сидқин ааинда малийкин муқтадирин
            """.trimIndent(),
        ),
        Surah(
            id = 55,
            arabicName = "الرحمن",
            latinName = "Ar-Rahman",
            transliteration = """
                Арроҳману
                Аааллама алқурана
                Халақа алинсана
                Ааалламаҳу албайана
                Ашшамсу ваалқамару биҳусбанин
                Ваалннажму ваалшшажару йасжудани
                Ваалссамаа рафааааҳа вауадаааа алмийзана
                Алла татғау фий алмийзани
                Ваақийму алвазна биалқисти вала тухсиру алмийзана
                Вааларда вадааааҳа лиланами
                Фийҳа факиҳатун ваалннахлу сату алакмами
                Ваалҳаббу су алааасфи ваалррайҳани
                Фабиаййи алай роббикума тукассибани
                Халақа алинсана мин салсалин каалфаххари
                Вахалақа алжанна мин марижин мин нарин
                Фабиаййи алай роббикума тукассибани
                Роббу алмашриқайни вароббу алмағрибайни
                Фабиаййи алай роббикума тукассибани
                Маража албаҳрайни йалтақийани
                Байнаҳума барзахун ла йабғийани
                Фабиаййи алай роббикума тукассибани
                Йахружу минҳума аллулуо ваалмаржану
                Фабиаййи алай роббикума тукассибани
                Валаҳу алжауари алмуншаату фий албаҳри каалааалами
                Фабиаййи алай роббикума тукассибани
                Куллу ман ааалайҳа фанин
                Вайабқа важҳу роббика су алжалали вааликрами
                Фабиаййи алай роббикума тукассибани
                Йасалуҳу ман фий ассамауати вааларди кулла йаумин ҳува фий шанин
                Фабиаййи алай роббикума тукассибани
                Санафруғу лакум аййуҳа ассақалани
                Фабиаййи алай роббикума тукассибани
                Йа мааашара алжинни ваалинси ини истатааатум ан танфусу мин ақтари ассамауати вааларди фаонфусу ла танфусуна илла бисултанин
                Фабиаййи алай роббикума тукассибани
                Йурсалу ааалайкума шувасун мин нарин вануҳасун фала тантасирани
                Фабиаййи алай роббикума тукассибани
                Файса иншаққати ассамао факанат вардатан каалддиҳани
                Фабиаййи алай роббикума тукассибани
                Файаумайсин ла йусалу ааан санбиҳи инсун вала жаннун
                Фабиаййи алай роббикума тукассибани
                Йуаарафу алмужримуна бисиймаҳум файухасу биалннауасий ваалақдами
                Фабиаййи алай роббикума тукассибани
                Ҳасиҳи жаҳаннаму аллатий йукассибу биҳа алмужримуна
                Йатуфуна байнаҳа вабайна ҳамиймин анин
                Фабиаййи алай роббикума тукассибани
                Валиман хафа мақама роббиҳи жаннатани
                Фабиаййи алай роббикума тукассибани
                Сауата афнанин
                Фабиаййи алай роббикума тукассибани
                Фийҳима ааайнани тажрийани
                Фабиаййи алай роббикума тукассибани
                Фийҳима мин кулли факиҳатин заужани
                Фабиаййи алай роббикума тукассибани
                Муттакиийна ааала фурушин батайнуҳа мин истабрақин важана алжаннатайни данин
                Фабиаййи алай роббикума тукассибани
                Фийҳинна қасирату аттарфи лам йатмисҳунна инсун қаблаҳум вала жаннун
                Фабиаййи алай роббикума тукассибани
                Кааннаҳунна алйақуту ваалмаржану
                Фабиаййи алай роббикума тукассибани
                Ҳал жазао алиҳсани илла алиҳсану
                Фабиаййи алай роббикума тукассибани
                Вамин дуниҳима жаннатани
                Фабиаййи алай роббикума тукассибани
                Музамматани
                Фабиаййи алай роббикума тукассибани
                Фийҳима ааайнани наддахатани
                Фабиаййи алай роббикума тукассибани
                Фийҳима факиҳатун ванахлун варумманун
                Фабиаййи алай роббикума тукассибани
                Фийҳинна хайратун ҳисанун
                Фабиаййи алай роббикума тукассибани
                Ҳурун мақсуратун фий алхийами
                Фабиаййи алай роббикума тукассибани
                Лам йатмисҳунна инсун қаблаҳум вала жаннун
                Фабиаййи алай роббикума тукассибани
                Муттакиийна ааала рафрафин худрин ваааабқариййин ҳисанин
                Фабиаййи алай роббикума тукассибани
                Табарака исму роббика сий алжалали вааликрами
            """.trimIndent(),
        ),
        Surah(
            id = 56,
            arabicName = "الواقعة",
            latinName = "Al-Waqi'ah",
            transliteration = """
                Иса вақаааати алвақиааату
                Лайса ливақааатиҳа касибатун
                Хафидатун рафиааатун
                Иса ружжати аларду ражжан
                Вабуссати алжибалу бассан
                Факанат ҳабаан мунбассан
                Вакунтум азважан саласатан
                Фаашабу алмайманати ма ашабу алмайманати
                Ваашабу алмашамати ма ашабу алмашамати
                Ваалссабиқуна ассабиқуна
                Олайка алмуқарробуна
                Фий жаннати аннаааийми
                Суллатун мина алаувалийна
                Вақалийлун мина алахирийна
                Ааала сурурин маудунатин
                Муттакиийна ааалайҳа мутақабилийна
                Йатуфу ааалайҳим вилданун мухалладуна
                Биаквабин ваабарийқа вакасин мин маааийнин
                Ла йусаддааауна ааанҳа вала йунзифуна
                Вафакиҳатин мимма йатахаййаруна
                Валаҳми тайрин мимма йаштаҳуна
                Ваҳурун ааийнун
                Каамсали аллулуи алмакнуни
                Жазаан бима кану йааамалуна
                Ла йасмааауна фийҳа лағван вала тасийман
                Илла қийлан саламан саламан
                Ваашабу алйамийни ма ашабу алйамийни
                Фий сидрин махдудин
                Ваталҳин мандудин
                Василлин мамдудин
                Вамайн маскубин
                Вафакиҳатин касийратин
                Ла мақтуааатин вала мамнуааатин
                Вафурушин марфуааатин
                Инна аншанаҳунна иншаан
                Фажаааалнаҳунна абкаран
                Ааурубан атробан
                Лиашаби алйамийни
                Суллатун мина алаувалийна
                Васуллатун мина алахирийна
                Ваашабу ашшимали ма ашабу ашшимали
                Фий самумин ваҳамиймин
                Василлин мин йаҳмумин
                Ла баридин вала кариймин
                Иннаҳум кану қабла салика мутрафийна
                Вакану йусирруна ааала алҳинси алааасийми
                Вакану йақулуна айса митна вакунна туробан вааайсаман айнна ламабааусуна
                Ауа абаона алаувалуна
                Қул инна алаувалийна ваалахирийна
                Ламажмуаауна ила мийқати йаумин мааалумин
                Сумма иннакум аййуҳа аддаллуна алмукассибуна
                Лаакилуна мин шажарин мин заққумин
                Фамалиуна минҳа албутуна
                Фашарибуна ааалайҳи мина алҳамийми
                Фашарибуна шурба алҳийми
                Ҳаса нузулуҳум йаума аддийни
                Наҳну халақнакум фалаула тусаддиқуна
                Афараайтум ма тумнуна
                Аантум тахлуқунаҳу ам наҳну алхалиқуна
                Наҳну қаддарна байнакуму алмаута вама наҳну бимасбуқийна
                Ааала ан нубаддила амсалакум вануншиакум фий ма ла таааламуна
                Валақад ааалимтуму аннашата алула фалаула тасаккаруна
                Афараайтум ма таҳрусуна
                Аантум тазраааунаҳу ам наҳну аззариаауна
                Лау нашао лажаааалнаҳу ҳутаман фасалтум тафаккаҳуна
                Инна ламуғрамуна
                Бал наҳну маҳрумуна
                Афараайтуму алмаа аллазий ташробуна
                Аантум анзалтумуҳу мина алмузни ам наҳну алмунзилуна
                Лау нашао жаааалнаҳу ожажан фалаула ташкуруна
                Афараайтуму аннара аллатий туруна
                Аантум аншатум шажаратаҳа ам наҳну алмуншиуна
                Наҳну жаааалнаҳа таскиратан ваматаааан лилмуқвийна
                Фасаббиҳ бийсми роббика алааасийми
                Фала оқсиму бимауақиааи аннужуми
                Вайннаҳу лақасамун лау таааламуна ааасиймун
                Иннаҳу лақуранун кариймун
                Фий китабин макнунин
                Ла йамассуҳу илла алмутаҳҳаруна
                Танзийлун мин робби алаааламийна
                Афабиҳаса алҳадийси антум музинуна
                Ватажааалуна ризқакум аннакум тукассибуна
                Фалаула иса балағати алҳулқума
                Ваантум ҳийнайсин тансуруна
                Ванаҳну ақробу илайҳи минкум валакин ла тубсируна
                Фалаула ин кунтум ғайра мадийнийна
                Таржиааунаҳа ин кунтум садиқийна
                Фаамма ин кана мина алмуқарробийна
                Фарауҳун варайҳанун важаннату наааиймин
                Ваамма ин кана мин ашаби алйамийни
                Фасаламун лака мин ашаби алйамийни
                Ваамма ин кана мина алмукассибийна аддаллийна
                Фанузулун мин ҳамиймин
                Ватаслийату жаҳиймин
                Инна ҳаса лаҳува ҳаққу алйақийни
                Фасаббиҳ бийсми роббика алааасийми
            """.trimIndent(),
        ),
        Surah(
            id = 57,
            arabicName = "الحديد",
            latinName = "Al-Hadid",
            transliteration = """
                Саббаҳа лиллаҳи ма фий ассамауати вааларди ваҳува алааазийзу алҳакийму
                Лаҳу мулку ассамауати вааларди йуҳйий вайумийту ваҳува ааала кулли шайин қадийрун
                Ҳува алаувалу ваалахиру ваалссаҳиру ваалбатину ваҳува бикулли шайин ааалиймун
                Ҳува аллазий халақа ассамауати вааларда фий ситтати аййамин сумма истауа ааала алааарши йаааламу ма йалижу фий аларди вама йахружу минҳа вама йанзилу мина ассамай вама йаааружу фийҳа ваҳува маааакум айна ма кунтум вааллааҳу бима тааамалуна басийрун
                Лаҳу мулку ассамауати вааларди вайла аллааҳи туржааау аломуру
                Йулижу аллайла фий аннаҳари вайулижу аннаҳара фий аллайи ваҳува ааалиймун бисати ассудури
                Амину биаллааҳи варасулиҳи ваанфиқу мимма жаааалакум мустахлафийна фийҳи фааллазийна аману минкум ваанфақу лаҳум ажрун кабийрун
                Вама лакум ла туминуна биаллааҳи ваалррасулу йадааукум литумину бироббикум вақад ахаса мийсақакум ин кунтум муминийна
                Ҳува аллазий йуназзилу ааала ааабдиҳи айатин баййинатин лийухрижакум мина ассулумати ила аннури вайнна аллааҳа бикум ларауфун роҳиймун
                Вама лакум алла тунфиқу фий сабийли аллааҳи валиллаҳи мийрасу ассамауати вааларди ла йастауий минкум ман анфақа мин қабли алфаси вақатала олайка ааасаму даражатан мина аллазийна анфақу мин баааду вақаталу вакуллан ваааада аллааҳу алҳусна вааллааҳу бима тааамалуна хабийрун
                Ман са аллазий йуқриду аллааҳа қардан ҳасанан файудааайфаҳу лаҳу валаҳу ажрун кариймун
                Йаума тара алмуминийна ваалмуминати йасааа нуруҳум байна айдийҳим вабиайманиҳим бушракуму алйаума жаннатун тажрий мин таҳтиҳа аланҳару халидийна фийҳа салика ҳува алфаузу алааасийму
                Йаума йақулу алмунафиқуна ваалмунафиқату лиллазийна аману онсуруна нақтабис мин нурикум қийла иржиаау вараакум файлтамису нуран фадуриба байнаҳум бисурин лаҳу бабун батинуҳу фийҳи арроҳмату васаҳируҳу мин қибалиҳи алааасабу
                Йунадунаҳум алам накун маааакум қалу бала валакиннакум фатантум анфусакум ватароббастум вайртабтум вағарраткуму аламаниййу ҳатта жаа амру аллааҳи вағарракум биаллааҳи алғаруру
                Фаалйаума ла йухасу минкум фидйатун вала мина аллазийна кафару мауакуму аннару ҳийа маулакум вабиса алмасийру
                Алам йани лиллазийна аману ан тахшаааа қулубуҳум лисикри аллааҳи вама назала мина алҳаққи вала йакуну кааллазийна уту алкитаба мин қаблу фатала ааалайҳиму аламаду фақасат қулубуҳум вакасийрун минҳум фасиқуна
                Иааламу анна аллааҳа йуҳйий аларда бааада маутиҳа қад баййанна лакуму алайати лааааллакум тааақилуна
                Инна алмуссаддиқийна ваалмуссаддиқати ваақраду аллааҳа қардан ҳасанан йудаааафу лаҳум валаҳум ажрун кариймун
                Вааллазийна аману биаллааҳи варусулиҳи олайка ҳуму ассиддийқуна ваалшшуҳадао ааинда роббиҳим лаҳум ажруҳум вануруҳум вааллазийна кафару вакассабу биайатина олайка ашабу алжаҳийми
                Иааламу аннама алҳайату аддунйа лааайбун валаҳвун вазийнатун ватафахурун байнакум ватакасурун фий аламвали ваалаулади камасали ғайсин ааажаба алкуффара набатуҳу сумма йаҳийжу фатароҳу мусфарран сумма йакуну ҳутаман вафий алахирати ааасабун шадийдун вамағфиратун мина аллааҳи варидванун вама алҳайату аддунйа илла матааау алғурури
                Сабиқу ила мағфиратин мин роббикум важаннатин ааардуҳа каааарди ассамай вааларди оааиддат лиллазийна аману биаллааҳи варусулиҳи салика фадлу аллааҳи йутийҳи ман йашао вааллааҳу су алфадли алааасийми
                Ма асаба мин мусийбатин фий аларди вала фий анфусикум илла фий китабин мин қабли ан набрааҳа инна салика ааала аллааҳи йасийрун
                Ликайла тасау ааала ма фатакум вала тафроҳу бима атакум вааллааҳу ла йуҳиббу кулла мухталин фахурин
                Аллазийна йабхалуна вайамуруна аннаса биалбухли ваман йатауалла файнна аллааҳа ҳува алғаниййу алҳамийду
                Лақад арсална русулана биалбаййинати ваанзална мааааҳуму алкитаба ваалмийзана лийақума аннасу биалқисти ваанзална алҳадийда фийҳи басун шадийдун ваманафиаау лилннаси валийааалама аллааҳу ман йансуруҳу варусулаҳу биалғайби инна аллааҳа қауиййун ааазийзун
                Валақад арсална нуҳан вайброҳийма важаааална фий сурриййатиҳима аннубуввата ваалкитаба фаминҳум муҳтадин вакасийрун минҳум фасиқуна
                Сумма қаффайна ааала асариҳим бирусулина вақаффайна биааийса ибни марйама ваатайнаҳу алинжийла важаааална фий қулуби аллазийна иттабааауҳу рафатан вароҳматан вароҳбаниййатан ибтадааауҳа ма катабнаҳа ааалайҳим илла ибтиғаа ридвани аллааҳи фама раааавҳа ҳаққа риааайатиҳа фаатайна аллазийна аману минҳум ажроҳум вакасийрун минҳум фасиқуна
                Йа аййуҳа аллазийна аману иттақу аллааҳа ваамину бирасулиҳи йутикум кифлайни мин роҳматиҳи вайажааал лакум нуран тамшуна биҳи вайағфир лакум вааллааҳу ғафурун роҳиймун
                Лиалла йааалама аҳлу алкитаби алла йақдируна ааала шайин мин фадли аллааҳи ваанна алфадла бийади аллааҳи йутийҳи ман йашао вааллааҳу су алфадли алааасийми
            """.trimIndent(),
        ),
        Surah(
            id = 58,
            arabicName = "المجادلة",
            latinName = "Al-Mujadila",
            transliteration = """
                Қад самиааа аллааҳу қаула аллатий тужадилука фий заужиҳа ваташтакий ила аллааҳи вааллааҳу йасмааау таҳаууракума инна аллааҳа самийааун басийрун
                Аллазийна йусаҳируна минкум мин нисайҳим ма ҳунна оммаҳатиҳим ин оммаҳатуҳум илла аллаий валаднаҳум вайннаҳум лайақулуна мункаран мина алқаули вазуран вайнна аллааҳа лаааафуввун ғафурун
                Вааллазийна йусаҳируна мин нисайҳим сумма йаааудуна лима қалу фатаҳрийру рақабатин мин қабли ан йатамасса саликум туааасуна биҳи вааллааҳу бима тааамалуна хабийрун
                Фаман лам йажид фасийаму шаҳрайни мутатабиааайни мин қабли ан йатамасса фаман лам йастатиаа файтаааму ситтийна мискийнан салика литумину биаллааҳи варасулиҳи ватилка ҳудуду аллааҳи валилкафирийна ааасабун алиймун
                Инна аллазийна йуҳаддуна аллааҳа варасулаҳу кубиту кама кубита аллазийна мин қаблиҳим вақад анзална айатин баййинатин валилкафирийна ааасабун муҳийнун
                Йаума йабааасуҳуму аллааҳу жамийааан файунаббиоҳум бима ааамилу аҳсаҳу аллааҳу ванасуҳу вааллааҳу ааала кулли шайин шаҳийдун
                Алам тара анна аллааҳа йаааламу ма фий ассамауати вама фий аларди ма йакуну мин нажва саласатин илла ҳува робиаауҳум вала хамсатин илла ҳува садисуҳум вала адна мин салика вала аксара илла ҳува мааааҳум айна ма кану сумма йунаббиоҳум бима ааамилу йаума алқийамати инна аллааҳа бикулли шайин ааалиймун
                Алам тара ила аллазийна нуҳу ааани аннажва сумма йаааудуна лима нуҳу ааанҳу вайатанажауна биалисми ваалааудвани вамааасийати аррасули вайса жаука ҳаййаука бима лам йуҳаййика биҳи аллааҳу вайақулуна фий анфусиҳим лаула йуааассибуна аллааҳу бима нақулу ҳасбуҳум жаҳаннаму йаслаунаҳа фабиса алмасийру
                Йа аййуҳа аллазийна аману иса танажайтум фала татанажау биалисми ваалааудвани вамааасийати аррасули ватанажау биалбирри ваалттақва вайттақу аллааҳа аллазий илайҳи туҳшаруна
                Иннама аннажва мина ашшайтани лийаҳзуна аллазийна аману валайса бидарриҳим шайан илла бийсни аллааҳи ваааала аллааҳи фалйатауаккали алмуминуна
                Йа аййуҳа аллазийна аману иса қийла лакум тафассаҳу фий алмажалиси файфсаҳу йафсаҳи аллааҳу лакум вайса қийла оншузу фаоншузу йарфааай аллааҳу аллазийна аману минкум вааллазийна уту алааилма даражатин вааллааҳу бима тааамалуна хабийрун
                Йа аййуҳа аллазийна аману иса нажайтуму аррасула фақаддиму байна йадай нажвакум садақатан салика хайрун лакум ваасару файн лам тажиду файнна аллааҳа ғафурун роҳиймун
                Аашфақтум ан туқаддиму байна йадай нажвакум садақатин файс лам тафааалу ватаба аллааҳу ааалайкум фаақийму ассалата ваату аззаката ваатийаау аллааҳа варасулаҳу вааллааҳу хабийрун бима тааамалуна
                Алам тара ила аллазийна тауаллау қауман ғадиба аллааҳу ааалайҳим ма ҳум минкум вала минҳум вайаҳлифуна ааала алкасиби ваҳум йаааламуна
                Аааадда аллааҳу лаҳум ааасабан шадийдан иннаҳум саа ма кану йааамалуна
                Иттахасу айманаҳум жуннатан фасадду ааан сабийли аллааҳи фалаҳум ааасабун муҳийнун
                Лан туғнийа ааанҳум амвалуҳум вала ауладуҳум мина аллааҳи шайан олайка ашабу аннари ҳум фийҳа халидуна
                Йаума йабааасуҳуму аллааҳу жамийааан файаҳлифуна лаҳу кама йаҳлифуна лакум вайаҳсабуна аннаҳум ааала шайин ала иннаҳум ҳуму алкасибуна
                Истаҳваса ааалайҳиму ашшайтану фаансаҳум сикра аллааҳи олайка ҳизбу ашшайтани ала инна ҳизба ашшайтани ҳуму алхасируна
                Инна аллазийна йуҳаддуна аллааҳа варасулаҳу олайка фий аласаллийна
                Катаба аллааҳу лаағлибанна ана варусулий инна аллааҳа қауиййун ааазийзун
                Ла тажиду қауман йуминуна биаллааҳи ваалйауми алахири йуваддуна ман ҳадда аллааҳа варасулаҳу валау кану абааҳум ау абнааҳум ау ихванаҳум ау ааашийратаҳум олайка катаба фий қулубиҳиму алиймана вааййадаҳум бируҳин минҳу вайудхилуҳум жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа радийа аллааҳу ааанҳум вараду ааанҳу олайка ҳизбу аллааҳи ала инна ҳизба аллааҳи ҳуму алмуфлиҳуна
            """.trimIndent(),
        ),
        Surah(
            id = 59,
            arabicName = "الحشر",
            latinName = "Al-Hashr",
            transliteration = """
                Саббаҳа лиллаҳи ма фий ассамауати вама фий аларди ваҳува алааазийзу алҳакийму
                Ҳува аллазий ахража аллазийна кафару мин аҳли алкитаби мин дийариҳим лиаували алҳашри ма санантум ан йахружу васанну аннаҳум маниааатуҳум ҳусунуҳум мина аллааҳи фаатаҳуму аллааҳу мин ҳайсу лам йаҳтасибу вақасафа фий қулубиҳиму арруааба йухрибуна буйутаҳум биайдийҳим ваайдий алмуминийна файаатабиру йа олий алабсари
                Валаула ан катаба аллааҳу ааалайҳиму алжалаа лаааассабаҳум фий аддунйа валаҳум фий алахирати ааасабу аннари
                Салика бианнаҳум шаққу аллааҳа варасулаҳу ваман йушаққи аллааҳа файнна аллааҳа шадийду алааиқаби
                Ма қатааатум мин лийнатин ау тарактумуҳа қайматан ааала осулиҳа фабийсни аллааҳи валийухзийа алфасиқийна
                Вама афаа аллааҳу ааала расулиҳи минҳум фама аужафтум ааалайҳи мин хайлин вала рикабин валакинна аллааҳа йусаллиту русулаҳу ааала ман йашао вааллааҳу ааала кулли шайин қадийрун
                Ма афаа аллааҳу ааала расулиҳи мин аҳли алқура фалиллаҳи валилррасули валисий алқурба ваалйатама ваалмасакийни вайбни ассабийли кай ла йакуна дулатан байна алағнийай минкум вама атакуму аррасулу фахусуҳу вама наҳакум ааанҳу файнтаҳу вайттақу аллааҳа инна аллааҳа шадийду алааиқаби
                Лилфуқарай алмуҳажирийна аллазийна охрижу мин дийариҳим ваамвалиҳим йабтағуна фадлан мина аллааҳи варидванан вайансуруна аллааҳа варасулаҳу олайка ҳуму ассадиқуна
                Вааллазийна табаувау аддара ваалиймана мин қаблиҳим йуҳиббуна ман ҳажара илайҳим вала йажидуна фий судуриҳим ҳажатан мимма уту вайусируна ааала анфусиҳим валау кана биҳим хасасатун ваман йуқа шуҳҳа нафсиҳи фаолайка ҳуму алмуфлиҳуна
                Вааллазийна жау мин бааадиҳим йақулуна роббана иғфир лана валийхванина аллазийна сабақуна биалиймани вала тажааал фий қулубина ғиллан лиллазийна аману роббана иннака рауфун роҳиймун
                Алам тара ила аллазийна нафақу йақулуна лийхваниҳиму аллазийна кафару мин аҳли алкитаби лайн охрижтум ланахружанна маааакум вала нутийаау фийкум аҳадан абадан вайн қутилтум ланансураннакум вааллааҳу йашҳаду иннаҳум лакасибуна
                Лайн охрижу ла йахружуна мааааҳум валайн қутилу ла йансурунаҳум валайн насаруҳум лайуваллунна аладбара сумма ла йунсаруна
                Лаантум ашадду роҳбатан фий судуриҳим мина аллааҳи салика бианнаҳум қаумун ла йафқаҳуна
                Ла йуқатилунакум жамийааан илла фий қуран муҳассанатин ау мин варай жудурин басуҳум байнаҳум шадийдун таҳсабуҳум жамийааан вақулубуҳум шатта салика бианнаҳум қаумун ла йааақилуна
                Камасали аллазийна мин қаблиҳим қарийбан сақу вабала амриҳим валаҳум ааасабун алиймун
                Камасали ашшайтани ис қала лилинсани окфур фаламма кафара қала инний барийон минка инний ахафу аллааҳа робба алаааламийна
                Факана ааақибатаҳума аннаҳума фий аннари халидайни фийҳа васалика жазао ассалимийна
                Йа аййуҳа аллазийна аману иттақу аллааҳа валтансур нафсун ма қаддамат лиғадин вайттақу аллааҳа инна аллааҳа хабийрун бима тааамалуна
                Вала такуну кааллазийна насу аллааҳа фаансаҳум анфусаҳум олайка ҳуму алфасиқуна
                Ла йастауий ашабу аннари ваашабу алжаннати ашабу алжаннати ҳуму алфайзуна
                Лау анзална ҳаса алқурана ааала жабалин лараайтаҳу хашиааан мутасаддиааан мин хашйати аллааҳи ватилка аламсалу надрибуҳа лилннаси лааааллааҳум йатафаккаруна
                Ҳува аллааҳу аллазий ла илаҳа илла ҳува ааалиму алғайби ваалшшаҳадати ҳува арроҳману арроҳийму
                Ҳува аллааҳу аллазий ла илаҳа илла ҳува алмалику алқуддусу ассаламу алмумину алмуҳаймину алааазийзу алжаббару алмутакаббиру субҳана аллааҳи ааамма йушрикуна
                Ҳува аллааҳу алхалиқу албарио алмусаувиру лаҳу аласмао алҳусна йусаббиҳу лаҳу ма фий ассамауати вааларди ваҳува алааазийзу алҳакийму
            """.trimIndent(),
        ),
        Surah(
            id = 60,
            arabicName = "الممتحنة",
            latinName = "Al-Mumtahanah",
            transliteration = """
                Йа аййуҳа аллазийна аману ла таттахису ааадуввий ваааадуввакум аулийаа тулқуна илайҳим биалмауаддати вақад кафару бима жаакум мина алҳаққи йухрижуна аррасула вайййакум ан тумину биаллааҳи роббикум ин кунтум харажтум жиҳадан фий сабийлий вайбтиғаа мардатий тусирруна илайҳим биалмауаддати ваана аааламу бима ахфайтум вама ааалантум ваман йафааалҳу минкум фақад далла сауаа ассабийли
                Ин йасқафукум йакуну лакам ааадаан вайабсуту илайкум айдийаҳум ваалсинатаҳум биалссуи вауадду лау такфуруна
                Лан танфаааакум арҳамукум вала ауладукум йаума алқийамати йафсилу байнакум вааллааҳу бима тааамалуна басийрун
                Қад канат лакум осватун ҳасанатун фий иброҳийма вааллазийна мааааҳу ис қалу лиқаумиҳим инна бураао минкум вамимма тааабудуна мин дуни аллааҳи кафарна бикум вабада байнана вабайнакуму алааадауату ваалбағдао абадан ҳатта тумину биаллааҳи ваҳдаҳу илла қаула иброҳийма лиабийҳи лаастағфиранна лака вама амлику лака мина аллааҳи мин шайин роббана ааалайка тауаккална вайлайка анабна вайлайка алмасийру
                Роббана ла тажааална фитнатан лиллазийна кафару вайғфир лана роббана иннака анта алааазийзу алҳакийму
                Лақад кана лакум фийҳим осватун ҳасанатун лиман кана йаржу аллааҳа ваалйаума алахира ваман йатауалла файнна аллааҳа ҳува алғанниййу алҳамийду
                Аааса аллааҳу ан йажааала байнакум вабайна аллазийна ааадайтум минҳум мауаддатан вааллааҳу қадийрун вааллааҳу ғафурун роҳиймун
                Ла йанҳакуму аллааҳу ааани аллазийна лам йуқатилукум фий аддийни валам йухрижукум мин дийарикум ан табарруҳум ватуқситу илайҳим инна аллааҳа йуҳиббу алмуқситийна
                Иннама йанҳакуму аллааҳу ааани аллазийна қаталукум фий аддийни ваахражукум мин дийарикум васаҳару ааала ихражикум ан тауаллауҳум ваман йатауаллааҳум фаолайка ҳуму ассалимуна
                Йа аййуҳа аллазийна аману иса жаакуму алмуминату муҳажиратин файмтаҳинуҳунна аллааҳу аааламу биийманиҳинна файн ааалимтумуҳунна муминатин фала таржиаауҳунна ила алкуффари ла ҳунна ҳиллун лаҳум вала ҳум йаҳиллуна лаҳунна ваатуҳум ма анфақу вала жунаҳа ааалайкум ан танкиҳуҳунна иса атайтумуҳунна ожуроҳунна вала тумсику биааисами алкауафири вайсалу ма анфақтум валйасалу ма анфақу саликум ҳукму аллааҳи йаҳкуму байнакум вааллааҳу ааалиймун ҳакиймун
                Вайн фатакум шайон мин азважикум ила алкуффари фаааақабтум фаату аллазийна саҳабат азважуҳум мисла ма анфақу вайттақу аллааҳа аллазий антум биҳи муминуна
                Йа аййуҳа аннабиййу иса жаака алмуминату йубайиаанака ааала ан ла йушрикна биаллааҳи шайан вала йасриқна вала йазнийна вала йақтулна ауладаҳунна вала йатийна бибуҳтанин йафтарийнаҳу байна айдийҳинна вааржулиҳинна вала йааасийнака фий маааруфин фабайиааҳунна вайстағфир лаҳунна аллааҳа инна аллааҳа ғафурун роҳиймун
                Йа аййуҳа аллазийна аману ла татауаллау қауман ғадиба аллааҳу ааалайҳим қад йайсу мина алахирати кама йайса алкуффару мин ашаби алқубури
            """.trimIndent(),
        ),
        Surah(
            id = 61,
            arabicName = "الصف",
            latinName = "As-Saf",
            transliteration = """
                Саббаҳа лиллаҳи ма фий ассамауати вама фий аларди ваҳува алааазийзу алҳакийму
                Йа аййуҳа аллазийна аману лима тақулуна ма ла тафааалуна
                Кабура мақтан ааинда аллааҳи ан тақулу ма ла тафааалуна
                Инна аллааҳа йуҳиббу аллазийна йуқатилуна фий сабийлиҳи саффан кааннаҳум бунйанун марсусун
                Вайс қала муса лиқаумиҳи йа қауми лима тусунаний вақад таааламуна анний расулу аллааҳи илайкум фаламма зағу азаға аллааҳу қулубаҳум вааллааҳу ла йаҳдий алқаума алфасиқийна
                Вайс қала ааийса ибну марйама йа баний исраийла инний расулу аллааҳи илайкум мусаддиқан лима байна йадаййа мина аттаурати вамубашширан бирасулин йатий мин бааадий исмуҳу аҳмаду фаламма жааҳум биалбаййинати қалу ҳаса сиҳрун мубийнун
                Ваман асламу миммани ифтара ааала аллааҳи алкасиба ваҳува йудааа ила алислами вааллааҳу ла йаҳдий алқаума ассалимийна
                Йурийдуна лийутфиу нура аллааҳи биафваҳиҳим вааллааҳу мутимму нуриҳи валау кариҳа алкафируна
                Ҳува аллазий арсала расулаҳу биалҳуда вадийни алҳаққи лийусҳироҳу ааала аддийни куллиҳи валау кариҳа алмушрикуна
                Йа аййуҳа аллазийна аману ҳал адуллукум ааала тижаратин тунжийкум мин ааасабин алиймин
                Туминуна биаллааҳи варасулиҳи ватужаҳидуна фий сабийли аллааҳи биамваликум ваанфусикум саликум хайрун лакум ин кунтум таааламуна
                Йағфир лакум сунубакум вайудхилкум жаннатин тажрий мин таҳтиҳа аланҳару вамасакина таййибатан фий жаннати аааднин салика алфаузу алааасийму
                Ваохра туҳиббунаҳа насрун мина аллааҳи вафасун қаррийбун вабашшири алмуминийна
                Йа аййуҳа аллазийна аману куну ансара аллааҳи кама қала ааийса ибну марйама лилҳауариййийна ман ансарий ила аллааҳи қала алҳауариййуна наҳну ансару аллааҳи фааманат тайфатун мин баний исраийла вакафарат тайфатун фааййадна аллазийна аману ааала ааадуввиҳим фаасбаҳу саҳирийна
            """.trimIndent(),
        ),
        Surah(
            id = 62,
            arabicName = "الجمعة",
            latinName = "Al-Jumu'ah",
            transliteration = """
                Йусаббиҳу лиллаҳи ма фий ассамауати вама фий аларди алмалики алқуддуси алааазийзи алҳакийми
                Ҳува аллазий бааааса фий аломмиййийна расулан минҳум йатлу ааалайҳим айатиҳи вайузаккийҳим вайуаааллимуҳуму алкитаба ваалҳикмата вайн кану мин қаблу лафий далалин мубийнин
                Ваахарийна минҳум ламма йалҳақу биҳим ваҳува алааазийзу алҳакийму
                Салика фадлу аллааҳи йутийҳи ман йашао вааллааҳу су алфадли алааасийми
                Масалу аллазийна ҳуммилу аттаурата сумма лам йаҳмилуҳа камасали алҳимари йаҳмилу асфаран биса масалу алқауми аллазийна кассабу биайати аллааҳи вааллааҳу ла йаҳдий алқаума ассалимийна
                Қул йа аййуҳа аллазийна ҳаду ин заааамтум аннакум аулийао лиллаҳи мин дуни аннаси фатаманнауу алмаута ин кунтум садиқийна
                Вала йатаманнаунаҳу абадан бима қаддамат айдийҳим вааллааҳу ааалиймун биалссалимийна
                Қул инна алмаута аллазий тафирруна минҳу файннаҳу мулақийкум сумма тураддуна ила ааалими алғайби ваалшшаҳадати файунаббиокум бима кунтум тааамалуна
                Йа аййуҳа аллазийна аману иса нудийа лилссалати мин йауми алжумуааати файсааау ила сикри аллааҳи васару албайааа саликум хайрун лакум ин кунтум таааламуна
                Файса қудийати ассалату файнташиру фий аларди вайбтағу мин фадли аллааҳи ваоскуру аллааҳа касийран лааааллакум туфлиҳуна
                Вайса раав тижаратан ау лаҳван инфадду илайҳа ватаракука қайман қул ма ааинда аллааҳи хайрун мина аллааҳви вамина аттижарати вааллааҳу хайру арразиқийна
            """.trimIndent(),
        ),
        Surah(
            id = 63,
            arabicName = "المنافقون",
            latinName = "Al-Munafiqun",
            transliteration = """
                Иса жаака алмунафиқуна қалу нашҳаду иннака ларасулу аллааҳи вааллааҳу йаааламу иннака ларасулуҳу вааллааҳу йашҳаду инна алмунафиқийна лакасибуна
                Иттахасу айманаҳум жуннатан фасадду ааан сабийли аллааҳи иннаҳум саа ма кану йааамалуна
                Салика бианнаҳум аману сумма кафару фатубиааа ааала қулубиҳим фаҳум ла йафқаҳуна
                Вайса раайтаҳум туаажибука ажсамуҳум вайн йақулу тасмааа лиқаулиҳим кааннаҳум хушубун мусаннадатун йаҳсабуна кулла сайҳатин ааалайҳим ҳуму алааадувву файҳсарҳум қаталаҳуму аллааҳу анна йуфакуна
                Вайса қийла лаҳум таааалау йастағфир лакум расулу аллааҳи лаувау руусаҳум вараайтаҳум йасуддуна ваҳум мустакбируна
                Сауаон ааалайҳим астағфарта лаҳум ам лам тастағфир лаҳум лан йағфира аллааҳу лаҳум инна аллааҳа ла йаҳдий алқаума алфасиқийна
                Ҳуму аллазийна йақулуна ла тунфиқу ааала ман ааинда расули аллааҳи ҳатта йанфадду валиллаҳи хазайну ассамауати вааларди валакинна алмунафиқийна ла йафқаҳуна
                Йақулуна лайн ражааана ила алмадийнати лайухрижанна алааааззу минҳа аласалла валиллаҳи алааиззату валирасулиҳи валилмуминийна валакинна алмунафиқийна ла йаааламуна
                Йа аййуҳа аллазийна аману ла тулҳикум амвалукум вала ауладукум ааан сикри аллааҳи ваман йафааал салика фаолайка ҳуму алхасируна
                Ваанфиқу мин ма разақнакум мин қабли ан йатийа аҳадакуму алмауту файақула робби лаула аххартаний ила ажалин қарийбин фаассаддақа ваакун мина ассалиҳийна
                Валан йуаххира аллааҳу нафсан иса жаа ажалуҳа вааллааҳу хабийрун бима тааамалуна
            """.trimIndent(),
        ),
        Surah(
            id = 64,
            arabicName = "التغابن",
            latinName = "At-Taghabun",
            transliteration = """
                Йусаббиҳу лиллаҳи ма фий ассамауати вама фий аларди лаҳу алмулку валаҳу алҳамду ваҳува ааала кулли шайин қадийрун
                Ҳува аллазий халақакум фаминкум кафирун ваминкум муминун вааллааҳу бима тааамалуна басийрун
                Халақа ассамауати вааларда биалҳаққи васауваракум фааҳсана суваракум вайлайҳи алмасийру
                Йаааламу ма фий ассамауати вааларди вайаааламу ма тусирруна вама туаалинуна вааллааҳу ааалиймун бисати ассудури
                Алам йатикум набао аллазийна кафару мин қаблу фасақу вабала амриҳим валаҳум ааасабун алиймун
                Салика бианнаҳу канат татийҳим русулуҳум биалбаййинати фақалу абашарун йаҳдунана факафару ватауаллау вайстағна аллааҳу вааллааҳу ғаниййун ҳамийдун
                Заааама аллазийна кафару ан лан йубааасу қул бала вароббий латубааасунна сумма латунаббаонна бима ааамилтум васалика ааала аллааҳи йасийрун
                Фаамину биаллааҳи варасулиҳи ваалннури аллазий анзална вааллааҳу бима тааамалуна хабийрун
                Йаума йажмаааукум лийауми алжамааи салика йауму аттағабуни ваман йумин биаллааҳи вайааамал салиҳан йукаффир ааанҳу саййиатиҳи вайудхилҳу жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа абадан салика алфаузу алааасийму
                Вааллазийна кафару вакассабу биайатина олайка ашабу аннари халидийна фийҳа вабиса алмасийру
                Ма асаба мин мусийбатин илла бийсни аллааҳи ваман йумин биаллааҳи йаҳди қалбаҳу вааллааҳу бикулли шайин ааалиймун
                Ваатийаау аллааҳа ваатийаау аррасула файн тауаллайтум файннама ааала расулина албалағу алмубийну
                Аллааҳу ла илаҳа илла ҳува ваааала аллааҳи фалйатауаккали алмуминуна
                Йа аййуҳа аллазийна аману инна мин азважикум ваавладикум ааадувван лакум файҳсаруҳум вайн тааафу ватасфаҳу ватағфиру файнна аллааҳа ғафурун роҳиймун
                Иннама амвалукум ваавладукум фитнатун вааллааҳу ааиндаҳу ажрун ааасиймун
                Файттақу аллааҳа ма истатааатум вайсмааау ваатийаау ваанфиқу хайран лианфусикум ваман йуқа шуҳҳа нафсиҳи фаолайка ҳуму алмуфлиҳуна
                Ин туқриду аллааҳа қардан ҳасанан йудааайфҳу лакум вайағфир лакум вааллааҳу шакурун ҳалиймун
                Ааалиму алғайби ваалшшаҳадати алааазийзу алҳакийму
            """.trimIndent(),
        ),
        Surah(
            id = 65,
            arabicName = "الطلاق",
            latinName = "At-Talaq",
            transliteration = """
                Йа аййуҳа аннабиййу иса таллақтуму аннисаа фаталлиқуҳунна лиааиддатиҳинна вааҳсу алааиддата вайттақу аллааҳа роббакум ла тухрижуҳунна мин буйутиҳинна вала йахружна илла ан йатийна бифаҳишатин мубаййинатин ватилка ҳудуду аллааҳи ваман йатаааадда ҳудуда аллааҳи фақад салама нафсаҳу ла тадрий лаааалла аллааҳа йуҳдису бааада салика амран
                Файса балағна ажалаҳунна фаамсикуҳунна бимаааруфин ау фариқуҳунна бимаааруфин ваашҳиду сауай ааадлин минкум ваақийму ашшаҳадата лиллаҳи саликум йуааасу биҳи ман кана йумину биаллааҳи ваалйауми алахири ваман йаттақи аллааҳа йажааал лаҳу махражан
                Вайарзуқҳу мин ҳайсу ла йаҳтасибу ваман йатауаккал ааала аллааҳи фаҳува ҳасбуҳу инна аллааҳа балиғу амриҳи қад жаааала аллааҳу ликулли шайин қадран
                Вааллаий йайсна мина алмаҳийди мин нисайкум ини иртабтум фааайддатуҳунна саласату ашҳурин вааллаий лам йаҳидна ваолату алаҳмали ажалуҳунна ан йадааана ҳамлаҳунна ваман йаттақи аллааҳа йажааал лаҳу мин амриҳи йусран
                Салика амру аллааҳи анзалаҳу илайкум ваман йаттақи аллааҳа йукаффир ааанҳу саййиатиҳи вайуаасим лаҳу ажран
                Аскинуҳунна мин ҳайсу сакантум мин вуждикум вала тударруҳунна литудаййиқу ааалайҳинна вайн кунна олати ҳамлин фаанфиқу ааалайҳинна ҳатта йадааана ҳамлаҳунна файн ардааана лакум фаатуҳунна ожуроҳунна ватамиру байнакум бимаааруфин вайн таааасартум фасатурдиаау лаҳу охра
                Лийунфиқ су саааатин мин саааатиҳи ваман қудира ааалайҳи ризқуҳу фалйунфиқ мимма атаҳу аллааҳу ла йукаллифу аллааҳу нафсан илла ма атаҳа сайажааалу аллааҳу бааада ааусрин йусран
                Вакааййин мин қарйатин ааатат ааан амри роббиҳа варусулиҳи фаҳасабнаҳа ҳисабан шадийдан ваааассабнаҳа ааасабан нукран
                Фасақат вабала амриҳа вакана ааақибату амриҳа хусран
                Аааадда аллааҳу лаҳум ааасабан шадийдан файттақу аллааҳа йа олий алалбаби аллазийна аману қад анзала аллааҳу илайкум сикран
                Расулан йатлу ааалайкум айати аллааҳи мубаййинатин лийухрижа аллазийна аману ваааамилу ассалиҳати мина ассулумати ила аннури ваман йумин биаллааҳи вайааамал салиҳан йудхилҳу жаннатин тажрий мин таҳтиҳа аланҳару халидийна фийҳа абадан қад аҳсана аллааҳу лаҳу ризқан
                Аллааҳу аллазий халақа сабааа самауатин вамина аларди мислаҳунна йатаназзалу аламру байнаҳунна литаааламу анна аллааҳа ааала кулли шайин қадийрун ваанна аллааҳа қад аҳата бикулли шайин ааилман
            """.trimIndent(),
        ),
        Surah(
            id = 66,
            arabicName = "التحريم",
            latinName = "At-Tahrim",
            transliteration = """
                Йа аййуҳа аннабиййу лима туҳарриму ма аҳалла аллааҳу лака табтағий мардата азважика вааллааҳу ғафурун роҳиймун
                Қад фарада аллааҳу лакум таҳиллата айманикум вааллааҳу маулакум ваҳува алааалийму алҳакийму
                Вайс асарра аннабиййу ила бааади азважиҳи ҳадийсан фаламма наббаат биҳи ваасҳароҳу аллааҳу ааалайҳи аааррафа бааадаҳу ваааарада ааан бааадин фаламма наббааҳа биҳи қалат ман анбаака ҳаса қала наббаанийа алааалийму алхабийру
                Ин татуба ила аллааҳи фақад сағат қулубукума вайн тасаҳара ааалайҳи файнна аллааҳа ҳува маулаҳу важибрийлу васалиҳу алмуминийна ваалмалайкату бааада салика саҳийрун
                Аааса роббуҳу ин таллақакунна ан йубдилаҳу азважан хайран минкунна муслиматин муминатин қанитатин тайбатин ааабидатин сайҳатин саййибатин ваабкаран
                Йа аййуҳа аллазийна аману қу анфусакум вааҳлийкум наран вақудуҳа аннасу ваалҳижарату ааалайҳа малайкатун ғиласун шидадун ла йааасуна аллааҳа ма амароҳум вайафааалуна ма йумаруна
                Йа аййуҳа аллазийна кафару ла тааатасиру алйаума иннама тужзауна ма кунтум тааамалуна
                Йа аййуҳа аллазийна аману тубу ила аллааҳи таубатан насуҳан аааса роббукум ан йукаффира ааанкум саййиатикум вайудхилакум жаннатин тажрий мин таҳтиҳа аланҳару йаума ла йухзий аллааҳу аннабиййа вааллазийна аману мааааҳу нуруҳум йасааа байна айдийҳим вабиайманиҳим йақулуна роббана атмим лана нурана вайғфир лана иннака ааала кулли шайин қадийрун
                Йа аййуҳа аннабиййу жаҳиди алкуффара ваалмунафиқийна ваоғлус ааалайҳим вамауаҳум жаҳаннаму вабиса алмасийру
                Дароба аллааҳу масалан лиллазийна кафару имраата нуҳин ваймраата лутин каната таҳта ааабдайни мин ааибадина салиҳайни фаханатаҳума фалам йуғнийа ааанҳума мина аллааҳи шайан вақийла одхула аннара маааа аддахилийна
                Вадароба аллааҳу масалан лиллазийна аману имраата фирааауна ис қалат робби ибни лий ааиндака байтан фий алжаннати ванажжиний мин фирааауна ваааамалиҳи ванажжиний мина алқауми ассалимийна
                Вамарйама ибната ааимрана аллатий аҳсанат фаржаҳа фанафахна фийҳи мин руҳина васаддақат бикалимати роббиҳа вакутубиҳи ваканат мина алқанитийна
            """.trimIndent(),
        ),
        Surah(
            id = 67,
            arabicName = "الملك",
            latinName = "Al-Mulk",
            transliteration = """
                Бисмиллаҳир роҳманир роҳийм.
                1. Таборакаллазий бийадиҳил мулк, ва ҳува ъала кулли шайъин қадийр.
                2. Аллазий халақал мавта валҳаёта лияблувакум аййукум аҳсану амалан, ва ҳува ал-ъазийзул ғофур.
                3. Аллазий халақа сабъа самаватин тибақа, ма тара фий холқи-р-роҳмани мин тафавут, фарджаъил басора ҳал тара мин футур.
                4. Сумма рджаъил басора карратайни янқалибу илайкал басору хошиъан ва ҳува хасийр.
                5. Ва лақад заййаннас-самаад-дуния бимасобийҳа ва жаъалнаҳа руджумал лиш-шайатийн, ва аътадно лаҳум ъазабас саъийр.
                6. Ва лиллазина кафару би роббихим ъазабу Жаҳаннам ва би’сал масийр.
                7. Иза улқу фиҳа самиъу лаҳа шахиқан ва ҳия тафур.
                8. Такоду тамаййазу минал ғойз, куллама улқи фиҳа фаужун са’алаҳум хазанаҳо а лам я’тикум назийр.
                9. Қолу бало, қад жа’ана назийрун факаззабна ва кулна ма наззала-Ллоҳу мин шай’, ин антум илла фий золалин кабийр.
                10. Ва қолу лав кунна насмаъу ав наъқилу ма кунна фий асҳабис саъийр.
                11. Фаътарофу бизанбихим фа суҳқан ли асҳабис саъийр.
                12. Инналлазина яхшауона роббахум бил ғойби лаҳум мағфиратун ва ажрун кабийр.
                13. Ва асирру қавликум авиджҳару бих, иннаҳу ъалимум бизотис судур.
                14. А ла яъламу ман халақа ва ҳувал латифул хобийр.
                15. Ҳуваллазий жаъала лакумул арда золюлан фамшу фий манакибиҳа ва кулу мин ризқихи ва илайҳин нушур.
                16. А аминтум ман фис-самаи ай яхсифа бикумул ардо фа иза ҳия тамур.
                17. Ам аминтум ман фис-самаи ай юрсила ъалайкум ҳосибан фа са таъламуна кайфа назир.
                18. Ва лақад каззаба ллазина мин қаблиҳим фа кайфа кано накир.
                19. А ва лам ярау ила ттойри фавқаҳум соффотин ва яқбидна ма юмсикаҳунна илла-р-роҳман, иннаҳу бикулли шай’ин басийр.
                20. Ам ман ҳаза ллазий ҳува жундун лакум янсурукум мин дуни-р-роҳман, ин-ил кафируна илла фий ғурур.
                21. Ам ман ҳаза ллазий ярзуқукум ин амсака ризқах, бал лажжу фий ъутуввин ва нуфур.
                22. А фа ман ямший мукиббан ъала важҳиҳи аҳда соубилан ам ман ямший савийян ъала сиротин мустақийм.
                23. Қул ҳуваллазий аншаакум ва жаъала лакумус самъа вал абсора вал афъида, қалилан ма ташкурун.
                24. Қул ҳуваллазий зараакум фил арди ва илайҳи тухшарун.
                25. Ва яқулуна мато ҳаза-л ваъду ин кунтум содиқийн.
                26. Қул иннамал ъилму ъиндаллоҳ, ва иннама ана назийрун мубийн.
                27. Фа ламма ра’аву зулфатан сийат вужуҳул-лазина кафару ва қийла ҳаза-ллазий кунтум бихи тадаъун.
                28. Қул араайтум ин аҳлаканийаллоҳу ва ман маъийя ав рахимана фа ман южиру ал-кафирина мин ъазабин алийм.
                29. Қул ҳувар роҳман, аманна бихи ва ъалайҳи таваккална, фа са таъламуна ман ҳува фий долалин мубийн.
                30. Қул араайтум ин асбаха маукум ғавран, фа май йа’тикум бима’ин ма’ийн.
            """.trimIndent(),
        ),
        Surah(
            id = 68,
            arabicName = "القلم",
            latinName = "Al-Qalam",
            transliteration = """
                Нун ваалқалами вама йастуруна
                Ма анта биниаамати роббика бимажнунин
                Вайнна лака лаажран ғайра мамнунин
                Вайннака лаааала хулуқин ааасиймин
                Фасатубсиру вайубсируна
                Биаййикуму алмафтуну
                Инна роббака ҳува аааламу биман далла ааан сабийлиҳи ваҳува аааламу биалмуҳтадийна
                Фала тутиааи алмукассибийна
                Вадду лау тузину файузинуна
                Вала тутиаа кулла ҳаллафин маҳийнин
                Ҳаммазин машшайн бинамиймин
                Маннааайн лилхайри муаатадин асиймин
                Ааутуллин бааада салика заниймин
                Ан кана са малин вабанийна
                Иса тутла ааалайҳи айатуна қала асатийру алаувалийна
                Санасимуҳу ааала алхуртуми
                Инна балаунаҳум кама балауна ашаба алжаннати ис ақсаму лайасримуннаҳа мусбиҳийна
                Вала йастаснуна
                Фатафа ааалайҳа тайфун мин роббика ваҳум наймуна
                Фаасбаҳат каалссарийми
                Фатанадау мусбиҳийна
                Ани иғду ааала ҳарсикум ин кунтум саримийна
                Файнталақу ваҳум йатахафатуна
                Ан ла йадхуланнаҳа алйаума ааалайкум мискийнун
                Вағадау ааала ҳардин қадирийна
                Фаламма раавҳа қалу инна ладаллуна
                Бал наҳну маҳрумуна
                Қала аусатуҳум алам ақул лакум лаула тусаббиҳуна
                Қалу субҳана роббина инна кунна салимийна
                Фаақбала бааадуҳум ааала бааадин йаталауамуна
                Қалу йа вайлана инна кунна тағийна
                Аааса роббуна ан йубдилана хайран минҳа инна ила роббина рағибуна
                Касалика алааасабу валаааасабу алахирати акбару лау кану йаааламуна
                Инна лилмуттақийна ааинда роббиҳим жаннати аннаааийми
                Афанажааалу алмуслимийна каалмужримийна
                Ма лакум кайфа таҳкумуна
                Ам лакум китабун фийҳи тадрусуна
                Инна лакум фийҳи лама тахаййаруна
                Ам лакум айманун ааалайна балиғатун ила йауми алқийамати инна лакум лама таҳкумуна
                Салҳум аййуҳум бисалика заааиймун
                Ам лаҳум шуракао фалйату бишуракайҳим ин кану садиқийна
                Йаума йукшафу ааан сақин вайудааауна ила ассужуди фала йастатийаауна
                Хашиааатан абсаруҳум тарҳақуҳум силлатун вақад кану йудааауна ила ассужуди ваҳум салимуна
                Фасарний ваман йукассибу биҳаса алҳадийси санастадрижуҳум мин ҳайсу ла йаааламуна
                Ваомлий лаҳум инна кайдий матийнун
                Ам тасалуҳум ажран фаҳум мин мағрамин мусқалуна
                Ам ааиндаҳуму алғайбу фаҳум йактубуна
                Файсбир лиҳукми роббика вала такун касаҳиби алҳути ис нада ваҳува максумун
                Лаула ан тадаракаҳу ниааматун мин роббиҳи ланубиса биалааарай ваҳува масмумун
                Файжтабаҳу роббуҳу фажаааалаҳу мина ассалиҳийна
                Вайн йакаду аллазийна кафару лайузлиқунака биабсариҳим ламма самиаау ассикра вайақулуна иннаҳу ламажнунун
                Вама ҳува илла сикрун лилаааламийна
            """.trimIndent(),
        ),
        Surah(
            id = 69,
            arabicName = "الحاقة",
            latinName = "Al-Haqqah",
            transliteration = """
                Алҳаққату
                Ма алҳаққату
                Вама адрака ма алҳаққату
                Кассабат самуду ваааадун биалқариааати
                Фаамма самуду фаоҳлику биалттағийати
                Ваамма ааадун фаоҳлику бирийҳин сарсарин ааатийатин
                Саххароҳа ааалайҳим сабааа лайалин васаманийата аййамин ҳусуман фатара алқаума фийҳа сарааа кааннаҳум ааажазу нахлин хауийатун
                Фаҳал тара лаҳум мин бақийатин
                Важаа фирааауну ваман қаблаҳу ваалмутафикату биалхатиати
                Фаааасау расула роббиҳим фаахасаҳум ахсатан робийатан
                Инна ламма таға алмао ҳамалнакум фий алжарийати
                Линажааалаҳа лакум таскиратан ватаааййаҳа осунун ваааййатун
                Файса нуфиха фий ассури нафхатун ваҳидатун
                Ваҳумилати аларду ваалжибалу фадукката даккатан ваҳидатан
                Файаумайсин вақаааати алвақиааату
                Вайншаққати ассамао фаҳийа йаумайсин ваҳийатун
                Ваалмалаку ааала аржайҳа вайаҳмилу ааарша роббика фауқаҳум йаумайсин саманийатун
                Йаумайсин туаарадуна ла тахфа минкум хафийатун
                Фаамма ман утийа китабаҳу бийамийниҳи файақулу ҳаому иқрау китабийаҳ
                Инний сананту анний мулақин ҳисабийаҳ
                Фаҳува фий ааийшатин радийатин
                Фий жаннатин ааалийатин
                Қутуфуҳа данийатун
                Кулу вайшробу ҳанийан бима аслафтум фий алаййами алхалийати
                Ваамма ман утийа китабаҳу бишималиҳи файақулу йа лайтаний лам ута китабийаҳ
                Валам адри ма ҳисабийаҳ
                Йа лайтаҳа канати алқадийату
                Ма ағна ааанний малийаҳ
                Ҳалака ааанний султанийаҳ
                Хусуҳу фағуллуҳу
                Сумма алжаҳийма саллуҳу
                Сумма фий силсилатин сараауҳа сабаауна сираааан фаослукуҳу
                Иннаҳу кана ла йумину биаллааҳи алааасийми
                Вала йаҳудду ааала таааами алмискийни
                Фалайса лаҳу алйаума ҳаҳуна ҳамиймун
                Вала таааамун илла мин ғислийнин
                Ла йакулуҳу илла алхатиуна
                Фала оқсиму бима тубсируна
                Вама ла тубсируна
                Иннаҳу лақаулу расулин кариймин
                Вама ҳува биқаули шааайрин қалийлан ма туминуна
                Вала биқаули каҳинин қалийлан ма тасаккаруна
                Танзийлун мин робби алаааламийна
                Валау тақаувала ааалайна бааада алақауийли
                Лаахасна минҳу биалйамийни
                Сумма лақатааана минҳу алватийна
                Фама минкум мин аҳадин ааанҳу ҳажизийна
                Вайннаҳу латаскиратун лилмуттақийна
                Вайнна ланаааламу анна минкум мукассибийна
                Вайннаҳу лаҳасратун ааала алкафирийна
                Вайннаҳу лаҳаққу алйақийни
                Фасаббиҳ бийсми роббика алааасийми
            """.trimIndent(),
        ),
        Surah(
            id = 70,
            arabicName = "المعارج",
            latinName = "Al-Ma'arij",
            transliteration = """
                Саала сайлун биааасабин вақиааин
                Лилкафирийна лайса лаҳу дафиааун
                Мина аллааҳи сий алмаааарижи
                Таааружу алмалайкату ваалрруҳу илайҳи фий йаумин кана миқдаруҳу хамсийна алфа санатин
                Файсбир сабран жамийлан
                Иннаҳум йараунаҳу баааийдан
                Ванароҳу қарийбан
                Йаума такуну ассамао каалмуҳли
                Ватакуну алжибалу каалааиҳни
                Вала йасалу ҳамиймун ҳамийман
                Йубассарунаҳум йауадду алмужриму лау йафтадий мин ааасаби йаумийсин бибанийҳи
                Васаҳибатиҳи ваахийҳи
                Вафасийлатиҳи аллатий тувийҳи
                Ваман фий аларди жамийааан сумма йунжийҳи
                Калла иннаҳа ласа
                Наззаааатан лилшшауа
                Тадаау ман адбара ватауалла
                Важамаааа фаавааа
                Инна алинсана хулиқа ҳалуааан
                Иса массаҳу ашшарру жазуааан
                Вайса массаҳу алхайру мануааан
                Илла алмусаллийна
                Аллазийна ҳум ааала салатиҳим даймуна
                Вааллазийна фий амвалиҳим ҳаққун мааалумун
                Лилссайли ваалмаҳруми
                Вааллазийна йусаддиқуна бийауми аддийни
                Вааллазийна ҳум мин ааасаби роббиҳим мушфиқуна
                Инна ааасаба роббиҳим ғайру мамунин
                Вааллазийна ҳум лифуружиҳим ҳафисуна
                Илла ааала азважиҳим ау ма малакат аймануҳум файннаҳум ғайру малумийна
                Фамани ибтаға вараа салика фаолайка ҳуму алааадуна
                Вааллазийна ҳум лиаманатиҳим вааааҳдиҳим рааауна
                Вааллазийна ҳум бишаҳадатиҳим қаймуна
                Вааллазийна ҳум ааала салатиҳим йуҳафисуна
                Олайка фий жаннатин мукрамуна
                Фамали аллазийна кафару қибалака муҳтиааийна
                Ааани алйамийни ваааани ашшимали ааизийна
                Айатмааау куллу имрийн минҳум ан йудхала жанната наааиймин
                Калла инна халақнаҳум мимма йаааламуна
                Фала оқсиму биробби алмашариқи ваалмағариби инна лақадируна
                Ааала ан нубаддила хайран минҳум вама наҳну бимасбуқийна
                Фасарҳум йахуду вайалааабу ҳатта йулақу йаумаҳуму аллазий йуааадуна
                Йаума йахружуна мина алаждаси сираааан кааннаҳум ила нусубин йуфидуна
                Хашиааатан абсаруҳум тарҳақуҳум силлатун салика алйауму аллазий кану йуааадуна
            """.trimIndent(),
        ),
        Surah(
            id = 71,
            arabicName = "نوح",
            latinName = "Nuh",
            transliteration = """
                Инна арсална нуҳан ила қаумиҳи ан ансир қаумака мин қабли ан йатийаҳум ааасабун алиймун
                Қала йа қауми инний лакум насийрун мубийнун
                Ани оаабуду аллааҳа вайттақуҳу ваатийаауни
                Йағфир лакум мин сунубикум вайуаххиркум ила ажалин мусамман инна ажала аллааҳи иса жаа ла йуаххару лау кунтум таааламуна
                Қала робби инний даааавту қаумий лайлан ванаҳаран
                Фалам йазизум дуаааий илла фираран
                Вайнний куллама даааавтуҳум литағфира лаҳум жаааалу асабиаааҳум фий асаниҳим вайстағшау сийабаҳум ваасарру вайстакбару истикбаран
                Сумма инний даааавтуҳум жиҳаран
                Сумма инний аааланту лаҳум ваасрарту лаҳум исраран
                Фақулту истағфиру роббакум иннаҳу кана ғаффаран
                Йурсили ассамаа ааалайкум мидраран
                Вайумдидкум биамвалин вабанийна вайажааал лакум жаннатин вайажааал лакум анҳаран
                Ма лакум ла таржуна лиллаҳи вақаран
                Вақад халақакум атваран
                Алам тарау кайфа халақа аллааҳу сабааа самауатин тибақан
                Важаааала алқамара фийҳинна нуран важаааала ашшамса сиражан
                Вааллааҳу анбатакум мина аларди набатан
                Сумма йуааийдукум фийҳа вайухрижукум ихражан
                Вааллааҳу жаааала лакуму аларда бисатан
                Литаслуку минҳа субулан фижажан
                Қала нуҳун робби иннаҳум ааасауний вайттабааау ман лам йазизу малуҳу вауаладуҳу илла хасаран
                Вамакару макран куббаран
                Вақалу ла тасарунна алиҳатакум вала тасарунна ваддан вала суваааан вала йағуса вайааауқа ванасран
                Вақад адаллу касийран вала тазиди ассалимийна илла далалан
                Мимма хатийатиҳим оғриқу фаодхилу наран фалам йажиду лаҳум мин дуни аллааҳи ансаран
                Вақала нуҳун робби ла тасар ааала аларди мина алкафирийна даййаран
                Иннака ин тасарҳум йудиллу ааибадака вала йалиду илла фажиран каффаран
                Робби иғфир лий валивалидаййа валиман дахала байтийа муминан валилмуминийна ваалмуминати вала тазиди ассалимийна илла табаран
            """.trimIndent(),
        ),
        Surah(
            id = 72,
            arabicName = "الجن",
            latinName = "Al-Jinn",
            transliteration = """
                Қул уҳийа илаййа аннаҳу истамаааа нафарун мина алжинни фақалу инна самиаана қуранан ааажабан
                Йаҳдий ила аррушди фааманна биҳи валан нушрика бироббина аҳадан
                Вааннаҳу таааала жадду роббина ма иттахаса саҳибатан вала валадан
                Вааннаҳу кана йақулу сафийҳуна ааала аллааҳи шататан
                Ваанна сананна ан лан тақула алинсу ваалжинну ааала аллааҳи касибан
                Вааннаҳу кана рижалун мина алинси йаааусуна бирижалин мина алжинни фазадуҳум роҳақан
                Вааннаҳум санну кама санантум ан лан йабаааса аллааҳу аҳадан
                Ваанна ламасна ассамаа фауажаднаҳа мулиат ҳарасан шадийдан вашуҳубан
                Ваанна кунна нақаауду минҳа мақааайда лилссамааи фаман йастамиааи алана йажид лаҳу шиҳабан расадан
                Ваанна ла надрий ашаррун орийда биман фий аларди ам арада биҳим роббуҳум рашадан
                Ваанна минна ассалиҳуна ваминна дуна салика кунна тарайқа қидадан
                Ванна сананна ан лан нуаажиза аллааҳа фий аларди валан нуаажизаҳу ҳаробан
                Ваанна ламма самиаана алҳуда аманна биҳи фаман йумин бироббиҳи фала йахафу бахсан вала роҳақан
                Ваанна минна алмуслимуна ваминна алқаситуна фаман аслама фаолайка таҳаррау рашадан
                Ваама алқаситуна факану лижаҳаннама ҳатабан
                Вааллауи истақаму ааала аттарийқати лаасқайнаҳум маан ғадақан
                Линафтинаҳум фийҳи ваман йуаарид ааан сикри роббиҳи йаслуху ааасабан саааадан
                Ваанна алмасажида лиллаҳи фала тадаау маааа аллааҳи аҳадан
                Вааннаҳу ламма қама ааабду аллааҳи йадаауҳу каду йакунуна ааалайҳи либадан
                Қул иннама адаау роббий вала ошрику биҳи аҳадан
                Қул инний ла амлику лакум дарран вала рашадан
                Қул инний лан йужийраний мина аллааҳи аҳадун валан ажида мин дуниҳи мултаҳадан
                Илла балаған мина аллааҳи варисалатиҳи ваман йаааси аллааҳа варасулаҳу файнна лаҳу нара жаҳаннама халидийна фийҳа абадан
                Ҳатта иса раав ма йуааадуна фасайаааламуна ман адааафу насиран ваақаллу ааададан
                Қул ин адрий ақарийбун ма туааадуна ам йажааалу лаҳу роббий амадан
                Ааалиму алғайби фала йусҳиру ааала ғайбиҳи аҳадан
                Илла мани иртада мин расулин файннаҳу йаслуку мин байни йадайҳи вамин халфиҳи расадан
                Лийааалама ан қад аблағу рисалати роббиҳим вааҳата бима ладайҳим вааҳса кулла шайин ааададан
            """.trimIndent(),
        ),
        Surah(
            id = 73,
            arabicName = "المزمل",
            latinName = "Al-Muzzammil",
            transliteration = """
                Йа аййуҳа алмуззаммилу
                Қуми аллайла илла қалийлан
                Нисфаҳу ауи онқус минҳу қалийлан
                Ау зид ааалайҳи вараттили алқурана тартийлан
                Инна санулқий ааалайка қаулан сақийлан
                Инна нашиата аллайли ҳийа ашадду ватан ваақваму қийлан
                Инна лака фий аннаҳари сабҳан тауийлан
                Ваоскури исма роббика ватабаттал илайҳи табтийлан
                Роббу алмашриқи ваалмағриби ла илаҳа илла ҳува файттахисҳу вакийлан
                Вайсбир ааала ма йақулуна ваоҳжурҳум ҳажран жамийлан
                Васарний ваалмукассибийна олий аннааамати вамаҳҳилҳум қалийлан
                Инна ладайна анкалан важаҳийман
                Ватааааман са ғуссатин ваааасабан алийман
                Йаума таржуфу аларду ваалжибалу ваканати алжибалу касийбан маҳийлан
                Инна арсална илайкум расулан шаҳидан ааалайкум кама арсална ила фирааауна расулан
                Фааааса фирааауну аррасула фаахаснаҳу ахсан вабийлан
                Факайфа таттақуна ин кафартум йауман йажааалу алвилдана шийбан
                Ассамао мунфатирун биҳи кана вааадуҳу мафааулан
                Инна ҳасиҳи таскиратун фаман шаа иттахаса ила роббиҳи сабийлан
                Инна роббака йаааламу аннака тақуму адна мин сулусайи аллайли ванисфаҳу васулусаҳу ватайфатун мина аллазийна маааака вааллааҳу йуқаддиру аллайла ваалннаҳара ааалима ан лан туҳсуҳу фатаба ааалайкум файқрау ма тайассара мина алқурани ааалима ан сайакуну минкум марда ваахаруна йадрибуна фий аларди йабтағуна мин фадли аллааҳи ваахаруна йуқатилуна фий сабийли аллааҳи файқрау ма тайассара минҳу ваақийму ассалата ваату аззаката ваақриду аллааҳа қардан ҳасанан вама туқаддиму лианфусикум мин хайрин тажидуҳу ааинда аллааҳи ҳува хайран ваааасама ажран вайстағфиру аллааҳа инна аллааҳа ғафурун роҳиймун
            """.trimIndent(),
        ),
        Surah(
            id = 74,
            arabicName = "المدثر",
            latinName = "Al-Muddaththir",
            transliteration = """
                Йа аййуҳа алмуддассиру
                Қум фаансир
                Вароббака факаббир
                Васийабака фатаҳҳир
                Ваалрружза фаоҳжур
                Вала тамнун тастаксиру
                Валироббика файсбир
                Файса нуқира фий аннақури
                Фасалика йаумайсин йаумун ааасийрун
                Ааала алкафирийна ғайру йасийрин
                Сарний ваман халақту ваҳийдан
                Важаааалту лаҳу малан мамдудан
                Вабанийна шуҳудан
                Вамаҳҳадту лаҳу тамҳийдан
                Сумма йатмааау ан азийда
                Калла иннаҳу кана лиайатина ааанийдан
                Саорҳиқуҳу саааудан
                Иннаҳу факкара вақаддара
                Фақутила кайфа қаддара
                Сумма қутила кайфа қаддара
                Сумма насара
                Сумма ааабаса вабасара
                Сумма адбара вайстакбара
                Фақала ин ҳаса илла сиҳрун йусару
                Ин ҳаса илла қаулу албашари
                Саослийҳи сақара
                Вама адрака ма сақару
                Ла тубқий вала тасару
                Лауваҳатун лилбашари
                Ааалайҳа тисааата ааашара
                Вама жаааална ашаба аннари илла малайкатан вама жаааална ааиддатаҳум илла фитнатан лиллазийна кафару лийастайқина аллазийна уту алкитаба вайаздада аллазийна аману ийманан вала йартаба аллазийна уту алкитаба ваалмуминуна валийақула аллазийна фий қулубиҳим марадун ваалкафируна маса арада аллааҳу биҳаса масалан касалика йудиллу аллааҳу ман йашао вайаҳдий ман йашао вама йаааламу жунуда роббика илла ҳува вама ҳийа илла сикра лилбашари
                Калла ваалқамари
                Вааллайли ис адбара
                Ваалссубҳи иса асфара
                Иннаҳа лайҳда алкубари
                Насийран лилбашари
                Лиман шаа минкум ан йатақаддама ау йатааххара
                Куллу нафсин бима касабат роҳийнатун
                Илла ашаба алйамийни
                Фий жаннатин йатасаалуна
                Ааани алмужримийна
                Ма салакакум фий сақара
                Қалу лам наку мина алмусаллийна
                Валам наку нутааиму алмискийна
                Вакунна нахуду маааа алхайдийна
                Вакунна нукассибу бийауми аддийни
                Ҳатта атана алйақийну
                Фама танфааауҳум шафаааату ашшафиааийна
                Фама лаҳум ааани аттаскирати муааридийна
                Кааннаҳум ҳумурун мустанфиратун
                Фаррат мин қасваратин
                Бал йурийду куллу имрийн минҳум ан йута суҳуфан мунашшаратан
                Калла бал ла йахафуна алахирата
                Калла иннаҳу таскиратун
                Фаман шаа сакароҳу
                Вама йаскуруна илла ан йашаа аллааҳу ҳува аҳлу аттақва вааҳлу алмағфирати
            """.trimIndent(),
        ),
        Surah(
            id = 75,
            arabicName = "القيامة",
            latinName = "Al-Qiyamah",
            transliteration = """
                Ла оқсиму бийауми алқийамати
                Вала оқсиму биалннафси аллаувамати
                Айаҳсабу алинсану аллан нажмаааа ааисамаҳу
                Бала қадирийна ааала ан нусаувийа бананаҳу
                Бал йурийду алинсану лийафжура амамаҳу
                Йасалу аййана йауму алқийамати
                Файса бариқа албасару
                Вахасафа алқамару
                Важумиааа ашшамсу ваалқамару
                Йақулу алинсану йаумайсин айна алмафарру
                Калла ла вазара
                Ила роббика йаумайсин алмустақарру
                Йунаббао алинсану йаумайсин бима қаддама вааххара
                Бали алинсану ааала нафсиҳи басийратун
                Валау алқа маааасийроҳу
                Ла туҳаррик биҳи лисанака литааажала биҳи
                Инна ааалайна жамаааҳу вақуранаҳу
                Файса қаранаҳу файттабиаа қуранаҳу
                Сумма инна ааалайна байанаҳу
                Калла бал туҳиббуна алааажилата
                Ватасаруна алахирата
                Вужуҳун йаумайсин надиратун
                Ила роббиҳа насиратун
                Вауужуҳун йаумайсин басиратун
                Тасунну ан йуфааала биҳа фақиратун
                Калла иса балағати аттарақийа
                Вақийла ман рақин
                Васанна аннаҳу алфирақу
                Вайлтаффати ассақу биалссақи
                Ила роббика йаумайсин алмасақу
                Фала саддақа вала салла
                Валакин кассаба ватауалла
                Сумма саҳаба ила аҳлиҳи йатаматта
                Аула лака фаавла
                Сумма аула лака фаавла
                Айаҳсабу алинсану ан йутрака судан
                Алам йаку нутфатан мин манаййин йумна
                Сумма кана ааалақатан фахалақа фасаува
                Фажаааала минҳу аззаужайни ассакара ваалонса
                Алайса салика биқадирин ааала ан йуҳйийа алмаута
            """.trimIndent(),
        ),
        Surah(
            id = 76,
            arabicName = "الانسان",
            latinName = "Al-Insan",
            transliteration = """
                Ҳал ата ааала алинсани ҳийнун мина аддаҳри лам йакун шайан маскуран
                Инна халақна алинсана мин нутфатин амшажин набталийҳи фажаааалнаҳу самийааан басийран
                Инна ҳадайнаҳу ассабийла имма шакиран ваймма кафуран
                Инна ааатадна лилкафирийна саласила ваағлалан васаааийран
                Инна алабрара йашробуна мин касин кана мизажуҳа кафуран
                Ааайнан йашробу биҳа ааибаду аллааҳи йуфажжирунаҳа тафжийран
                Йуфуна биалннасри вайахафуна йауман кана шарруҳу мустатийран
                Вайутааимона аттаааама ааала ҳуббиҳи мискийнан вайатийман ваасийран
                Иннама нутааимукум ливажҳи аллааҳи ла нурийду минкум жазаан вала шукуран
                Инна нахафу мин роббина йауман ааабусан қамтарийран
                Фауақаҳуму аллааҳу шарра салика алйауми валаққаҳум надратан васуруран
                Важазаҳум бима сабару жаннатан ваҳарийран
                Муттакиийна фийҳа ааала аларайки ла йарауна фийҳа шамсан вала замҳарийран
                Ваданийатан ааалайҳим силалуҳа васуллилат қутуфуҳа таслийлан
                Вайутафу ааалайҳим бианийатин мин фиддатин вааквабин канат қауарийра
                Қауарийра мин фиддатин қаддаруҳа тақдийран
                Вайусқауна фийҳа касан кана мизажуҳа занжабийлан
                Ааайнан фийҳа тусамма салсабийлан
                Вайатуфу ааалайҳим вилданун мухалладуна иса раайтаҳум ҳасибтаҳум лулуан мансуран
                Вайса раайта самма раайта наааийман вамулкан кабийран
                Ааалийаҳум сийабу сундусин худрун вайстабрақун ваҳуллу асауира мин фиддатин васақаҳум роббуҳум шаробан таҳуран
                Инна ҳаса кана лакум жазаан вакана сааайукум машкуран
                Инна наҳну наззална ааалайка алқурана танзийлан
                Файсбир лиҳукми роббика вала тутиаа минҳум асиман ау кафуран
                Ваоскури исма роббика букратан ваасийлан
                Вамина аллайли фаосжуд лаҳу васаббиҳҳу лайлан тауийлан
                Инна ҳаолай йуҳиббуна алааажилата вайасаруна варааҳум йауман сақийлан
                Наҳну халақнаҳум вашададна асроҳум вайса шина баддална амсалаҳум табдийлан
                Инна ҳасиҳи таскиратун фаман шаа иттахаса ила роббиҳи сабийлан
                Вама ташауна илла ан йашаа аллааҳу инна аллааҳа кана ааалийман ҳакийман
                Йудхилу ман йашао фий роҳматиҳи ваалссалимийна аааадда лаҳум ааасабан алийман
            """.trimIndent(),
        ),
        Surah(
            id = 77,
            arabicName = "المرسلات",
            latinName = "Al-Mursalat",
            transliteration = """
                Ваалмурсалати ааурфан
                Фаалааасифати ааасфан
                Ваалннаширати нашран
                Фаалфариқати фарқан
                Фаалмулқийати сикран
                Ааусран ау нусран
                Иннама туааадуна лауақиааун
                Файса аннужуму тумисат
                Вайса ассамао фурижат
                Вайса алжибалу нусифат
                Вайса аррусулу оққитат
                Лиаййи йаумин ожжилат
                Лийауми алфасли
                Вама адрака ма йауму алфасли
                Вайлун йаумайсин лилмукассибийна
                Алам нуҳлики алаувалийна
                Сумма нутбиаауҳуму алахирийна
                Касалика нафааалу биалмужримийна
                Вайлун йаумайсин лилмукассибийна
                Алам нахлуқкум мин майн маҳийнин
                Фажаааалнаҳу фий қарарин макийнин
                Ила қадарин мааалумин
                Фақадарна фаниаама алқадируна
                Вайлун йаумайсин лилмукассибийна
                Алам нажааали аларда кифатан
                Аҳйаан ваамватан
                Важаааална фийҳа рауасийа шамихатин ваасқайнакум маан фуратан
                Вайлун йаумайсин лилмукассибийна
                Инталиқу ила ма кунтум биҳи тукассибуна
                Инталиқу ила силлин сий саласи шуааабин
                Ла салийлин вала йуғний мина аллааҳаби
                Иннаҳа тармий бишарарин каалқасри
                Кааннаҳу жималатун суфрун
                Вайлун йаумайсин лилмукассибийна
                Ҳаса йауму ла йантиқуна
                Вала йусану лаҳум файааатасируна
                Вайлун йаумайсин лилмукассибийна
                Ҳаса йауму алфасли жамааанакум ваалаувалийна
                Файн кана лакум кайдун факийдуни
                Вайлун йаумайсин лилмукассибийна
                Инна алмуттақийна фий силалин вааауйунин
                Вафауакиҳа мимма йаштаҳуна
                Кулу вайшробу ҳанийан бима кунтум тааамалуна
                Инна касалика нажзий алмуҳсинийна
                Вайлун йаумайсин лилмукассибийна
                Кулу ватаматтааау қалийлан иннакум мужримуна
                Вайлун йаумайсин лилмукассибийна
                Вайса қийла лаҳуму иркааау ла йаркааауна
                Вайлун йаумайсин лилмукассибийна
                Фабиаййи ҳадийсин бааадаҳу йуминуна
            """.trimIndent(),
        ),
        Surah(
            id = 78,
            arabicName = "النبإ",
            latinName = "An-Naba",
            transliteration = """
                Ааамма йатасаалуна
                Ааани аннабай алааасийми
                Аллазий ҳум фийҳи мухталифуна
                Калла сайаааламуна
                Сумма калла сайаааламуна
                Алам нажааали аларда миҳадан
                Ваалжибала аутадан
                Вахалақнакум азважан
                Важаааална наумакум субатан
                Важаааална аллайла либасан
                Важаааална аннаҳара маааашан
                Вабанайна фауқакум сабааан шидадан
                Важаааална сиражан ваҳҳажан
                Ваанзална мина алмуаасирати маан сажжажан
                Линухрижа биҳи ҳаббан ванабатан
                Важаннатин алфафан
                Инна йаума алфасли кана мийқатан
                Йаума йунфаху фий ассури фататуна афважан
                Вафутиҳати ассамао факанат абвабан
                Васуййирати алжибалу факанат саробан
                Инна жаҳаннама канат мирсадан
                Лилттағийна маабан
                Лабисийна фийҳа аҳқабан
                Ла йасуқуна фийҳа бардан вала шаробан
                Илла ҳамийман вағассақан
                Жазаан вифақан
                Иннаҳум кану ла йаржуна ҳисабан
                Вакассабу биайатина киссабан
                Вакулла шайин аҳсайнаҳу китабан
                Фасуқу фалан назийдакум илла ааасабан
                Инна лилмуттақийна мафазан
                Ҳадайқа ваааанабан
                Вакауааайба атробан
                Вакасан диҳақан
                Ла йасмааауна фийҳа лағван вала киссабан
                Жазаан мин роббика ааатаан ҳисабан
                Робби ассамауати вааларди вама байнаҳума арроҳмани ла йамликуна минҳу хитабан
                Йаума йақуму арруҳу ваалмалайкату саффан ла йатакалламуна илла ман асина лаҳу арроҳману вақала сауабан
                Салика алйауму алҳаққу фаман шаа иттахаса ила роббиҳи маабан
                Инна ансарнакум ааасабан қарийбан йаума йансуру алмаро ма қаддамат йадаҳу вайақулу алкафиру йа лайтаний кунту туробан
            """.trimIndent(),
        ),
        Surah(
            id = 79,
            arabicName = "النازعات",
            latinName = "An-Nazi'at",
            transliteration = """
                Ваалнназиааати ғарқан
                Ваалннашитати наштан
                Ваалссабиҳати сабҳан
                Фаалссабиқати сабқан
                Фаалмудаббирати амран
                Йаума таржуфу арражифату
                Татбааауҳа аррадифату
                Қулубун йаумайсин важифатун
                Абсаруҳа хашиааатун
                Йақулуна айнна ламардудуна фий алҳафирати
                Айса кунна ааисаман нахиратан
                Қалу тилка исан карратун хасиратун
                Файннама ҳийа зажратун ваҳидатун
                Файса ҳум биалссаҳирати
                Ҳал атака ҳадийсу муса
                Ис надаҳу роббуҳу биалвади алмуқаддаси туван
                Исҳаб ила фирааауна иннаҳу таға
                Фақул ҳал лака ила ан тазакка
                Вааҳдийака ила роббика фатахша
                Фаароҳу алайата алкубра
                Факассаба вааааса
                Сумма адбара йасааа
                Фаҳашара фанада
                Фақала ана роббукуму алааала
                Фаахасаҳу аллааҳу накала алахирати ваалула
                Инна фий салика лааайбратан лиман йахша
                Аантум ашадду халқан ами ассамао банаҳа
                Рафаааа самкаҳа фасауваҳа
                Ваағташа лайлаҳа ваахража дуҳаҳа
                Вааларда бааада салика даҳаҳа
                Ахража минҳа мааҳа вамараааҳа
                Ваалжибала арсаҳа
                Матаааан лакум валианааамикум
                Файса жаати аттаммату алкубра
                Йаума йатасаккару алинсану ма саааа
                Вабурризати алжаҳийму лиман йара
                Фаамма ман таға
                Ваасара алҳайата аддунйа
                Файнна алжаҳийма ҳийа алмауа
                Ваама ман хафа мақама роббиҳи ванаҳа аннафса ааани алҳауа
                Файнна алжанната ҳийа алмауа
                Йасалунака ааани ассаааати аййана мурсаҳа
                Фийма анта мин сикроҳа
                Ила роббика мунтаҳаҳа
                Иннама анта мунсиру ман йахшаҳа
                Кааннаҳум йаума йараунаҳа лам йалбасу илла ааашиййатан ау дуҳаҳа
            """.trimIndent(),
        ),
        Surah(
            id = 80,
            arabicName = "عبس",
            latinName = "'Abasa",
            transliteration = """
                Ааабаса ватауалла
                Ан жааҳу алааама
                Вама йудрийка лааааллааҳу йаззакка
                Ау йассаккару фатанфааааҳу ассикра
                Амма мани истағна
                Фаанта лаҳу тасадда
                Вама ааалайка алла йаззакка
                Ваамма ман жаака йасааа
                Ваҳува йахша
                Фаанта ааанҳу талаҳҳа
                Калла иннаҳа таскиратун
                Фаман шаа сакароҳу
                Фий суҳуфин мукарраматин
                Марфуааатин мутаҳҳаратин
                Биайдий сафаратин
                Кирамин бараратин
                Қутила алинсану ма акфароҳу
                Мин аййи шайин халақаҳу
                Мин нутфатин халақаҳу фақаддароҳу
                Сумма ассабийла йассароҳу
                Сумма аматаҳу фаақбароҳу
                Сумма иса шаа аншароҳу
                Калла ламма йақди ма амароҳу
                Фалйансури алинсану ила таааамиҳи
                Анна сабабна алмаа саббан
                Сумма шақақна аларда шаққан
                Фаанбатна фийҳа ҳаббан
                Вааайнабан вақадбан
                Вазайтунан ванахлан
                Ваҳадайқа ғулбан
                Вафакиҳатан вааббан
                Матаааан лакум валианааамикум
                Файса жаати ассаххату
                Йаума йафирру алмаро мин ахийҳи
                Ваоммиҳи ваабийҳи
                Васаҳибатиҳи вабанийҳи
                Ликулли имрийн минҳум йаумайсин шанун йуғнийҳи
                Вужуҳун йаумайсин мусфиратун
                Даҳикатун мустабширатун
                Вауужуҳун йаумайсин ааалайҳа ғабаратун
                Тарҳақуҳа қатаратун
                Олайка ҳуму алкафарату алфажарату
            """.trimIndent(),
        ),
        Surah(
            id = 81,
            arabicName = "التكوير",
            latinName = "At-Takwir",
            transliteration = """
                Иса ашшамсу куввират
                Вайса аннужуму инкадарат
                Вайса алжибалу суййират
                Вайса алааишару аауттилат
                Вайса алвуҳушу ҳушират
                Вайса албиҳару сужжират
                Вайса аннуфусу зуввижат
                Вайса алмауудату суилат
                Биаййи санбин қутилат
                Вайса ассуҳуфу нушират
                Вайса ассамао кушитат
                Вайса алжаҳийму суааааират
                Вайса алжаннату озлифат
                Ааалимат нафсун ма аҳдарат
                Фала оқсиму биалхуннаси
                Алжауари алкуннаси
                Вааллайли иса ааасаааса
                Ваалссубҳи иса танаффаса
                Иннаҳу лақаулу расулин кариймин
                Сий қувватин ааинда сий алааарши макийнин
                Мутааайн самма амийнин
                Вама саҳибукум бимажнунин
                Валақад рааҳу биалофуқи алмубийни
                Вама ҳува ааала алғайби биданийнин
                Вама ҳува биқаули шайтанин ражиймин
                Фаайна тасҳабуна
                Ин ҳува илла сикрун лилаааламийна
                Лиман шаа минкум ан йастақийма
                Вама ташауна илла ан йашаа аллааҳу роббу алаааламийна
            """.trimIndent(),
        ),
        Surah(
            id = 82,
            arabicName = "الإنفطار",
            latinName = "Al-Infitar",
            transliteration = """
                Иса ассамао инфатарат
                Вайса алкауакибу интасарат
                Вайса албиҳару фужжират
                Вайса алқубуру буаасират
                Ааалимат нафсун ма қаддамат вааххарат
                Йа аййуҳа алинсану ма ғаррака бироббика алкарийми
                Аллазий халақака фасаувака фаааадалака
                Фий аййи суратин ма шаа раккабака
                Калла бал тукассибуна биалддийни
                Вайнна ааалайкум лаҳафисийна
                Кираман катибийна
                Йаааламуна ма тафааалуна
                Инна алабрара лафий наааиймин
                Вайнна алфужжара лафий жаҳиймин
                Йаслаунаҳа йаума аддийни
                Вама ҳум ааанҳа биғайбийна
                Вама адрака ма йауму аддийни
                Сумма ма адрака ма йауму аддийни
                Йаума ла тамлику нафсун линафсин шайан вааламру йаумайсин лиллаҳи
            """.trimIndent(),
        ),
        Surah(
            id = 83,
            arabicName = "المطففين",
            latinName = "Al-Mutaffifin",
            transliteration = """
                Вайлун лилмутаффифийна
                Аллазийна иса икталу ааала аннаси йастауфуна
                Вайса калуҳум ау вазануҳум йухсируна
                Ала йасунну олайка аннаҳум мабааусуна
                Лийаумин ааасиймин
                Йаума йақуму аннасу лиробби алаааламийна
                Калла инна китаба алфужжари лафий сижжийнин
                Вама адрака ма сижжийнун
                Китабун марқумун
                Вайлун йаумайсин лилмукассибийна
                Аллазийна йукассибуна бийауми аддийни
                Вама йукассибу биҳи илла куллу муаатадин асиймин
                Иса тутла ааалайҳи айатуна қала асатийру алаувалийна
                Калла бал рана ааала қулубиҳим ма кану йаксибуна
                Калла иннаҳум ааан роббиҳим йаумайсин ламаҳжубуна
                Сумма иннаҳум ласалу алжаҳийми
                Сумма йуқалу ҳаса аллазий кунтум биҳи тукассибуна
                Калла инна китаба алабрари лафий ааиллиййийна
                Вама адрака ма ааиллиййуна
                Китабун марқумун
                Йашҳадуҳу алмуқарробуна
                Инна алабрара лафий наааиймин
                Ааала аларайки йансуруна
                Тааарифу фий вужуҳиҳим надрата аннаааийми
                Йусқауна мин роҳийқин махтумин
                Хитамуҳу мискун вафий салика фалйатанафаси алмутанафисуна
                Вамизажуҳу мин тасниймин
                Ааайнан йашробу биҳа алмуқарробуна
                Инна аллазийна ажраму кану мина аллазийна аману йазакуна
                Вайса марру биҳим йатағамазуна
                Вайса инқалабу ила аҳлиҳиму инқалабу факиҳийна
                Вайса раавҳум қалу инна ҳаолай ладаллуна
                Вама орсилу ааалайҳим ҳафисийна
                Фаалйаума аллазийна аману мина алкуффари йазакуна
                Ааала аларайки йансуруна
                Ҳал суввиба алкуффару ма кану йафааалуна
            """.trimIndent(),
        ),
        Surah(
            id = 84,
            arabicName = "الإنشقاق",
            latinName = "Al-Inshiqaq",
            transliteration = """
                Иса ассамао иншаққат
                Ваасинат лироббиҳа ваҳуққат
                Вайса аларду муддат
                Ваалқат ма фийҳа ватахаллат
                Ваасинат лироббиҳа ваҳуққат
                Йа аййуҳа алинсану иннака кадиҳун ила роббика казан фамулақийҳи
                Фаама ман утийа китабаҳу бийамийниҳи
                Фасауфа йуҳасабу ҳисабан йасийран
                Вайанқалибу ила аҳлиҳи масруран
                Ваамма ман утийа китабаҳу вараа саҳриҳи
                Фасауфа йадаау субуран
                Вайасла саааийран
                Иннаҳу кана фий аҳлиҳи масруран
                Иннаҳу санна ан лан йаҳура
                Бала инна роббаҳу кана биҳи басийран
                Фала оқсиму биалшшафақи
                Вааллайли вама васақа
                Ваалқамари иса иттасақа
                Латаркабунна табақан ааан табақин
                Фама лаҳум ла йуминуна
                Вайса қуриа ааалайҳиму алқурану ла йасжудуна
                Бали аллазийна кафару йукассибуна
                Вааллааҳу аааламу бима йуаауна
                Фабашширҳум биааасабин алиймин
                Илла аллазийна аману ваааамилу ассалиҳати лаҳум ажрун ғайру мамнунин
            """.trimIndent(),
        ),
        Surah(
            id = 85,
            arabicName = "البروج",
            latinName = "Al-Buruj",
            transliteration = """
                Ваалссамай сати албуружи
                Ваалйауми алмауаауди
                Вашаҳидин вамашҳудин
                Қутила ашабу алухдуди
                Аннари сати алвақуди
                Ис ҳум ааалайҳа қуааудун
                Ваҳум ааала ма йафааалуна биалмуминийна шуҳудун
                Вама нақаму минҳум илла ан йумину биаллааҳи алааазийзи алҳамийди
                Аллазий лаҳу мулку ассамауати вааларди вааллааҳу ааала кулли шайин шаҳийдун
                Инна аллазийна фатану алмуминийна ваалмуминати сумма лам йатубу фалаҳум ааасабу жаҳаннама валаҳум ааасабу алҳарийқи
                Инна аллазийна аману ваааамилу ассалиҳати лаҳум жаннатун тажрий мин таҳтиҳа аланҳару салика алфаузу алкабийру
                Инна батша роббика лашадийдун
                Иннаҳу ҳува йубдио вайуааийду
                Ваҳува алғафуру алвадуду
                Су алааарши алмажийди
                Фаааааалун лима йурийду
                Ҳал атака ҳадийсу алжунуди
                Фирааауна васамуда
                Бали аллазийна кафару фий таксийбин
                Вааллааҳу мин варайҳим муҳийтун
                Бал ҳува қуранун мажийдун
                Фий лауҳин маҳфусин
            """.trimIndent(),
        ),
        Surah(
            id = 86,
            arabicName = "الطارق",
            latinName = "At-Tariq",
            transliteration = """
                Ваалссамай ваалттариқи
                Вама адрака ма аттариқу
                Аннажму ассақибу
                Ин куллу нафсин ламма ааалайҳа ҳафисун
                Фалйансури алинсану мимма хулиқа
                Хулиқа мин майн дафиқин
                Йахружу мин байни ассулби ваалттарайби
                Иннаҳу ааала ражааиҳи лақадирун
                Йаума тубла ассарайру
                Фама лаҳу мин қувватин вала насирин
                Ваалссамай сати арражааи
                Вааларди сати ассадааи
                Иннаҳу лақаулун фаслун
                Вама ҳува биалҳазли
                Иннаҳум йакийдуна кайдан
                Ваакийду кайдан
                Фамаҳҳили алкафирийна амҳилҳум рувайдан
            """.trimIndent(),
        ),
        Surah(
            id = 87,
            arabicName = "الأعلى",
            latinName = "Al-A'la",
            transliteration = """
                Саббиҳи исма роббика алааала
                Аллазий халақа фасаува
                Вааллазий қаддара фаҳада
                Вааллазий ахража алмарааа
                Фажаааалаҳу ғусаан аҳва
                Сануқриока фала танса
                Илла ма шаа аллааҳу иннаҳу йаааламу алжаҳра вама йахфа
                Вануйассирука лилйусра
                Фасаккир ин нафаааати ассикра
                Сайассаккару ман йахша
                Вайатажаннабуҳа алашқа
                Аллазий йасла аннара алкубра
                Сумма ла йамуту фийҳа вала йаҳйа
                Қад афлаҳа ман тазакка
                Васакара исма роббиҳи фасалла
                Бал тусируна алҳайата аддунйа
                Ваалахирату хайрун ваабқа
                Инна ҳаса лафий ассуҳуфи алула
                Суҳуфи иброҳийма вамуса
            """.trimIndent(),
        ),
        Surah(
            id = 88,
            arabicName = "الغاشية",
            latinName = "Al-Ghashiyah",
            transliteration = """
                Ҳал атака ҳадийсу алғашийати
                Вужуҳун йаумайсин хашиааатун
                Ааамилатун насибатун
                Тасла наран ҳамийатан
                Тусқа мин ааайнин анийатин
                Лайса лаҳум таааамун илла мин дарийааин
                Ла йусмину вала йуғний мин жуааин
                Вужуҳун йаумайсин нааайматун
                Лисааайиҳа радийатун
                Фий жаннатин ааалийатин
                Ла тасмааау фийҳа лағийатан
                Фийҳа ааайнун жарийатун
                Фийҳа сурурун марфуааатун
                Вааквабун маудуааатун
                Ванамариқу масфуфатун
                Вазаробиййу мабсусатун
                Афала йансуруна ила алибили кайфа хулиқат
                Вайла ассамай кайфа руфиааат
                Вайла алжибали кайфа нусибат
                Вайла аларди кайфа сутиҳат
                Фасаккир иннама анта мусаккирун
                Ласта ааалайҳим бимусайтирин
                Илла ман тауалла вакафара
                Файуааассибуҳу аллааҳу алааасаба алакбара
                Инна илайна ийабаҳум
                Сумма инна ааалайна ҳисабаҳум
            """.trimIndent(),
        ),
        Surah(
            id = 89,
            arabicName = "الفجر",
            latinName = "Al-Fajr",
            transliteration = """
                Ваалфажри
                Валайалин ааашрин
                Ваалшшафааи ваалватри
                Вааллайли иса йасри
                Ҳал фий салика қасамун лисий ҳижрин
                Алам тара кайфа фаааала роббука биааадин
                Ирама сати алааимади
                Аллатий лам йухлақ мислуҳа фий албилади
                Васамуда аллазийна жабу ассахра биалвади
                Вафирааауна сий алаутади
                Аллазийна тағау фий албилади
                Фааксару фийҳа алфасада
                Фасабба ааалайҳим роббука саута ааасабин
                Инна роббака лабиалмирсади
                Фаамма алинсану иса ма ибталаҳу роббуҳу фаакрамаҳу ванаааааамаҳу файақулу роббий акрамани
                Ваамма иса ма ибталаҳу фақадара ааалайҳи ризқаҳу файақулу роббий аҳанани
                Калла бал ла тукримуна алйатийма
                Вала таҳаддуна ааала таааами алмискийни
                Ватакулуна аттураса аклан ламман
                Ватуҳиббуна алмала ҳуббан жамман
                Калла иса дуккати аларду даккан даккан
                Важаа роббука ваалмалаку саффан саффан
                Важийа йаумайсин бижаҳаннама йаумайсин йатасаккару алинсану ваанна лаҳу ассикра
                Йақулу йа лайтаний қаддамту лиҳайатий
                Файаумайсин ла йуааассибу ааасабаҳу аҳадун
                Вала йусиқу васақаҳу аҳадун
                Йа аййатуҳа аннафсу алмутмайннату
                Иржиааий ила роббики радийатан мардиййатан
                Фаодхулий фий ааибадий
                Ваодхулий жаннатий
            """.trimIndent(),
        ),
        Surah(
            id = 90,
            arabicName = "البلد",
            latinName = "Al-Balad",
            transliteration = """
                Ла оқсиму биҳаса албалади
                Ваанта ҳиллун биҳаса албалади
                Вауалидин вама валада
                Лақад халақна алинсана фий кабадин
                Айаҳсабу ан лан йақдира ааалайҳи аҳадун
                Йақулу аҳлакту малан лубадан
                Айаҳсабу ан лам йароҳу аҳадун
                Алам нажааал лаҳу ааайнайни
                Валисанан вашафатайни
                Ваҳадайнаҳу аннаждайни
                Фала иқтаҳама алааақабата
                Вама адрака ма алааақабату
                Факку рақабатин
                Ау итааамун фий йаумин сий масғабатин
                Йатийман са мақробатин
                Ау мискийнан са матробатин
                Сумма кана мина аллазийна аману ватауасау биалссабри ватауасау биалмарҳамати
                Олайка ашабу алмайманати
                Вааллазийна кафару биайатина ҳум ашабу алмашамати
                Ааалайҳим нарун мусадатун
            """.trimIndent(),
        ),
        Surah(
            id = 91,
            arabicName = "الشمس",
            latinName = "Ash-Shams",
            transliteration = """
                Ваалшшамси вадуҳаҳа
                Ваалқамари иса талаҳа
                Ваалннаҳари иса жаллааҳа
                Вааллайли иса йағшаҳа
                Ваалссамай вама банаҳа
                Вааларди вама таҳаҳа
                Ванафсин вама сауваҳа
                Фаалҳамаҳа фужуроҳа ватақваҳа
                Қад афлаҳа ман заккаҳа
                Вақад хаба ман дассаҳа
                Кассабат самуду битағваҳа
                Иси инбааааса ашқаҳа
                Фақала лаҳум расулу аллааҳи нақата аллааҳи васуқйаҳа
                Факассабуҳу фаааақаруҳа фадамдама ааалайҳим роббуҳум бисанбиҳим фасауваҳа
                Вала йахафу аауқбаҳа
            """.trimIndent(),
        ),
        Surah(
            id = 92,
            arabicName = "الليل",
            latinName = "Al-Layl",
            transliteration = """
                Вааллайли иса йағша
                Ваалннаҳари иса тажалла
                Вама халақа ассакара ваалонса
                Инна сааайакум лашатта
                Фаамма ман ааата вайттақа
                Васаддақа биалҳусна
                Фасануйассируҳу лилйусра
                Ваамма ман бахила вайстағна
                Вакассаба биалҳусна
                Фасануйассируҳу лилааусра
                Вама йуғний ааанҳу малуҳу иса тарадда
                Инна ааалайна лалҳуда
                Вайнна лана лалахирата ваалула
                Фаансартукум наран таласса
                Ла йаслаҳа илла алашқа
                Аллазий кассаба ватауалла
                Васайужаннабуҳа алатқа
                Аллазий йутий малаҳу йатазакка
                Вама лиаҳадин ааиндаҳу мин ниааматин тужза
                Илла ибтиғаа важҳи роббиҳи алааала
                Валасауфа йарда
            """.trimIndent(),
        ),
        Surah(
            id = 93,
            arabicName = "الضحى",
            latinName = "Ad-Duhaa",
            transliteration = """
                Ваалддуҳа
                Вааллайли иса сажа
                Ма ваддаааака роббука вама қала
                Валалахирату хайрун лака мина алула
                Валасауфа йуаатийка роббука фатарда
                Алам йажидка йатийман фаава
                Вауажадака даллан фаҳада
                Вауажадака ааайлан фаағна
                Фаамма алйатийма фала тақҳар
                Ваамма ассайла фала танҳар
                Ваамма биниаамати роббика фаҳаддис
            """.trimIndent(),
        ),
        Surah(
            id = 94,
            arabicName = "الشرح",
            latinName = "Ash-Sharh",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Алам нашрах лака содрок
                                Ва возаънаа ъанка визрок
                                Аллазий анқада захрок
                                Ва рафаънаа лака зикрок
                                Фа-инна маъал-ъусри юсрон
                                Инна маъал-ъусри юсрон
                                Фа изаа фарағта фансаб
                                Ва илаа роббика фарғаб
            """.trimIndent(),
        ),
        Surah(
            id = 95,
            arabicName = "التين",
            latinName = "At-Tin",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Ват-тиини ваз-зайтууни
                                Ва туурии сиинийин
                                Ва ҳаазаал-баладил-амийн
                                Лақад халақнаал-инсаана фии ахсани тақуҳим
                                Сумма радднааҳу асфаласаафилиин
                                Иллаа аллазиина аааману ва ъамилус-соолихаати фалахум ажрун ғайру мамнуун
                                Фамаа юказзибука баъду бид-диин
                                Алайса-ллооҳу би ахкамил-ҳаакимиин
            """.trimIndent(),
        ),
        Surah(
            id = 96,
            arabicName = "العلق",
            latinName = "Al-'Alaq",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Иқра' бисми роббикаллазии халақ
                                Халақал-инсаана мин ъалак
                                Иқра' ва роббука-л-акрам
                                Аллазий ъаллама бил-қалам
                                Ъалламал-инсаана маа лам йаълам
                                Каллаа иннал-инсаана ляятғаа
                                Арраааҳу стаъғнаа
                                Инна илаа роббика-р-ружъа
                                Араайтал-лазии йанҳаа
                                Абдан изаа саллаа
                                Араайта ин каана ъалал-худаа
                                Ау амара бит-тақваа
                                Араайта ин каззаба ва таваллаа
                                Алам йаълам бианналлоҳа яроо
                                Каллаа лаин лам йантаҳи ланасфаъан бин-наасияҳ
                                Наасиятин каазибатин хоотий'а
                                Фалйад'у наадийаҳ
                                Санад'уз-забаанияҳ
                                Каллаа лаа тутиъҳу васжуд вақтариб
            """.trimIndent(),
        ),
        Surah(
            id = 97,
            arabicName = "القدر",
            latinName = "Al-Qadr",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Иннаа анзальнааҳу фии лайлати-л-қадр
                                Ва маа адрока маа лайлатул-қадр
                                Лайлатул-қадри хайрун мин алфиш-шахр
                                Таназзалул-малааику вар-руҳу фииҳаа би изни роббиҳим мин кулли амр
                                Салаамун ҳияа хаттаа матлааъил-фажр
            """.trimIndent(),
        ),
        Surah(
            id = 98,
            arabicName = "البينة",
            latinName = "Al-Bayyinah",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Лам йакун иллазиина кафару мин аҳлил-китааби вал-мушрикина мунфаккиина ҳаттаа таътияхумул-баййинаҳ
                                Расуулун миналлоҳи йатлуу сухуфам мутахҳараҳ
                                Фииҳаа кутубун қаййимаҳ
                                Ва маа тафаррақаллазиина ъутуу-л-китааба иллаа мин баъди маа жаааҳумул-баййинаҳ
                                Ва маа умируу иллаа лиъбудуллоҳа мухлисиинал-лаҳу-ддиин ҳунафаа ва юқиймус-солаата ва ю'түз-заката ва зааликта дину-л-қаййимаҳ
                                Инналлазиина кафару мин аҳлил-китааби вал-мушрикина фии наари Жаҳаннама хоолидиина фииҳаа улааика ҳум шарарул-барийяҳ
                                Инналлазиина аааману ва ъамилус-соолихаати улааика ҳум хайрул-барийяҳ
                                Жазааухум ъинда роббиҳим жаннаату ъаднин тажрий мин таҳтиҳал-анҳоару хоолидиина фииҳаа абадаа разийаллоҳу ъанҳум ва разуу ъанҳу зааликал-ъисваан ли ман хошия роббах
            """.trimIndent(),
        ),
        Surah(
            id = 99,
            arabicName = "الزلزلة",
            latinName = "Az-Zalzalah",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Изаа зулзилатил-арду зилзаалаҳаа
                                Ва ахрожатил-арду аҳкъаалаҳаа
                                Ва қоолал-инсаану маа лаҳаа
                                Йавма изин тухаддису ахбаараҳаа
                                Би анна роббака авҳаалаҳаа
                                Йавма изин йасдурун-наасу аштаатан лийуро ааъмалахум
                                Фа ман яъмал мисқоола зарратин хайран йараҳ
                                Ва ман яъмал мисқоола зарратин шарран йараҳ
            """.trimIndent(),
        ),
        Surah(
            id = 100,
            arabicName = "العاديات",
            latinName = "Al-'Adiyat",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Вал-ъодийаати забҳаа
                                Фал-мурияати қадҳаа
                                Фал-муғиратис-субҳаа
                                Фа асарна бихии нақъаа
                                Фа васатна бихии жамъаа
                                Иннал-инсаана ли роббихи лакафуур
                                Ва иннаҳу ъалаа заалика лашаҳийд
                                Ва иннаҳу ли хуббил-хайри лашадиид
                                Афалаа йаъламу изаа буъсирра маа фил-қубур
                                Ва ҳуссила маа фис-судуур
                                Инна роббахум биҳим йавма изин лахабиир
            """.trimIndent(),
        ),
        Surah(
            id = 101,
            arabicName = "القارعة",
            latinName = "Al-Qari'ah",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Ал-қоориъа
                                Мал-қоориъа
                                Ва маа адрока мал-қоориъа
                                Йавма якууун-ннаасу кал-фарашил-мабсуус
                                Ва такуунул-джибаалу кал-ъиҳнил-манфуш
                                Фа аммаа ман сакаулат маваазиинуҳ
                                Фа ҳува фии ъишатир-роодийа
                                Ва аммаа ман хаффат маваазиинуҳ
                                Фа уммуҳу ҳаавия
                                Ва маа адрока маа ҳаавия
                                Наарун хаавия
            """.trimIndent(),
        ),
        Surah(
            id = 102,
            arabicName = "التكاثر",
            latinName = "At-Takathur",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Алҳаакумут-Такосур
                                Ҳаттаа зуртумул-мақаабир
                                Каллаа савфа таъламун
                                Сумма каллаа савфа таъламун
                                Каллаа лау таъламун ъилмал-йақиин
                                Латоровуннал-Жаҳиим
                                Сумма латоровуннаҳа ъайнал-йақиин
                                Сумма латус'алунна йавма изин ъанин-наъийм
            """.trimIndent(),
        ),
        Surah(
            id = 103,
            arabicName = "العصر",
            latinName = "Al-'Asr",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Вал-ъаср
                                Иннал-инсаана лафии хуср
                                Иллаллазиина аааману ва ъамилус-соолихаати ва таваасав бил-ҳаққи ва таваасав бис-сабр
            """.trimIndent(),
        ),
        Surah(
            id = 104,
            arabicName = "الهمزة",
            latinName = "Al-Humazah",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Вайлул-ли кулли ҳумазатил-лумазаҳ
                                Аллазий жамаъа маалан ва аддадаҳ
                                Яҳсабу анна маалаҳу ахладаҳ
                                Каллаа лйумбазанна фил-ҳутама
                                Ва маа адрока мал-ҳутама
                                Нааруллоҳил-муқада
                                Аллатии татталиъу ъалал-афъидаҳ
                                Иннаҳаа ъалайҳим муғсода
                                Фии ъамадим мумаддада
            """.trimIndent(),
        ),
        Surah(
            id = 105,
            arabicName = "الفيل",
            latinName = "Al-Fil",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Алам тара кайфа фаала роббука би асҳаабил-фиил
                                Алам йаджаъл кайдахум фии тадлиил
                                Ва арсала ъалайҳим тойрона абаабийл
                                Тармииҳим би ҳааджаротим мин сижджиил
                                Фа жаъалаҳум каасфин маакуул
            """.trimIndent(),
        ),
        Surah(
            id = 106,
            arabicName = "قريش",
            latinName = "Quraysh",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Лиилафи Қурайш
                                Илаафихим рихлаташ-шитааи вас-сайф
                                Фалйаъбудуу роббаҳааза-л-байт
                                Аллазии атъаамаҳум мин жууъин ва ааманаҳум мин хавф
            """.trimIndent(),
        ),
        Surah(
            id = 107,
            arabicName = "الماعون",
            latinName = "Al-Ma'un",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Араайтал-лазии йуказзибу бид-диин
                                Фазааликал-лазии йадуъул-ятиим
                                Ва лаа йаҳудду ъалаа тооъмил-мискиин
                                Фа вайлул-лил-мусоллиин
                                Аллазиина ҳум ъан солаатиҳим сааҳуун
                                Аллазиина ҳум юроуун
                                Ва ямнаъуунал-мааъуун
            """.trimIndent(),
        ),
        Surah(
            id = 108,
            arabicName = "الكوثر",
            latinName = "Al-Kawthar",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Иннаа аътайнаака-л кавсар
                                Фасалли ли роббика ванҳар
                                Инна шаанииъака ҳувал-абтар
            """.trimIndent(),
        ),
        Surah(
            id = 109,
            arabicName = "الكافرون",
            latinName = "Al-Kafirun",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Қул яа айюҳал коофируун
                                Лаа аъбуду маа таъбудуун
                                Ва лаа антум ъаабидууна маа аъбуд
                                Ва лаа ана ъаабидун маа ъабадтум
                                Ва лаа антум ъаабидууна маа аъбуд
                                Лакум диинукум ва лия диин
            """.trimIndent(),
        ),
        Surah(
            id = 110,
            arabicName = "النصر",
            latinName = "An-Nasr",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Изаа жааа насрууллооҳи вал-фатҳ
                                Ва раайтан-нааса йадхулууна фии диинуллооҳи афваажаа
                                Фасаббих бихамди роббика вастагфирҳу иннаҳу каана тавваабаа
            """.trimIndent(),
        ),
        Surah(
            id = 111,
            arabicName = "المسد",
            latinName = "Al-Masad",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Таббат ядаа Абий Лаҳабин ва табб
                                Маа ағна анҳу маалуҳу ва маа касаб
                                Саяслаа наран заата лаҳаб
                                Ва имраъатуҳу ҳаммаалатал-ҳатаб
                                Фии жиидиҳаа ҳаблун мин-масад
            """.trimIndent(),
        ),
        Surah(
            id = 112,
            arabicName = "الإخلاص",
            latinName = "Al-Ikhlas",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Қул ҳуваллооҳу аҳад
                                Аллооҳус-самад
                                Лам ялид ва лам юулад
                                Ва лам якун-лаҳу куфуван аҳад
            """.trimIndent(),
        ),
        Surah(
            id = 113,
            arabicName = "الفلق",
            latinName = "Al-Falaq",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Қул аъуузу би раббил-фалақ
                                Мин шарри маа холақ
                                Ва мин шарри ғоосиқин изаа вақаб
                                Ва мин шаррин-наффосати фил-ъуқад
                                Ва мин шарри ҳаасидин изаа ҳасад
            """.trimIndent(),
        ),
        Surah(
            id = 114,
            arabicName = "الناس",
            latinName = "An-Nas",
            transliteration = """
                                Бисмиллааҳир роҳмаанир роҳийм
                                Қул аъуузу би раббин-наас
                                Маликин-наас
                                Илааҳин-наас
                                Мин шаррил васваасил хоннаас
                                Аллаазиий ювасвису фиий судуурин-наас
                                Минал жиннати ван-наас
            """.trimIndent(),
        ),
    )

    fun getSurahs(): List<Surah> = surahs
    fun getSurahById(id: Int): Surah? = surahs.firstOrNull { it.id == id }
    fun getNextSurahId(currentId: Int): Int? {
        val currentIndex = surahs.indexOfFirst { it.id == currentId }
        if (currentIndex == -1) return null
        return surahs.getOrNull(currentIndex + 1)?.id
    }
}
